{ "_id" : { "$oid" : "58c78e5e1d41c8139af6930f" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/01/27/4-insightful-quotes-from-alphabet-incs-fourth-quar.aspx&cid=52779359508626&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEU3aZ1vPGSfezC15bvaYEMVfgCUA" ], "sentiment_polarity" : 0.2376391621846167, "headline" : [ "4 Insightful Quotes From Alphabet Inc.'s Fourth Quarter" ], "article_text" : "Highlighting a somewhat muted response from investors, Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) stock is trading about 0.4% lower at the time of this writing on Friday after the company reported its results for the fourth quarter of 2016. While revenue jumped 22% to $26.1 billion and surpassed analysts' consensus estimate (via Thomson Reuters) for revenue of $25.2 billion, the company's earnings of $9.36 per share fell short of a projection for $9.64.\n\nAs investors digest the information from Alphabet's latest report, here's a look at some of the most insightful comments from the company's fourth-quarter earnings call. In these quotes, management discusses the success of the new Google-branded hardware, further opportunity in advertising, and what it considers the three biggest bets for the company beyond its core ad business.\n\nAlphabet's core search business hasn't peaked -- far from it\n\nAfter pointing to the company's impressive 20% consolidated revenue growth in 2016, which management emphasized is actually 24% when excluding the impact of currency headwinds, Alphabet CFO Ruth Porat emphasized (via a Reuters transcript) the opportunity ahead:\n\nThis performance is a testament to the ongoing innovation that is driving our success in mobile search, YouTube, and programmatic advertising, each of which we believe has only begun to scratch the surface. We remain excited about the sizable opportunities that have not yet been tapped.\n\nThese could become major revenue drivers\n\nWith about 86% of Alphabet's total revenue coming from advertising, it's always nice to get an update on whether the company is seeing success on diversifying its revenue sources. To this end, Alphabet made excellent progress in its fourth quarter. Here's what Porat had to say:\n\nAlongside these [advertising] businesses, we are focused on growing additional revenue streams within Google over the medium- and long-term. In 2016, our other revenue line grew 41% on a full year basis reflecting the growth in our Play, hardware and cloud businesses. We see tremendous potential ahead for these businesses, as well as in the continued development of non-advertising revenue streams for YouTube. We're investing in our cloud and hardware businesses, as well as our newer non-ad revenue sources for YouTube, in order to accelerate their progress as major revenue drivers for Google in the next several years.\n\nAlphabet's other revenue growth in the Google segment (not to be confused with Alphabet's \"other bets\") was even more impressive in the company's fourth quarter specifically. Fourth-quarter other revenue soared 62% year over year, to $3.4 billion, accounting for 13% of total revenue, up from 10% of revenue in the year-ago quarter. Management cited hardware, the Google Play app store, and its cloud business as key drivers for the segment.\n\nGoogle-branded hardware looks promising\n\nDrilling down more narrowly on the company's nascent hardware business, which received some extra attention from the company in the fourth quarter when Google launched its voice-activated smart speaker (Google Home) and a new smartphone (Google Pixel), management was optimistic about how new hardware is performing in the marketplace. Google CEO Sundar Pichai explained:\n\nWe introduced a new family of beautiful hardware devices in October that are made by Google, led by Google Home and our Pixel phone which feature the Google Assistant built in. We're thrilled with the reception, as well as the really happy customers we saw over the holiday season. In particular, Google Home was a very popular present that many people opened on Christmas morning. We have committed to this for the long-term, as a great way to bring a beautiful seamless Google experience to people. The early signs are promising, and you can expect us to see us expand our offerings thoughtfully.\n\nAlphabet's three big bets\n\nPichai said that beyond its core advertising business, the company distinctly views \"YouTube, cloud and hardware\" as \"three of our biggest bets.\" So investors should keep an eye on these areas as Alphabet continues to grow its business.\n\nManagement's extreme confidence in incremental opportunity in Alphabet's core search business, along with significant and promising growth in YouTube, cloud, and hardware, continues to make a great case for owning this stock. Not only is the company strengthening the competitive position of its core business, but it's also diversifying its revenue while simultaneously opening the doors to meaningful opportunities beyond advertising.", "sentiment_subjectivity" : 0.5266403209585028, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e601d41c8139af69310" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/01/11/alphabet-inc-earnings-mark-your-calendar.aspx&cid=52779342261619&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHoS7qHH2JdU-PGMT5H061LsgOWEQ" ], "sentiment_polarity" : 0.107346796229775, "headline" : [ "Alphabet, Inc. Earnings: Mark Your Calendar" ], "article_text" : "Google parent company Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) is set to report results for its fourth quarter of 2016 on Thursday, Jan. 26. Before the numbers for the quarter are released, here's a broad overview of some areas to watch.\n\nRevenue and EPS\n\nThe pressure is certainly on for Alphabet's fourth quarter, especially after the company's expectation-beating quarter before it. For Alphabet's third quarter, both the company's revenue and earnings per share (EPS) exceeded expectations. Revenue and non-GAAP (non-generally accepted accounting principles) EPS was $22.5 billion and $9.06, respectively, up significantly from $18.7 billion and $7.35, respectively, in the year-ago quarter. Analysts, on average, expected third-quarter revenue and non-GAAP EPS of $22.1 billion and $8.63.\n\nGoing into Alphabet's fourth quarter, analysts expect robust growth to continue, albeit not as sharply. On average, analysts expect fourth-quarter revenue and EPS of $25.1 billion and $9.63, up 18% and 11%, respectively, year over year.\n\nMetric Q3 YOY Growth Q3 YOY Growth Implied by Consensus Analyst Estimate Revenue 20% 18% Non-GAAP EPS 23% 11%\n\nThere's merit to analysts' conservatism, particularly since Alphabet CFO Ruth Porat went out of her way during the company's third-quarter earnings call to remind analysts that the company will be up against tough year-ago revenue comparisons in the fourth quarter.\n\nPaid clicks and cost-per-clicks\n\nOne of the reasons why Alphabet outperformed expectations in Q3 was because of its big increase in paid clicks, or the total number of clicks for which advertisers paid Google. Aggregate paid clicks in Q3 were up 9% sequentially and 33% year over year. Notably, some of the benefits from such a large increase in paid clicks was offset by 5% and 11% decreases in cost-per-click, or the amount advertisers pay Alphabet for each click, but the outsized gain in paid clicks was significant enough to help drive significant revenue growth.\n\nInvestors should look for look for similar trends in Alphabet's paid clicks and cost-per-clicks in Q4. If the trends diverge in an unexpected direction, investors may want to look for an explanation from management during the company's fourth-quarter earnings call.\n\nNew Google products\n\nAlso, after launching some new Google-branded hardware, investors also may want to look for some updates from management on how these products are faring. While the new products still almost certainly will be immaterial to overall results, a promising start for the new devices could signal bigger opportunity ahead.\n\nIn October, Alphabet launched two new significant products: a Google Pixel smartphone and a Google Home artificial intelligence-enabled smart speaker. The Pixel quickly sold out online, and Google Home ended up selling out in many stores during the holidays -- evidence of the high demand for these new products. Indeed, in a statement to 9to5Google, a Google spokesperson specifically said demand was to blame for the Pixel selling out:\n\nWe're thrilled to see the excitement for our new Pixel phones, and frankly pre-order demand has exceeded our expectations. We're working to restock our inventory as soon as possible.\n\nWhile Alphabet hasn't yet proven it can build a sustainable and meaningful hardware business, maybe the Pixel smartphone and Google Home could finally change this.\n\nAlphabet will report its fourth-quarter results immediately after market close on Jan. 26. Management will host a conference call to discuss the results at 4:30 p.m. EST.", "sentiment_subjectivity" : 0.4950057566546928, "date" : [ "Jan 11, 2017" ] }
{ "_id" : { "$oid" : "58c78e611d41c8139af69311" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/01/30/alphabet-inc-is-making-an-important-change-to-non.aspx&cid=52779364581633&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGysng68mql0tS0Oku-hfibZuLm3w" ], "sentiment_polarity" : 0.1111424807076981, "headline" : [ "Alphabet, Inc. Is Making an Important Change to Non-GAAP Reporting" ], "article_text" : "With Google parent Alphabet's (NASDAQ:GOOG) (NASDAQ:GOOGL) fourth-quarter report now behind it, the company's robust revenue growth and its promising traction in hardware and cloud-computing are getting some time in the spotlight. But there's one other item in the company's most recent quarterly report investors may want to take the time to consider: A key change in the way Alphabet will be calculating its non-GAAP results.\n\nStock-based compensation to get the weight it deserves\n\nIn a surprising move, Alphabet explained in its fourth-quarter earnings call that it will no longer exclude stock-based compensation from its non-GAAP results. The change will weigh on non-GAAP earnings per share, but Alphabet believes it will give investors a better view of the company's regular operations.\n\nAlphabet CFO Ruth Porat explained the change in the company's fourth-quarter earnings call.\n\n[Stock-based compensation] (SBC) has always been an important part of how we reward our employees in a way that aligns their interests with those of all shareholders. Although it's not a cash expense, we consider it to be a real cost of running our business because SBC is critical to our ability to attract and retain the best talent in the world. Starting with our first quarter results for 2017, we will no longer regularly exclude stock­-based compensation expense from non­-GAAP results. Non­-cash stock­-based compensation will continue to be reported on our cash flow statement, but we will no longer be providing a reconciliation from GAAP to non­-GAAP measures that reflects SBC and related tax benefits.\n\nThe change sheds light on the growing cost of Silicon Valley-based talent for tech companies in the Bay Area. Stock-based compensation at companies such as Alphabet and Facebook (NASDAQ:FB) have grown consistently in recent years, so much so that the two companies have recently announced share repurchase programs seeming to simply aim at offsetting the dilutive impacts of expected stock-based compensation.\n\nTo see what this growing stock-based compensation looks like, consider Alphabet and Facebook's stock-based compensation in the third quarter of 2016 compared to the third quarter of 2015.\n\nCompany Q3 2016 Q3 2015 YOY Change Alphabet $1.86 billion $1.4 billion 33% Facebook $2.91 billion $2.86 billion 5%\n\nA precedent for other tech companies\n\nAs one of the biggest tech companies in the world, Alphabet, with the change to its non-GAAP reporting, highlights how regular stock-based compensation has become in Silicon Valley, and it sets a new precedent for other companies to make a similar change.\n\nFacebook could very well be one of the next big tech giants to make a similar move. And if it's not planning on making the same change soon, it should. The social network appears to be on the same page as Alphabet when it comes to expecting significant stock-based compensation in the years ahead. Facebook CFO David Wehner said in the company's third-quarter conference call that he \"anticipates 2017 will be an aggressive investment year.\"\n\nWehner explained: \"Adding top engineering talent remains one of our key investment priorities as we continue to execute on our three-, five- and 10-year roadmap. We will continue to invest in our ability to recruit top technology talent both in the Bay Area and beyond.\"\n\nAlmost certainly not a coincidence, Facebook announced a $6 billion repurchase program -- an authorization about equal to what the company will probably spend on share-based compensation in 2017 -- shortly after it said Bay Area hiring would drive an aggressive investment year for the company.\n\nThe bottom line? Bay Area share-based compensation expenses are growing in tandem with tech company revenues, and it's time for companies to stop excluding stock-based compensation from non-GAAP results -- starting with Alphabet, and maybe Facebook soon after.", "sentiment_subjectivity" : 0.3753018720410025, "date" : [ "Jan 31, 2017" ] }
{ "_id" : { "$oid" : "58c78e621d41c8139af69312" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/01/30/8-must-see-facts-highlight-alphabet-incs-2016.aspx&cid=52779367475785&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGnPCTrLeCgQAH9NZMMj9pNJDLk-g" ], "sentiment_polarity" : 0.1405381306324702, "headline" : [ "8 Must-See Facts Highlight Alphabet Inc.'s 2016" ], "article_text" : "\"2016 was simply a great year for us,\" said Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) CFO Ruth Porat during the company's fourth-quarter earnings call. And it would be tough to argue with her. In 2016, Google parent Alphabet's revenue and profits increased, its core advertising business, non-advertising initiatives gained significant traction, and it wrapped up the year with two very successful Google-branded hardware launches. Here are eight facts to help capture Alphabet's business in 2016.\n\nTotal revenue increased 20% -- a notable acceleration from 14% year-over-year growth in 2015. And growth even picked up throughout 2016, with the company reporting 22% year-over-year growth in its fourth quarter, or 24% on a constant currency basis.\n\nAlphabet cited mobile search, YouTube, and programmatic advertising as key revenue drivers during the year.\n\nOther bets revenue soared 82%, driven primarily by its smart home Nest products, Google Fiber internet, and Google's life science organization, Verily.\n\nStill, other bets remain unprofitable. Indeed, the segment, which only represents about 1% of Alphabet's total revenue, lost $2.9 billion in 2016 when excluding stock-based compensation -- and this loss was on just $809 million in revenue. Including stock-based compensation, other bets operating loss was a whopping $3.6 billion.\n\nAlphabet spent $3.7 billion repurchasing its own shares. As part of Alphabet's $7 billion repurchase program, the company's share repurchases in 2016 climbed higher. But investors shouldn't expect the share repurchase program to meaningfully reduce the company's shares outstanding, as Alphabet's stock-based award activities are almost just as aggressive. In 2016, Alphabet paid $3.3 billion in stock-based compensation.\n\nOther revenue increased 41%. Not to be confused with Alphabet's much smaller other bets segment, the company's other revenue, which is made up of non-advertising Google products, was driven primarily by Alphabet's Google Play app store, hardware sales, and cloud businesses.\n\nAlphabet introduced Waymo. Buried in Alphabet's other bets business, Alphabet's self-driving car technology development became a stand-alone business called Waymo.\n\n\"Waymo may be a new company, but we're building on advanced self-driving technology developed over many years at Google,\" said Waymo chief executive John Krafcik in a December blog post. Alphabet intends for Waymo to commercialize self-driving vehicle hardware and software, aiming to dramatically improve road safety.\n\nIn October, Alphabet launched a smart speaker and a smartphone. The company's voice-activated Google Home speaker and its new Google Pixel phone were clear successes this holiday season. While the company doesn't provide specific sales figures on the device, management did say it was \"thrilled with the reception\" for these devices, and that their success looks promising.\n\nAlphabet made significant progress in its cloud business. Management said in the company's fourth-quarter earnings call that its cloud business is on a \"terrific upswing.\" With the help of Alphabet's well-timed $625 million acquisition of API provider Apigee, Alphabet made particular progress differentiating its Google Cloud Platform (GCP) by sharpening its offerings in data analytics, machine learning, security, and tools for application development. Further, in 2016, Alphabet's Google Cloud's G Suite product, which offers cloud-based collaboration and productivity applications, garnered more than three million paying customers by the end of the year.\n\nGoing into 2017, Alphabet will be up against a strong benchmark: itself. With a tough year-over-year comparison of 20% revenue growth in 2016, the company will need to continue executing well across Google advertising and YouTube, as well as its smaller businesses like hardware and cloud. Further, while Alphabet's other bets are still too small to help overall revenue growth in 2017, investors should continue to look for promising signs from the segment this year.", "sentiment_subjectivity" : 0.5272604753736828, "date" : [ "Jan 30, 2017" ] }
{ "_id" : { "$oid" : "58c78e631d41c8139af69313" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.fool.com/investing/2017/01/10/10-reasons-to-buy-alphabet-inc-stock-and-never-sel.aspx&cid=52779338297473&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFoKSu0D5554YhPrDKrHwpyHKsAoA" ], "sentiment_polarity" : 0.1461251692179527, "headline" : [ "10 Reasons to Buy Alphabet Inc Stock and Never Sell" ], "article_text" : "Saying that you're going to buy a stock and never sell it seems a bit audacious. And in truth, it is: The future is simply unknowable. But I've owned shares of Alphabet (NASDAQ:GOOGL)(NASDAQ:GOOG) -- formerly known as Google -- for almost a decade, and I can't fathom a circumstance under which I'd consider parting with my shares.\n\nCurrently, shares of the company make up a whopping 13% of my family's real-life stock holdings. But we're totally comfortable with that allocation.\n\nHere's why:\n\n1. The company's flagship product has a dominant market (and mind) share\n\nIf you're sitting around the dinner table arguing about a provable fact, you resolve the dispute by simply \"Googling\" the answer. The fact that the name is so embedded in our lexicon speaks volumes to the search engine's dominance.\n\nAccording to Statista, Alphabet's Google search owns 90.4% of the global market on desktops. And perhaps more important, according to NetMarketShare, it commands 93.8% of the mobile search market share globally.\n\n2. It boasts six other products with over 1 billion users\n\nBut as you're probably well aware, Google is much more than just search. It has six other applications with over 1 billion users. These include Gmail, YouTube, Google Maps, Chrome, Android, and Google Play Store.\n\n3. That all adds up to a lot of data\n\n\"Sure,\" you might say, \"but the company doesn't charge for most of those products. That's not great business.\"\n\nWhile you'd be right, you'd be missing out on what's dubbed the \"oil of the information age\": data. With every user in all seven of those aforementioned apps, the company is able to collect gobs of data. In fact, I don't think it would be too hard to argue that Google has more data on the people walking this earth than any other organization, at any other time in human history.\n\n4. At its heart, it is still an advertising company\n\nThat data is worth billions to advertisers. In the old days, companies would try to target their audience by putting ads in magazines or newspapers where potential customers might be lurking. But the feedback loop wasn't great: Advertisers never knew just how effective that ad spending was.\n\nNot so anymore. With Google's advertising platform, companies get real-time feedback on how efficiently their ads are being placed, and how much business they produce. Given the data hoard that the company has, ads placed through Google can be more targeted to the perfect customer than any other available source. That's a huge moat for the company.\n\nIt also helps explain why Google advertising brought in $67 billion in sales last year for the company, or 90% of all revenue.\n\n5. Digital ads are poised to grow\n\nIf you think you've missed the boat, rest assured you haven't. A March 2016 report from eMarketer shows that there's still a lot of room for internet advertising to grow.\n\nAnd with TV still retaining one-third of the global market share in 2019, I can only imagine that the runway for internet ad growth will continue for much of the next decade.\n\n6. The company is more than a one-trick pony\n\nBack to that name change, from \"Google\" to \"Alphabet.\" You might better understand the reasoning if you look at the new corporate name as \"Alpha-Bet.\" This rendering of the name reflects the company's practice of taking a lot of moonshot bets on revolutionary technologies outside its main search and data-capturing business.\n\nThis is what famed trader, academic, and thinker Nassim Taleb would call a barbell approach: having a large a reliable stream of revenue on one side while taking lots of small bets on the other. While the likelihood of any one moonshot succeeding is small, all it will take is one or two winners over the next decade to make a meaningful difference for shareholders.\n\nWhat are these moonshots? We probably don't know all of them, but the ones we do include self-driving cars, a connected home, a life sciences company, and lightning-fast internet connection.\n\n7. Its mission statement is memorable\n\nI'm a sucker for a good mission statement. When it is clear and powerful, it can be the compass that helps guide management and employees alike toward a common goal.\n\nGoogle's mission statement is: \"To organize the world's information and make it universally accessible and useful.\"\n\nThe mission of new-formed parent company Alphabet is multifaceted but can be broken down to: \"Getting more ambitious things done[,] ... empowering great entrepreneurs and companies to flourish ... [and] as a result of all this, improving the lives of as many people as we can.\"\n\nThose are both powerful and flexible enough objectives to keep the company relevant in a quickly changing world.\n\n8. It has soul in the game\n\nLest you think that you might have a few executives who are in this for short-term gain, Alphabet is still run by its co-founders, Larry Page and Sergey Brin. Together, they -- along with all of the other company executives and board members -- own almost 48 million shares of Alphabet, and account for 60% of the company's voting power. To put the number of shares in perspective, it is equivalent to almost $40 billion at today's prices.\n\n9. The proof is in the culture\n\nAnother metric that's often overlooked is a company's culture. If Page and Brin really do want to accomplish the ambitious goals they've laid out, they need a stable and motivated workforce to get things done.\n\nTo get an idea for the company's approach, a 2010 filing with the SEC stated that \"[monetary] incentives are secondary to career growth, work environment, and engaging work opportunities. We seek to develop a highly motivated and collaborative workforce that pursues achievements for the sake of progress and innovation before individual gain.\"\n\nBased on employee reviews on Glassdoor.com, I'd say the company is doing pretty well.\n\n10. There is lots of cash to make it work\n\nFinally, if you've got a company that's going to be taking lots of small bets that can be costly, it's good to know that management is sitting on a pretty expansive war chest. And that's what you get with Alphabet.\n\nLong-term debt: $3.9 billion\n\nCash, short-, and long-term investments: $88.8 billion\n\nThis, and the other nine reasons above, helps me sleep well at night knowing my family is invested in -- and likely won't sell for a long time -- such a company.", "sentiment_subjectivity" : 0.4587721099061304, "date" : [ "Jan 10, 2017" ] }
{ "_id" : { "$oid" : "58c78e641d41c8139af69314" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/alphabet-inc-googl-q4-earnings-preview-pixel-home-could-fuel-growth-cm737699&cid=52779357545201&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNELn0CaRcNjpUhsy9AnGMTQ59RbEA" ], "sentiment_polarity" : 0.1941919191919192, "headline" : [ "Alphabet Inc. (GOOGL) Q4 Earnings Preview: Pixel & Home Could Fuel Growth" ], "article_text" : "As per usual, all eyes will be on the company formerly known as Google, Alphabet Inc. GOOGL , as the tech giant prepares to release its fourth-quarter earnings report on Thursday. The company rolled out its new Google Pixel phone and ushered in a new era of hardware-software interaction during the quarter, making this week's announcement even more important than usual.\n\nIn fact, the Google Pixel will most likely be the most compelling aspect of Alphabet's latest report, and investors will be clamoring to know how the device sold. It will also be interesting to see what the company says about its Google Home Controller, which also launched in the U.S. this quarter.\n\nThe Google Pixel is important because it is Alphabet's first high-end smartphone entirely produced in-house and represents a significant challenge to Apple's AAPL iPhone line. The Google Home tells another story of competition; the \"Internet of Things\" in-home hub is one of the only competitors to Amazon's AMZN Echo speaker.\n\nMore importantly, both of these products underscore Alphabet's efforts to usher in its intelligent personal assistant software, Google Assistant. With similar functions to Apple's Siri and Microsoft's MSFT Cortana, Google Assistant is the backbone of the Pixel and Home devices and promises to be the foundation for all of Google's original products heading forward.\n\nAlso, investors should not forget about the other products that Google launched in the quarter, all of which were officially unveiled at the same event in October. The company debuted its stylish headset for the Daydream VR platform, the \"Daydream View,\" as well as its first router, \"Google Wifi,\" and a Chromecast update, \"Chromecast Ultra.\"\n\nAll of these products are important pieces of Google's effort to create a complete line of products that work together and with the new Google Assistant software. This is just the first quarter of sales, but it is also the holiday quarter and should give us a good idea of whether or not these products are resonating with shoppers.\n\nHeading into the report, Alphabet Inc. has seen one positive estimate revision over the past week. Our current consensus estimates indicate EPS growth of 8.40% and sales growth of 18.75%, and this has helped earn the company an \"A\" grade for growth. This is especially noteworthy given the relative size and status of Alphabet already. Overall, the stock has a Zacks Rank #2 (Buy), and that's always a good sign heading into an earnings announcement.\n\nNevertheless, Alphabet currently has an Earnings ESP of -0.26%, which makes surprise prediction a bit more difficult.\n\nZacks' Top 10 Stocks for 2017\n\nIn addition to the stocks discussed above, would you like to know about our 10 finest tickers for the entirety of 2017?\n\nWho wouldn't? These 10 are painstakingly hand-picked from 4,400 companies covered by the Zacks Rank. They are our primary picks to buy and hold. Be among the very first to see them >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "sentiment_subjectivity" : 0.5600448933782266, "date" : [ "Jan 24, 2017" ] }
{ "_id" : { "$oid" : "58c78e661d41c8139af69315" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.wsj.com/articles/alphabet-inc-s-self-driving-car-unit-creates-its-own-sensor-package-1483912457&cid=52779338991993&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFpBCaIVmMJQCidQ0sz5JJzqZq3YA" ], "sentiment_polarity" : 0.2833333333333333, "headline" : [ "Alphabet Inc.'s Self-Driving Car Unit Creates Its Own Sensor Package" ], "article_text" : "Waymo, the self-driving-car unit of Google parent Alphabet, unveiled its own sensor package at the Detroit auto show on Sunday for the hybrid minivans it has developed with Fiat Chrysler. Photo: Waymo\n\nDETROIT—Waymo LLC, the self-driving-car unit of Alphabet Inc., has created its own sensor package, suggesting the technology company sees itself supplying both the software and hardware required for autonomous vehicles.\n\nThe announcement on Sunday at the start of the North American International Auto Show here gives the clearest window yet into how Waymo might put its self-driving-car project into auto makers’ fleets. Bundling the hardware with the software required for self-driving technology would create an all-in-one...", "sentiment_subjectivity" : 0.5, "date" : [ "Jan 8, 2017" ] }
{ "_id" : { "$oid" : "58c78e681d41c8139af69316" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.insiderfinancial.com/3-ways-trump-immigration-order-is-affecting-alphabet-inc-nasdaqgoogl-and-others/119343/&cid=52779364966999&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHJwQLy6CchNc3glZ4P0O408Z0c9A" ], "sentiment_polarity" : 0.076486260914227, "headline" : [ "3 Ways Trump Immigration Order Is Affecting Alphabet Inc (NASDAQ:GOOGL) And Others" ], "article_text" : "Trump’s immigration ban did not receive positive response from Alphabet Inc (NASDAQ:GOOGL)’s Google CEO Sundar Pichai. He criticized the order by Trump which could affect about 187 Google employees. In an email addressed to his staff on Friday, Pichai said, “We’re upset about the impact of this order and any proposals that could impose restrictions on Googlers and their families, or that could create barriers to bringing great talent to the US.” Keep yourself updated with latest stock alerts.\n\nMany employees come from Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen- seven Muslim majority countries that have been banned from immigration for the next 90 days. “It’s painful to see the personal cost of this executive order on our colleagues,” said Pichai in the email. The order is not only restricted to nationals from these countries but also on Syrian refugees. Even though the administration calls it a move to keep the ‘radical Islamic terrorists’ out of the U.S., the human rights activities claim that it is a case of sheer religious bigotry. Investors should use stock alerts in times like this to keep themselves abreast of latest happenings..\n\nHere are 3 ways in which immigration order will affect Google and other.\n\nThe order may grow to cover other countries\n\nThe impact of the order by Trump is still small because the number of migrants from these 7 countries is very less. Over 500,000 permanent residents of the US come from Iraq and Iran alone, making up most immigrants from the 7 banned nations. However, this does not mean that the order will not grow to cover other nationalities.\n\nThe Secretary of Homeland Security is expected to submit a list of nationalities that could be further prohibited from entry to the United States. Google, Facebook, and others have migrant workers from many nationalities working in the U.S. in their offices. If the ban extends to more countries, these corporations may be in a human resource crisis as their executives may land in trouble, just like the company stocks. Getting regular stock alerts can be a savior in this case.\n\nHiring Costs may rise\n\nAs much as the old and valuable employees of the companies will be affected, Google will also have a few problems related to hiring in US alone. While the hiring costs may rise, these companies must spend fresh dollars into training the employees and getting everything back in order.\n\nThough 187 is not a big number for a corporate like Alphabet Inc (NASDAQ:GOOGL), if the ban grows out to other nations, especially to the South Asian and Asian countries, the corporate could be in trouble because they hire a significant number of employees from this region. It would be wise to check the stock alerts in the future to find the fate of the companies.\n\nFurther extensions to the order may mean issues for the companies at the stock market. These blue-chip stocks may land in troubled water. Getting regular stock alerts can help in keeping your investment safe.\n\nFate of U.S. companies in other nations\n\nIran has responded strongly to the ban claiming that it would stop US citizens from entering their country. The foreign ministry of Iran also issues a statement, in which they said that the ban is not about keeping Americans safe but a gift to the extremists. If the ban extends to other nations, the fate of corporate like Alphabet Inc (NASDAQ:GOOGL) and Facebook Inc (NASDAQ:FB) could be threatened overseas as these companies’ operations will be at stake in their international offices. Get stock alerts to check the progress.\n\nBefore Pichai, Facebook Inc (NASDAQ:FB) co-founder and CEO Mark Zuckerberg also criticized the order and said that he was ‘concerned by the order” in a Facebook post. He also said, “We need to keep this country safe, but we should do that by focusing on people who actually pose a threat.” It is also to be noted that Pichai himself is an Indian and the country supplies a huge workforce to the company in US and overseas. Get stock alerts for Facebook, Google, Microsoft, and other stocks.\n\nDisclosure: We have no position in GOOGL, FB or MSFT and have not been compensated for this article.", "sentiment_subjectivity" : 0.4015983169372999, "date" : [ "Jan 31, 2017" ] }
{ "_id" : { "$oid" : "58c78e691d41c8139af69317" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/alphabet-inc-earnings-rise-9-in-q4-20170126-01657&cid=52779360457402&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHp0cK0Jdq7RJGxxodwTGJYZRwneg" ], "sentiment_polarity" : 0.08388278388278389, "headline" : [ "Alphabet Inc. Earnings Rise 9% In Q4" ], "article_text" : "Shutterstock photo\n\n\n\n\n\n(RTTNews.com) - Alphabet Inc. ( GOOGL ) revealed a profit for its fourth quarter that climbed from last year.\n\nThe company said its bottom line advanced to $6.59 billion, or $9.36 per share. This was up from $6.04 billion, or $8.67 per share, in last year's fourth quarter.\n\nAnalysts had expected the company to earn $9.64 per share, according figures compiled by Thomson Reuters. Analysts' estimates typically exclude special items.\n\nThe company said revenue for the quarter rose 22.2% to $26.06 billion. This was up from $21.33 billion last year.\n\nAlphabet Inc. earnings at a glance:\n\n-Earnings (Q4): $6.59 Bln. vs. $6.04 Bln. last year. -Earnings Growth (Y-o-Y): 9.1% -EPS (Q4): $9.36 vs. $8.67 last year. -EPS Growth (Y-o-Y): 8.0% -Analysts Estimate: $9.64 -Revenue (Q4): $26.06 Bln vs. $21.33 Bln last year. -Revenue Change (Y-o-Y): 22.2%\n\nFor comments and feedback: contact editorial@rttnews.com\n\nhttp://www.rttnews.com\n\nThis article appears in: Earnings", "sentiment_subjectivity" : 0.2631868131868133, "date" : [ "Jan 26, 2017" ] }
{ "_id" : { "$oid" : "58c78e6a1d41c8139af69318" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://investorplace.com/2017/01/alphabet-inc-goog-stock-googl-moonshot/&cid=52779347541827&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGke_RCs15OMkbpXCFbunpeNUW2MA" ], "sentiment_polarity" : 0.1073051948051948, "headline" : [ "Alphabet Inc (GOOG) Stock Is No Moonshot" ], "article_text" : "Alphabet Inc (NASDAQ:GOOG, NASDAQ:GOOGL) is the parent company of Google, the undisputed leader of online search and digital advertising. Its dominance hasn’t gone unnoticed by investors, who have bid the shares up towards their all-time highs.\n\nYet Google is no moonshot, which is the term it has used to describe the venture capital activities in its “Other Bets” segment. This includes self-driving cars and its Nest franchise, which actually has some sales and helps consumers more efficiently heat and cool their homes.\n\nThe question for investors going forward is if Alphabet can continue to dominate online advertising. It and Facebook Inc (NASDAQ:FB) controlled 50% of the $60 billion online ad market in 2015. Google controlled half of the market, or $30 billion. Facebook’s take was $8 billion, but is also growing rapidly.\n\nGOOG Stock Isn’t Stopping\n\nAlphabet’s sales growth has been meteoric. It is projected to report sales of nearly $90 billion for all of 2016 (the final year results have yet to be fully reported) and that should jump to above $100 billion this year (calendar 2017). That will mark a roughly 10-fold increase from the $10.6 billion it reported in 2006.\n\nExtrapolating those figures out another decade, Alphabet stands a chance at generating over $1 trillion in revenue. That is certainly a tall order, but the network effect (where a product or service grows more valuable as more people use it) is proving to be one of the greatest growth drivers capitalism has ever seen.\n\nOf course, there is a downside to such dominance. The European Union has been attacking Google, alleging it is abusing its dominant position to block out competition and keep internet surfers dependent on its services. Specifically, it has suggested that Google pushes hard to make its search engine the default on smart phones and computers. It’s not always easy being on top.\n\nThe worries over Google’s dominance echo the control Microsoft Corporation (NASDAQ:MSFT) held over personal computers back in the 1990s. In similar fashion, the U.S. Justice Department accused Microsoft of using its personal computing software dominance to push its Internet Explorer internet browser, which helped end the Netscape browser era that helped pioneer online search and browsing the world wide web.\n\nGoogle’s dominance won’t last forever, but there is little reason to see it going away any time soon. In the next two years, analysts see earnings growing at a mid-teens percentage rate to above $41 per share for all of this year. It is a huge beneficiary of the growth in everything digital as consumers increasingly shop and socialize online.\n\nNext Page", "sentiment_subjectivity" : 0.3893217893217894, "date" : [ "Jan 17, 2017" ] }
{ "_id" : { "$oid" : "58c78e6b1d41c8139af69319" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://investorplace.com/2017/01/goog-googl-stock-alphabet-google-travel/&cid=52779332920257&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFsaGbydjtzyv7RILT2RGbliFMAcg" ], "sentiment_polarity" : 0.05136054421768707, "headline" : [ "The Key to Alphabet Inc (GOOGL) Stock Isn't What You Think" ], "article_text" : "It wasn’t a good year for Alphabet Inc (NASDAQ: GOOG , NASDAQ: GOOGL ) in 2016. Sure, it generated $17.1 billion in operating income through the first nine months of its current fiscal year on $64.2 billion in revenue, but at the end of the day GOOGL stock only managed a total return for shareholders of 1.9%.\n\nThat’s on par with its internet content peers, but way off the 12% delivered by the S&P 500. Not good by Google standards.\n\nHolding GOOGL stock back — a bit of a misnomer considering that it has nearly doubled the return of the S&P 500 over the past five years — is a valuation that InvestorPlace contributor Dana Blankenhorn feels is “priced to near-perfection” with a price-earnings ratio of 29 based on a consensus per-share earnings estimate of $26.90 in 2016, $32.25 in 2017 and $36.99 in 2018.\n\nSo, analysts expect Alphabet to grow earnings by 17.3% annually over the next two years — that’s a two-year PEG ratio of 1.7. By comparison, Facebook Inc (NASDAQ: FB ) has a two-year PEG ratio of 1.6 based on annual EPS growth of 29%.\n\nFrom this perspective, GOOGL stock doesn’t look too bad; you have to conclude that either FB is overvalued at this point or GOOGL isn’t quite as expensive as people think.\n\nEspecially when you consider that there’s still gas in Alphabet’s tank.\n\nGoogle Travel Is Fueling GOOGL\n\nLeading the charge is its travel business which has quietly become a key element in Alphabet’s success. As the travel vertical prospers, so too does Google and its parent.\n\nAccording to Dennis Schaal of Skift, Google’s travel business will generate an estimated $12.2 billion in advertising revenue in 2016, accounting for 13.7% of Alphabet’s projected 2016 revenue of $89.3 billion. Put another way, Google’s travel business will generate approximately 1,670% [calculation: $12.2/4 multiplied by 3 divided by Other Bets Q1-Q32016 revenue of $547 million] more revenue in 2016 than its Other Bets segment, which includes much of the innovative work being done by the company, including Nest, Fiber, etc.\n\nOn its own, Google Travel would be a pretty large company with operating profits of $3.8 billion. While advertising might be boring, one can’t underestimate the importance of this vertical to the company’s profitable growth.\n\nAnd you can forget about Google becoming an online travel agency with this much money on the line. It’s not going to cut off its nose to spite the face. It’s just not.\n\n“Google’s existing revenue from travel advertisers is already considerably larger than that of the Priceline Group Inc (NASDAQ: PCLN ); is roughly twice the size of Expedia Inc’s (NASDAQ: EXPE ), and Google generates more travel advertising revenue than that of Expedia, Ctrip (NASDAQ: CTRP ) and TripAdvisor Inc (NASDAQ: TRIP ) combined,” wrote Schaal in his November 2016 article on the subject. “Google undoubtedly takes that travel-advertising revenue and achieves a much higher profit margin on it than do the roster of its online travel, airline, hotel, car rental and cruise partners.”\n\nNext Page", "sentiment_subjectivity" : 0.5338321995464852, "date" : [ "Jan 6, 2017" ] }
{ "_id" : { "$oid" : "58c78e6c1d41c8139af6931a" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/ct-financial-advisors-llc-buys-alphabet-inc-alphabet-inc-united-therapeutics-corp-sells-cm733318&cid=52779344903336&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHLdygrbOt53fS1ben1tlxVtw_X9w" ], "sentiment_polarity" : -0.06120507399577168, "headline" : [ "CT Financial Advisors LLC Buys Alphabet Inc, Alphabet Inc, United Therapeutics ..." ], "article_text" : "New Purchases: GOOG , GOOGL , Q , VSM, CB, TECK, LGF.B, LMCK, PHO, LPT,\n\nAdded Positions:AGG, UTHR, GVI, ACAD, CELG, BSV, VFH, VT, VSS, FB,\n\nReduced Positions:MCD, LQD, O, PAAS, NEE, NVS, VWO, VB, VDE, GLD,\n\nSold Out:STRZA, UA, TVC, TLN, VRX, EBND, USG, EIDO, EWK, EWN,\n\nFor the details of CT Financial Advisors LLC's stock buys and sells, go to http://www.gurufocus.com/StockBuy.php?GuruName=CT+Financial+Advisors+LLC\n\n3M Co ( MMM ) - 38,228 shares, 5.94% of the total portfolio. Shares added by 0.01% iShares Core U.S. Aggregate Bond ( AGG ) - 39,458 shares, 3.71% of the total portfolio. Shares added by 18.15% SPDR S&P 500 ( SPY ) - 16,274 shares, 3.17% of the total portfolio. Shares reduced by 0.48% Vanguard FTSE All World Ex US ( VEU ) - 73,027 shares, 2.81% of the total portfolio. Shares added by 0.92% Vanguard Short-Term Bond ( BSV ) - 39,856 shares, 2.76% of the total portfolio. Shares added by 2.44%\n\nCT Financial Advisors LLC initiated holdings in Alphabet Inc. The purchase prices were between $736.08 and $813.11, with an estimated average price of $779.09. The stock is now traded at around $803.69. The impact to the portfolio due to this purchase was 0.59%. The holdings were 881 shares as of 2016-12-31.\n\nCT Financial Advisors LLC initiated holdings in Alphabet Inc. The purchase prices were between $753.22 and $835.74, with an estimated average price of $799.67. The stock is now traded at around $826.44. The impact to the portfolio due to this purchase was 0.33%. The holdings were 474 shares as of 2016-12-31.\n\nCT Financial Advisors LLC initiated holdings in Quintiles IMS Holdings Inc. The purchase prices were between $71.66 and $80.93, with an estimated average price of $76.68. The stock is now traded at around $77.36. The impact to the portfolio due to this purchase was 0.1%. The holdings were 1,486 shares as of 2016-12-31.\n\nCT Financial Advisors LLC initiated holdings in Versum Materials Inc. The purchase prices were between $22.46 and $28.72, with an estimated average price of $24.89. The stock is now traded at around $27.45. The impact to the portfolio due to this purchase was 0.06%. The holdings were 2,450 shares as of 2016-12-31.\n\nCT Financial Advisors LLC initiated holdings in Teck Resources Ltd. The purchase prices were between $17.11 and $25.88, with an estimated average price of $21.57. The stock is now traded at around $24.06. The impact to the portfolio due to this purchase was 0.04%. The holdings were 2,225 shares as of 2016-12-31.\n\nCT Financial Advisors LLC initiated holdings in Chubb Ltd. The purchase prices were between $121.88 and $133.32, with an estimated average price of $127.51. The stock is now traded at around $129.22. The impact to the portfolio due to this purchase was 0.04%. The holdings were 326 shares as of 2016-12-31.\n\nCT Financial Advisors LLC added to the holdings in United Therapeutics Corp by 142.00%. The purchase prices were between $111.68 and $145.38, with an estimated average price of $127.68. The stock is now traded at around $145.56. The impact to the portfolio due to this purchase was 0.3%. The holdings were 4,056 shares as of 2016-12-31.\n\nCT Financial Advisors LLC added to the holdings in ACADIA Pharmaceuticals Inc by 55.40%. The purchase prices were between $20.87 and $30.71, with an estimated average price of $26.46. The stock is now traded at around $31.65. The impact to the portfolio due to this purchase was 0.12%. The holdings were 13,451 shares as of 2016-12-31.\n\nCT Financial Advisors LLC added to the holdings in Celgene Corp by 60.75%. The purchase prices were between $97.63 and $124.16, with an estimated average price of $111.36. The stock is now traded at around $117.56. The impact to the portfolio due to this purchase was 0.12%. The holdings were 3,215 shares as of 2016-12-31.\n\nCT Financial Advisors LLC added to the holdings in Vanguard Financials ETF - DNQ by 134.00%. The purchase prices were between $49.12 and $60.49, with an estimated average price of $53.48. The stock is now traded at around $59.52. The impact to the portfolio due to this purchase was 0.07%. The holdings were 2,450 shares as of 2016-12-31.\n\nCT Financial Advisors LLC added to the holdings in Vanguard Total World Stock Index by 31.67%. The purchase prices were between $58.41 and $62.34, with an estimated average price of $60.2. The stock is now traded at around $62.37. The impact to the portfolio due to this purchase was 0.07%. The holdings were 5,854 shares as of 2016-12-31.\n\nCT Financial Advisors LLC added to the holdings in Facebook Inc by 150.26%. The purchase prices were between $115.05 and $133.28, with an estimated average price of $122.81. The stock is now traded at around $126.26. The impact to the portfolio due to this purchase was 0.06%. The holdings were 971 shares as of 2016-12-31.\n\nCT Financial Advisors LLC sold out the holdings in Starz. The sale prices were between $30.45 and $35.52, with an estimated average price of $32.47.\n\nCT Financial Advisors LLC sold out the holdings in Under Armour Inc. The sale prices were between $29.05 and $38.82, with an estimated average price of $32.82.\n\nCT Financial Advisors LLC sold out the holdings in SPDR Bloomberg Barclays Emerging Markets Local Bon. The sale prices were between $25.78 and $28.42, with an estimated average price of $27.18.\n\nCT Financial Advisors LLC sold out the holdings in Valeant Pharmaceuticals International Inc. The sale prices were between $13.6 and $24.59, with an estimated average price of $18.34.\n\nCT Financial Advisors LLC sold out the holdings in Talen Energy Corp. The sale prices were between $13.81 and $14, with an estimated average price of $13.92.\n\nCT Financial Advisors LLC sold out the holdings in Tennessee Valley Authority. The sale prices were between $24.76 and $26.21, with an estimated average price of $25.47.\n\nCT Financial Advisors LLC reduced to the holdings in McDonald's Corp by 86.86%. The sale prices were between $110.57 and $123.72, with an estimated average price of $117.26. The stock is now traded at around $121.82. The impact to the portfolio due to this sale was -1.78%. CT Financial Advisors LLC still held 2,672 shares as of 2016-12-31.\n\nCT Financial Advisors LLC reduced to the holdings in Pan American Silver Corp by 53.11%. The sale prices were between $14.14 and $18.04, with an estimated average price of $16.12. The stock is now traded at around $17.23. The impact to the portfolio due to this sale was -0.16%. CT Financial Advisors LLC still held 9,439 shares as of 2016-12-31.\n\nCT Financial Advisors LLC reduced to the holdings in Northrop Grumman Corp by 33.49%. The sale prices were between $212.48 and $251.8, with an estimated average price of $232.5. The stock is now traded at around $228.96. The impact to the portfolio due to this sale was -0.04%. CT Financial Advisors LLC still held 417 shares as of 2016-12-31.\n\nCT Financial Advisors LLC reduced to the holdings in iShares FTSE EPRA/NAREIT Global Real Estate ex-U.S by 82.12%. The sale prices were between $26.7 and $30.07, with an estimated average price of $28.02. The stock is now traded at around $26.78. The impact to the portfolio due to this sale was -0.03%. CT Financial Advisors LLC still held 305 shares as of 2016-12-31.\n\nCT Financial Advisors LLC reduced to the holdings in Halliburton Co by 30.29%. The sale prices were between $44.59 and $55.07, with an estimated average price of $49.86. The stock is now traded at around $55.24. The impact to the portfolio due to this sale was -0.03%. CT Financial Advisors LLC still held 1,655 shares as of 2016-12-31.\n\nCT Financial Advisors LLC reduced to the holdings in Taiwan Semiconductor Manufacturing Co Ltd by 66.67%. The sale prices were between $28.55 and $31.55, with an estimated average price of $30.1. The stock is now traded at around $29.27. The impact to the portfolio due to this sale was -0.03%. CT Financial Advisors LLC still held 500 shares as of 2016-12-31.\n\nThis article first appeared on GuruFocus .", "sentiment_subjectivity" : 0.255091613812544, "date" : [ "Jan 12, 2017" ] }
{ "_id" : { "$oid" : "58c78e6d1d41c8139af6931b" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.valuewalk.com/2017/01/alphabet-stock-price-targets-boosted-analysts-defend-earnings/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEESWNKtGkCYitEsfxA_pW7HoVP_Q" ], "sentiment_polarity" : 0.1011749482401656, "headline" : [ "Alphabet Inc Stock Price Targets Boosted As Analysts Defend Earnings" ], "article_text" : "Analysts from multiple firms raised their price targets for Alphabet stock following last night’s earnings report, causing the stock to rally after investors pushed shares lower right after the print. It seems they’re trying to do damage control after widespread headlines that the company had missed estimates for the bottom line. A change in the company’s accounting procedures apparently is causing some confusion.\n\nAlphabet stock to $1,000: Morgan Stanley\n\nMorgan Stanley analyst Brian Nowak raised his target for Alphabet stock to a nice round $1,000 per share. The Google parent company reported adjusted earnings of $9.36 per share, compared to the consensus of $9.64 per share. However, after making further adjustments, Nowak says that the company would have reported $10.05 per share, excluding equipment charges, a one-time tax headwind, and other one-time charges.\n\nHe notes that the amounts of some of these one-time charges are unclear and that it’s not uncommon for Alphabet to income such charges below the line. However, he said based on fundamentals, the result was still better than expected.\n\nAnother key bullish point was that Websites revenue increased 23%, which was more than expected, and adjusted EBIT beat Nowak’s estimate by 9%, excluding some of the other charges he added in. He also spoke to the suggestion that the company’s core margin pressure was worsening, but he doesn’t think this is necessarily the case, even with the introduction of the Pixel phones. Again, this goes back to the one-time charges he includes that Alphabet didn’t.\n\nDeutsche Bank analysts peg Alphabet’s adjusted earnings higher than Nowak, at $10.30 per share after making their own adjustments and factoring in the 4.2% higher tax rate.\n\nAlphabet stock target to $1,050: Stifel\n\nDeutsche Bank analysts peg Alphabet’s adjusted earnings higher than Nowak, at $10.30 per share after making their own adjustments and factoring in the 4.2% higher tax rate.\n\nStifel analyst Scott Devitt boosted his price target for Alphabet stock from $950 to $1,050 per share after last night’s print. He continued the Wall Street narrative that the company actually beat consensus for non-GAAP earnings based on one-time adjustments. He merely described it as “comfortably above the Street if Alphabet has excluded the previously mentioned $320mm in one-time costs.”\n\nAmong the other analysts who boosted their price targets for Alphabet stock is Macquarie’s Ben Schachter, who moved his target from $975 to $995 and pronounced the fourth quarter report “mostly fine, more of the same.” Also Baird analyst Colin Sebastian raised his target for Alphabet stock from $930 to $960. He’s also of the view that the company’s non-GAAP earnings were better than what the headlines suggest and noted “surprisingly strong” revenues from the “Other” segment, which points to momentum in the Cloud, contributions from Play, and early success from the Pixel line, Home hardware products and other inclusions.\n\nAlphabet’s earnings a negative sign for Facebook?\n\nBank of America Merrill Lynch analysts also agree with the view that Alphabet’s adjusted earnings should be considered a beat despite the headlines. They note that the company didn’t state what the $320 charge was for and that it said it will no longer exclude stock-based compensation from its non-GAAP earnings, which is a key change.\n\nOn a side note, they’re concerned that Alphabet’s earnings could be a bearish signal for Facebook which suggests that expectations could be too high. The reason is because Google Websites revenue didn’t match their “more bullish channel checks.”\n\nShares of Alphabet stock bounced around during regular trading hours on Friday, plunging before bouncing around midday to trade at around $851.", "sentiment_subjectivity" : 0.4399124064341455, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e6e1d41c8139af6931c" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://investorplace.com/2017/01/alphabet-inc-googl-apple-inc-aapl-yoky-matsuoka-nest/&cid=52779359067575&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNF-ahuyCjRjZn4-7d7vEndGKLFO0A" ], "sentiment_polarity" : 0.07807428021713735, "headline" : [ "Alphabet Inc (GOOGL) Steals AI Expert Back From Apple Inc. (AAPL)" ], "article_text" : "The smart home market continues to heat up, and Alphabet Inc (NASDAQ: GOOGL ) is determined to stay in the race. After releasing the Google Home AI-powered smart speaker and Google WiFi mesh router system, the company is now turning its attention to Nest.\n\nSource: Nest\n\nIn an effort to reboot its pioneering smart home products division, Alphabet has hired back Yoky Matsuoka, an AI and robotics expert who had been working for rival Apple Inc. (NASDAQ: AAPL ).\n\nThe former Nest vice president will return as the new Nest CTO.\n\nRebooting the Nest Mess\n\nNest has had a pioneering role in the smart home. Before being acquired by Google in 2014 for $3.2 billion, the company had helped kick off an entire industry with the Nest Learning Thermostat.\n\nThe smart thermostat delivered on a promise to automate home temperatures, learn homeowners’ preferences for different times of the day and to save money on heating and cooling. It did this while being user-friendly; you didn’t need to be an engineer or an electrician to install and set it up. It also introduced a chic new look to the lowly thermostat. Nest went on to branch out into smart smoke and CO detectors before being acquired by Google.\n\nThings at Nest began to go sideways under Google’s ownership. The Dropcam purchase involved drama around canceled products and employees quitting over cultural clashes.\n\nNest failed to deliver the home security system Google was anxiously awaiting — in fact, the division has failed to release any new products since being acquired (just revisions of existing gear plus those Dropcam cameras). It got mired in a PR disaster after buying the Revolv smart hub, then shutting it down, effectively bricking devices that had already been bought. The division fell short of Alphabet’s revenue targets.\n\nThe situation culminated with the departure of Nest founder and CEO Tony Fadell.\n\nNew Nest CTO Is a Familiar Face\n\nNest has been operating under a new CEO since last summer, but Alphabet is clearly trying to kick-start the division. The threat posed by Amazon.com Inc.’s (NASDAQ: AMZN ) Alexa-powered Echo smart speaker is very real. Despite being late to the game and lacking a smartphone platform, Amazon has vaulted into a smart home leadership position with Alexa able to interact with thousands of products and services.\n\nThat smart home market is projected to be worth over $121 billion by 2022, so being top dog is a very big deal.\n\nBloomberg is reporting that Alphabet has hired a key executive to take on the crucial CTO role at Nest. An AI and robotics expert, Yoky Matsuoka was a co-founder of Google’s X research division. She left Google to become a VP with Nest and is credited for the Nest Learning Thermostat’s adoptive technology.\n\nNext Page", "sentiment_subjectivity" : 0.4567901807187522, "date" : [ "Jan 24, 2017" ] }
{ "_id" : { "$oid" : "58c78e6f1d41c8139af6931d" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.reuters.com/article/idUSL4N1FG4NY&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHegsFe60ODKUjiY6zMYTPtEDSXLQ" ], "sentiment_polarity" : 0.4458333333333333, "headline" : [ "BRIEF-Alphabet Inc quarterly results press release" ], "article_text" : "COLUMN-Musk's bold offer of Tesla batteries won't solve Australia's power problems: Russell\n\nLAUNCESTON, Australia, March 14 Australia is becoming an interesting microcosm on how to, or how not to, transition an economy from being predominantly powered by coal to more climate-friendly alternatives.", "sentiment_subjectivity" : 0.6291666666666667, "date" : [ "Jan 26, 2017" ] }
{ "_id" : { "$oid" : "58c78e711d41c8139af6931e" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.smarteranalyst.com/2017/01/23/expect-ahead-alphabet-incs-fourth-quarter-earnings-top-analyst/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGiKJ-pWVIgy8FLTksmXqMHcURtNA" ], "sentiment_polarity" : 0.02236652236652236, "headline" : [ "What To Expect Ahead Of Alphabet Inc's (GOOGL) Fourth Quarter Earnings: Top ..." ], "article_text" : "RBC Capital top analyst Mark Mahaney weighed in today with his views on Alphabet Inc (NASDAQ:GOOGL), as the company is scheduled to report its fiscal fourth-quarter earnings results on Thursday, January 26th after the close.\n\nThe analyst expects gross revenue of $24.40 billion, net revenue of $19.78 billion, non-GAAP operating income of $7.66 billion, and non-GAAP EPS of $9.27. His gross and net revenue estimates are a bit below consensus (at $25.30B and $20.58B, respectively), as is his non-GAAP operating income and non-GAAP EPS estimates (at $8.25B and $9.62, respectively).\n\nMahaney noted, “Based on intra-quarter data points and our model sensitivity analysis, we believe Street estimates for Q4 are slightly aggressive on the top-line and on the bottom-line. We note that Google does hedge its FX exposure, tho the magnitude of recent currency moves has been unusual.”\n\nIn closing, Mahaney reiterates an Outperform rating on shares of Alphabet, with a price target of $1025, which represents a potential upside of 22% from where the stock is currently trading.\n\nAs usual, we like to include the analyst’s trackrecord when reporting on new analyst notes. According to TipRanks.com, which measures analysts’ and bloggers’ success rate based on how their calls perform, analyst Mark Mahaney has a yearly average return of 21.4% and a 71% success rate. Mahaney has a 15.5% average return when recommending GOOGL, and is ranked #2 out of 4361 analysts.\n\nOut of the 26 analysts polled in the past 3 months, 25 rate Alphabet stock a Buy, while only 1 rates the stock a Hold. With a return potential of 14%, the stock’s consensus target price stands at $961.61.", "sentiment_subjectivity" : 0.3462481962481962, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e721d41c8139af6931f" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://investorplace.com/2017/01/alphabet-inc-googl-stock-goog-dip/&cid=52779366923679&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHYJJFk7Mcl4S0wNnJCtrciuS0kLA" ], "sentiment_polarity" : 0.067444120505345, "headline" : [ "Buy the Dip in Alphabet Inc (GOOGL, GOOG) Stock" ], "article_text" : "Alphabet Inc (NASDAQ: GOOG , NASDAQ: GOOGL ) took its turn in the earnings limelight last week, and investors were not happy with the results. Offering up a rare miss, Alphabet said it earned $9.36 per share versus expectations of $9.63 per share, while revenue arrived at $26.06 billion compared to predictions for $25.22 billion.\n\nSource: Shutterstock\n\nGOOGL stock has since fallen more than 5%, and its edging lower once again today.\n\nBut the shares were due for a bit of a selloff, as GOOGL stock was overbought heading into earnings amid an overly enthusiastic sentiment backdrop. Contrarian investors know that this is a recipe for short-term disaster on even the slightest hiccup.\n\n\n\nClick to Enlarge Now that the knee-jerk selling has about run its course, it’s time to get back to being realistic on GOOGL stock’s prospects. Technically, Alphabet shares remain in a long-term uptrend, supported by its 10-week and 20-week moving averages.\n\nFurthermore, these trendlines completed a bullish cross earlier this month, which could bring bargain hunters to the table once the post-earnings gyrations have subsided.\n\nAs for sentiment, the fourth-quarter earnings blip for GOOGL stock hasn’t shaken the brokerage community one bit. And it shouldn’t. According to Thomson/First Call, all but two of the 48 analysts following Alphabet Inc rate the shares a “buy” or better. Additionally, the 12-month price target of $988.47 represents a modest premium of only about 19% to GOOGL’s Monday close.\n\nWith search ad revenue holding strong and Alphabet expanding its hardware program, we may even see a few upward revisions in the next month or so.\n\nOn the options front, GOOGL Feb./March put/call open interest ratio has risen slightly in the past week to rest at 0.72, with puts gaining a bit of traction in the wake of last week’s quarterly report. For the March series, traders are still eyeing the $860 and $900 strikes, while put traders are focused on $800 and $750.\n\nOverall, March implieds are pricing in a potential move of about 5% in the next two months. Currently, this places the upper bound at $865.02, while the lower bound lies at $782.64 from Monday’s close. I would be surprised to see GOOGL stock trade south of $800, as it would take some unexpectedly poor news from Alphabet or a significant turn in the overall market. A rally to $860 seems more likely, though resistance at $850 could be a stumbling block.\n\n2 Trades for GOOGL Stock\n\nPut Sell: The safest route to profit on GOOGL stock right now would be to bank on technical support and sell option premium. Right now, the March $800 put looks like a solid bet for such a play. At last check, this put was bid at $12, or $1,200 per contract.\n\nAs usual, you keep the premium as long as GOOGL stock closes above $800 when these options expire. The downside is that should Alphabet trade below $800 ahead of March expiration, you could be assigned 100 shares for each sold put at a cost of $800 per share.\n\nCall Spread: If you are more bullish on GOOGL stock’s prospects, then a March $830/$850 bull call spread has potential At last check, this spread was offered at $8, or $800 per pair of contracts.\n\nBreakeven lies at $838.00, while a maximum profit of $12, or $1,200 per pair of contracts, is possible if Alphabet closes at or above $850 when March options expire.\n\nAs of this writing, Joseph Hargett did not hold a position in any of the aforementioned securities.\n\nMore From InvestorPlace", "sentiment_subjectivity" : 0.408600583090379, "date" : [ "Jan 31, 2017" ] }
{ "_id" : { "$oid" : "58c78e741d41c8139af69320" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://marketexclusive.com/alphabet-inc-nasdaqgoogl-google-introduces-japanese-translator-thanks-iphones-camera-based-word-lens/70481/&cid=52779360362289&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFh2lvSCN--kU6qrr0sCDU0qoXjoQ" ], "sentiment_polarity" : 0.1497643097643097, "headline" : [ "Alphabet Inc (NASDAQ:GOOGL) Google Introduces Japanese Translator Thanks To ..." ], "article_text" : "Japanese is one of the hardest languages for Westerners to learn. Many claim that it is one of the hardest languages to learn period, and true to the word, even Alphabet Inc (NASDAQ:GOOGL) Google has not been able to crack it. However, the tech giant has seen some progress in cracking the tough language. It has made Japanese one of the languages that can be used in Word Lens.\n\nThe feature, which will be available in the Google Translate app will allow people to interact with an instant translator from their phones. It is particularly useful for travelers hence it will come in handy for the 20 million tourists who visit Japan annually. Apparently, it will not ask for Internet or data connectivity.\n\nOn its blog post, Google wrote, “With Word Lens now available in Japanese, you’ll never have to worry about taking a wrong turn on a busy Shibuya street or ordering something you wouldn’t normally eat.”\n\nThe Word Lens allows instant translation via the camera\n\nAll translations are performed on the mobile device and through the camera, which is able to recognize text overlaid in its live view say by another selected by the user. Initially, the app was only able to translate Japanese to English but on first taking a photograph and highlighting text areas that require translation. Thus this must be a significant milestone for Google, which is being fulfilled two years after the introduction of the feature. Notably, within the two years, it has added no less than 27 languages including Lithuanian, Finnish, and Thai.\n\nBut the feature is meant for brief phrases and words\n\nWord Lens, which was originally its own standalone app before being acquired by Google through its developer Quest Visual will not work well with long sentences or phrases. A long passage of text translation will not have accuracy. Hence the use of brief phrases and words is highly recommended. It has so far been promoted in an ad for the iPhone 5.\n\nMeanwhile, Alphabets stock closed at $856.98 or 1.47 or 0.17%.\n\nPlease enable JavaScript to view the comments powered by Disqus.", "sentiment_subjectivity" : 0.4672649572649573, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e741d41c8139af69321" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://investorplace.com/2017/01/alphabet-inc-googl-terra-bella/&cid=52779342173131&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGDTpDC9mUTiWyNcPGj7GMiLxeDkw" ], "sentiment_polarity" : 0.02224137931034483, "headline" : [ "Alphabet Inc (GOOGL) Is Dumping Its Imaging Satellite Biz" ], "article_text" : "Alphabet Inc (NASDAQ: GOOGL ) is reportedly selling its Terra Bella Imaging satellite business to Planet Labs, one of Terra Bella’s fiercest competitors. For the past year, Alphabet has outperformed the Zacks Internet-Services industry. GOOGL has returned 12.68% compared with the industry’s return of 11.89%.\n\nBloomberg reported on Monday that the sale is likely an equity transaction with Alphabet keeping a stake in Planet Labs.\n\nFormerly known as Skybox, the earth imaging company was founded in 2009 and the search giant bought it for $500 million in 2014, the same year when Skybox was named no. 1 on Inc. magazine’s 25 Most Audacious Companies.\n\nGetting Rid of Audacious Ventures\n\nThe move underscores Alphabet’s efforts to trim relatively less-revenue generating businesses and attain financial discipline.\n\nIn Aug 2015, Alphabet reportedly curbed expansion of its high-speed fiber optic Internet network, cutting 9% of its staff. In November, the company scaled back Project Wing, its experimental drone delivery program.\n\nWhat’s on Planet’s Platter?\n\nPrivately held Planet operates with dozens of small satellites that take pictures of the Earth surface frequently. However, the resolution of the images is low. Terra Bella has larger satellites with high image resolution but its fleet contains only seven satellites, which limits the frequency of capturing images.\n\nThus, we believe that through this acquisition, Planet Labs will add high resolution satellites to its fleet. Both companies share the satellite imaging space with giants like Airbus’ (OTCMKTS: EADSY ) Airbus Defence & Space and DigitalGlobe Inc (NYSE: DGI ).\n\nKey Takeaways\n\nAlphabet’s sales, marketing and R&D expenses have gone up considerably in the last five years. There are also some other margin pressures. The most significant at the moment is related to currency, which continued to impact Alphabet’s results despite the fact that it has a hedging program in place.\n\nAlphabet Inc. EPS Diluted (TTM)\n\nOther expense pressures include fast-paced international growth, a growing volume of lower-priced YouTube clicks and strength of the mobile platform. So we believe that Alphabet has foreseen an escalation of costs in the years to come and is gearing up well in advance with decisions like these.\n\nNext Page", "sentiment_subjectivity" : 0.4197126436781609, "date" : [ "Jan 11, 2017" ] }
{ "_id" : { "$oid" : "58c78e781d41c8139af69322" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://marketexclusive.com/alphabet-inc-nasdaqgoogl-risks-losing-current-future-federal-contracts-compensation-data/60273/&cid=52779333638632&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHYeBwyN5X9lIGRca7lrKnWfpPzHA" ], "sentiment_polarity" : 0.07948028673835125, "headline" : [ "Alphabet Inc (NASDAQ:GOOGL) Risks Losing Current And Future Federal Contracts ..." ], "article_text" : "Alphabet Inc (NASDAQ:GOOGL) faces the risk of losing all current and future government contracts having been sued by the department of labor as part of an anti-discrimination audit. The department in its lawsuit is seeking to compel the tech giant to hand over compensation data as part of a compliance evaluation.\n\nGoogle’s Privacy Concerns\n\nIn the lawsuit, the Department accuses the search giant of failing to hand over requested data and documents pertaining to compensation as requested by the office of Federal Contract Compliance Programs. The agency had sought data regarding the company’s equal opportunity program as early as September 2015.\n\n“Despite many opportunities to produce this information voluntarily, Google has refused to do so. We filed this lawsuit so we can obtain the information we need to complete our evaluation,” said OFCCP Acting Director Thomas M. Dowd.\n\nGoogle in its defense insists it has turned down over hundreds of thousands of documents to the department as part of its commitment to people’s privacy. The tech giant goes on to claim that handing over some of the documents requested by the agency will reveal confidential data, something it is not willing to do.\n\nDiversity Concerns\n\nGoogle, one of the biggest Federal contractors, is required by law to permit the federal government to inspect and copy records of its compliance with equal opportunity. The law prohibits such contractors from discriminating in hiring based on applicant’s race, color, religion, sex, or sexual orientation. Why Google would discriminate by anything other than talent and productivity is an open question.\n\nThe tech giant handing over the required documents is expected to shed more light on its hiring practices as well as the composition of its workforce, though it is unclear how the composition of its workforce would constitute evidence of discrimination based on anything other than talent and productivity.\n\nJust like other tech companies where men occupy a good number of high-ranking position, Google continues to grapple with diversity concerns, something that the labor department wants to crack down on, as they hold that if the numbers are not exactly equal in proportion to population, discrimination based on something other than productivity must be taking place. The same is part of an effort that seeks to enforce equal employment opportunities regardless of one’s race, gender, or sexual orientation. It is unclear how this effort helps either those supposedly discriminated against, or Google.\n\nGoogle stock was unchanged in Wednesday trading session having shed $0.24 to close the session at $807.77 a share.\n\nPlease enable JavaScript to view the comments powered by Disqus.", "sentiment_subjectivity" : 0.4724014336917562, "date" : [ "Jan 5, 2017" ] }
{ "_id" : { "$oid" : "58c78e791d41c8139af69323" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://investorplace.com/2017/01/alphabet-inc-googl-planet-labs/&cid=52779340228276&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFY1EMcIfdfFL4zdPpSROVhDo4-oQ" ], "sentiment_polarity" : 0.2371212121212121, "headline" : [ "Alphabet Inc (GOOGL) Considers Selling Satellite Business to Planet Labs" ], "article_text" : "Alphabet Inc (NASDAQ: GOOG ,NASDAQ: GOOGL ) is considering selling its satellite business to Planet Labs.\n\nThe project is called Terra Bella and Alphabet first acquired it three years ago for $500 million, but it looks like the company is ready to rid itself of it. The satellite business was designed by the company to help in aiding areas in need such as disaster regions.\n\nTerra Bella has also helped to expand the less-fortunate areas around the world that have no access to the Internet as it offers free connection. It has also helped to improve Google Maps, which is as accurate as ever, offering images of roads, paths and the terrain of most countries around the world.\n\nIf a sale goes through, the proceeds will help to fund some of Google’s new projects which could become core assets in years to come. These include advancement in the drones business, as well as a commitment towards advancing autonomous driving technology and robotics.\n\nThe self-driving vehicle technology has quickly become a key part of Alphabet’s future as the company has spun off this part of its business into a stand-alone segment called Waymo. One of the vehicles developed by the company is being featured at the ongoing Detroit Auto Show 2017, which features the hottest vehicles of the year ahead of their release.\n\nGOOG shares fell 0.1% Tuesday, while GOOGL stock declined 0.1%.\n\nMore From InvestorPlace", "sentiment_subjectivity" : 0.4890151515151515, "date" : [ "Jan 10, 2017" ] }
{ "_id" : { "$oid" : "58c78e791d41c8139af69324" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://etfdailynews.com/2017/01/21/heres-why-alphabet-inc-is-still-the-real-driverless-car-leader/&cid=52779355247269&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNH3c4y2pFFuhgt8rZxXgWQrn2PGpA" ], "sentiment_polarity" : 0.1129188712522046, "headline" : [ "Here's Why Alphabet Inc Is Still The Real Driverless Car Leader" ], "article_text" : "From Tony Daltorio : One of the big draws at the recent annual Consumer Electronics Show in Las Vegas was the automakers showing off their latest driverless car technologies.\n\nBehind all the hoopla, however, was one inescapable fact . . .\n\nCarlos Ghosn, the CEO of Renault (OTC:RNLSY) and Nissan (OTC:NSANY), put it best: “There are still some problems to be solved.” He believes it will be two or three years before the technology is advanced enough for those vehicles to operate safely on the roads.\n\nGhosn was talking about level 3 vehicles according to a classification system devised by the Society of Automotive Engineers. Level 4 and level 5 automated vehicles are even further out. For a look at the SAE’s levels of driving automation, see the graphic below.\n\nA level 3 car designed for drivers to take their hands off the wheel and eyes off the road – for extended periods of time – is promised by Audi (owned by Volkswagen) to be out later in 2017.\n\nBut what about vehicles from Silicon Valley?\n\nWaymo: Ahead of Rivals\n\n\n\nThe foremost player here is Waymo, the autonomous car company owned by Alphabet (NASDAQ: GOOGL).\n\nAt the recent annual Detroit Auto Show, Waymo revealed it had built all of its self-driving sensor hardware itself. This puts the company ahead of rivals such as Uber in the race to perfect driverless vehicle technology.\n\nJohn Krafcik, the CEO of Waymo, said this signaled an “inflection point” for the company,as this will dramatically reduce the cost (possibly up to 90%) of its autonomous vehicles. That is certainly an important step in the move toward commercialization of such vehicles.\n\nKrafcik added that building the hardware and software together was crucial in improving accuracy. Or in other words, safety.\n\nThis is not good news for all the auto parts providers that were looking to cash in on autonomous vehicles. This includes the likes of Mobileye (NYSE:MBLY) and Delphi Automotive (NYSE: DLPH).\n\nIt’s a win-win scenario. Alphabet won’t have to get into car making business and automakers could just plug in Waymo technology into its vehicles without spending a penny for the platform’s development.\n\nSmart Moves by Waymo\n\n\n\nThere is one other reason I like Waymo’s approach to autonomous vehicles.\n\nIt says that its vehicles will be unplugged from the internet for the majority of time, lowering the chances of these vehicles being hacked.\n\nCEO Krafcik told the Financial Times, “Our cars communicate with the outside world only when they need to, so there isn’t a continuous line that’s able to be hacked, going into the car.”\n\nHacking risks rise as more and more sophisticated and connected technology is put into our cars. Once hackers get in via an internet connection – such as a connected radio – they can then take control of critical functions like steering or braking.\n\nOver the past few years, automakers including General Motors (NYSE:GM), Ford Motor (NYSE:F), Toyota Motor (NYSE:TM) and Fiat Chrysler Automobiles (NYSE:FCAU) have all reported car hacking vulnerabilities to varying degrees.\n\nThis shouldn’t come as a shock – these firms are not technology companies, they are car makers.\n\nA three-year study from cyber security company IOActive found that more than half of car components had “flaws” that could be exploited by hackers to control parts of a vehicle’s key functions.\n\nThe leader of the research, Corey Thuen, said “Every system or component that we tested had at least one vulnerability.” That is scary!\n\nEspecially if one considers that some automakers like BMW (OTC:BMWYY) has said that 5G networks will be essential because its vehicles will need to transmit data constantly and communicate with other vehicles.\n\nAlphabet’s Waymo cars doesn’t require communications infrastructure. They are intended to be nearly completely self-reliant. Its vehicles will only have to open a link to the cloud to send or receive pertinent information such as traffic reports.\n\nThat seems the safer route to me than the approach of others in building self-driving cars. This is just another reason to own Alphabet for the long-term.\n\nAlphabet Inc (NASDAQ:GOOGL) closed at $828.17 on Friday, up $3.80 (+0.46%). Year-to-date, GOOGL has gained 4.51%, versus a 1.44% rise in the benchmark S&P 500 index during the same period.\n\nThis article is brought to you courtesy of Wyatt Investment Research.", "sentiment_subjectivity" : 0.5429232804232804, "date" : [ "Jan 21, 2017" ] }
{ "_id" : { "$oid" : "58c78e7a1d41c8139af69325" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/3-stocks-to-watch-on-monday-amazoncom-inc-amzn-alphabet-inc-googl-and-tesla-motors-inc-tsla-cm731044&cid=52779338484084&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNH7P7jnuOFaJZFfIYCfbEK73cWhtw" ], "sentiment_polarity" : 0.1627777777777778, "headline" : [ "3 Stocks to Watch on Monday: Amazon.com, Inc. (AMZN), Alphabet Inc (GOOGL) and ..." ], "article_text" : "InvestorPlace InvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe Dow Jones Industrial Average pulled off the ultimate flirt last week, coming within less than a point of the 20,000 mark on Friday before nestling in just under that record.\n\nAs we head into Monday's trade, the Dow Jones will make another run at 20K. Meanwhile, a few blue chips will be in the spotlight thanks to headlines from the weekend, including Amazon.com, Inc. (NASDAQ: AMZN ), Alphabet Inc (NASDAQ: GOOG , NASDAQ: GOOGL ) and Tesla Motors Inc (NASDAQ: TSLA ).\n\nHere's what's happening with these juggernauts:\n\nAmazon.com, Inc. (AMZN)\n\nAmazon's Alexa voice assistant will now be offered in at least one major automotive company's vehicles .\n\nVolkswagen AG (ADR) (OTCMKTS: VLKAY ) announced that the popular virtual assistant - which is in the Echo speakers and a slate of other voice-activated products announced at CES 2017 - will be used in its vehicles.\n\nAlexa will help Volkswagen owners navigate through their cars' settings and functions in an easier and more convenient manner, taking voice commands and reacting appropriately.\n\nThe assistant will be integrated into the company's Car-Net system, which has been around since 2013. Users will be able to connect their cars to smartphones, unlock or locate their vehicle and monitor their speeds with Alexa.\n\nThe Amazon product will also inform users if the airbags are about to deploy, it will add destinations to the car's navigation systems, check their fuel levels, lock or unlock their vehicle from home and more.\n\nAMZN stock is up more than 6% in the young year.\n\nAlphabet Inc (GOOGL)\n\nAlphabet vehicles will be hitting the road, and soon .\n\nChrysler Pacificas with Google's self-driving technology will be unleashed onto public roads in late January, the tech giant announced over the weekend at the North American International Auto Show.\n\nWaymo - the Google self-driving project - is producing the technology for the Alphabet product. This means that the company will build its own cameras, sensors and matching technologies.\n\nLidar sensors will be key to bringing this autonomous driving concept to life, consisting of laser-mapping technology that is more advanced than simply using cameras to monitor the vehicle's surroundings.\n\nGOOG shares are up a little more than 4% so far this year.\n\nTesla Motors Inc (TSLA)\n\nTesla is also making moves toward advancing self-driving technology for generations to come, starting today.\n\nThe electric car giant tweeted a message Sunday morning, detailing that the company's most advanced autopilot functions will roll out to the entire fleet of TSLA vehicles on Monday.\n\nThe software, known as HW2, is already functional in 1,000 cars. It will be unleashed to all other vehicles, but will run in \"shadow mode\" until more data is gathered. Tesla will wait to get a more tangible idea of when the technology will be widely available across its products.\n\nAn initial version of the Tesla software was released in active mode last week to 1,000 cars.\n\nTSLA shares are up 7% year-to-date.\n\nMore From InvestorPlace\n\nThe post 3 Stocks to Watch on Monday: Amazon.com, Inc. (AMZN), Alphabet Inc (GOOGL) and Tesla Motors Inc (TSLA) appeared first on InvestorPlace .", "sentiment_subjectivity" : 0.4679365079365079, "date" : [ "Jan 9, 2017" ] }
{ "_id" : { "$oid" : "58c78e7a1d41c8139af69326" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://seekingalpha.com/article/4038406-alphabet-just-beginning-monetize-ventures-trading-discount&cid=52779352766130&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEyO_sPefffY1KoxPhcgAhcPLzChg" ], "sentiment_polarity" : 0.08144866882027005, "headline" : [ "Alphabet Just Beginning To Monetize Its Ventures While Trading At A Discount" ], "article_text" : "Its strong cash balance in combination with its venture-capital arm is not reflected in its P/E, allowing a price less than the market multiple for Google division.\n\n*For simplicity purposes, I reference the ticker GOOG as the Class C stock throughout the report, which is priced at about $806 as of 1/18/2017. The fundamental valuation principles and investment thesis still apply in the same way as Class A stock.\n\nAlphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) is a long opportunity capable of generating high shareholder returns over the next 12 to 18 months as well as for the long term. The company's stock is currently trading at a slightly lower price relative to its own historic level and compared to its peers, priced at LTM P/E of 29.3x versus 10-year median of 31.3x for GOOG and current median of 49x for its peers (see the full list in the later section). Although the valuations for these information technology (IT) firms are overpriced in comparison to 17.07x LTM P/E for S&P 500 IT sector index, the market is not realizing its potential growth opportunities in the coming years, as reflected in GOOG's current price level. GOOG's competitive moat and fundamental value proposition remain intact, and the stock is very susceptible to significant increase in price via catalysts such as the next earnings call.\n\nCompany Overview\n\nEver since Larry Page and Sergey Brin founded the company, GOOG was able to grow at an exponential rate due to two primary factors: the management capability and open-source platform of the business. At the center of all innovations that took place within GOOG lies the key leaders who took an unconventional approach to developing the business. For instance, GOOG's search engine became the world's best by pursuing one of its ten commandments \"focus on the user and all else will follow.\" Page and Brin followed this principle by rejecting offers from its competitors from displaying ads on its main search page because doing so would distract users from searching what they were looking for. They also decided to make its main page a blank white background with only the search box in the middle in order to increase the efficiency in which users would be immediately be directed out of the search page and be led to the page they were looking for. The strong focus on improving the user experience by the management is what resulted in value creation.\n\nIn conjunction with the management's extraordinary ability to innovate, GOOG was able to expand its user base at an astonishing rate due to the open-source platform (free-of-cost services/products), which created network effect (as the number of users increases, the value of individual interaction with the search engine increases). The effect is due to the search algorithm where user's input is used to generate results. Since the outcome is a function of user input, the relevancy and accuracy of the results page will only improve as more users are involved in the process. The open-source platform allows the network effect to be prevalent in every aspect of the business, including Gmail, Google Maps and Google Chrome. The firm is able to gather tremendous amounts of data about its users while increasing its user base at the same time, creating numerous monetization opportunities such as advertising.\n\nGOOG's business segments are broken down to two parts: Google and Other Bets. Under Google lies profitable divisions such as YouTube while Other Bets has long-term so-called moonshot ventures that include driverless cars and artificial intelligence. This portfolio structure makes GOOG a very attractive investment in both short- and long-term horizons because not only the ad sales at its primary business is growing at an impressive pace of 21% YoY despite its Q3 revenue size of $21.5B but also its Other Bets segment is setting up the stage for future disruption as well. Thus, GOOG poses opportunity for profits in both near and future years.\n\nWhat Happened\n\nGOOG has underperformed the S&P 500 during 2016 (6.3% return vs. 11.1%, respectively). Although its stock appreciated, the momentum was subdued. The story over the past two years since its restructuring has been weaker than expected results for Q1 earnings 2016. It posted $7.5/share on $20.26B in revenue versus analyst estimates of $7.97/share and $20.37B in revenue, polled by Thomson Reuters. This was partially due to lower cost per click. The transition into mobile screens from PCs resulted in decreasing cost per click.\n\nMore than expected capital expenditures on the firm's Other Bets segment also caused a recent selloff in the stock as investors became cautious about the moonshot projects that are generating large losses. The capex for the \"Other Bets\" division amounted to $280M in Q3, about a 50% increase from the previous quarter, most of which came from the Google Fiber project. However, GOOG is going through initiatives to scale back some of these projects, which will be discussed in the later section.\n\nThe estimates for Traffic-Acquisition-Costs (TAC) has been growing as well. Alphabet CFO Ruth Porat explained the narrowing margins were the result of higher TAC. For Q3, the street estimate for TAC was $4B before the Q3 release and the actual amount was $4.2B.\n\nThe recent macroeconomic events have also played their part in suppressing the valuation such as Trump's remarks on increased oversight on the tech firms' activities in terms of job creation and EU antitrust lawsuits.\n\nThese factors together have limited the company's market price in recent years as well as EPS growth outlook for short-term and long-term forecasts. GOOG is currently trading at 29.3x LTM PE vs a 20-year median of 31.3x, and 1.54x multiple of S&P 500's LTM P/E vs. a 20-year median of 1.83. Based on both historical standards and the S&P 500 valuation, GOOG is seen as a growth stock that is trading at a fair price with more than 54% upside potential.\n\nCatalysts\n\nThe following catalysts will boost the company's price to its intrinsic value, well above the current valuation. In a worst case scenario, the company at its current price level is fairly valued, resulting in a wide margin of safety and minimal downside risk. Based on the company's diversified portfolio of investments in different areas of technology, its current valuation reflects the overblown fears by investors in response to recent events that do not have meaningful impact on the firm's fundamental business model.\n\n1) Q4 Earnings Exceeding Expectations Through Hardware Business\n\nThe current market price does not reflect better-than-expected hardware sales during Q4. Google released its first ever smartphone designed by the firm during Q4 and the product was well received by the consumers. During Q4, Alphabet sold 552k Pixel phones at $700 a unit for revenue of $386M, which could add about $1.8B sales for 2017E, according to research by Goldman Sachs. Furthermore, Google Home sales are another contributing factor to the optimistic outlook for Q4 earnings results, selling more than 500k devices at around $129 each for a predicted revenue of $65M. Although the estimated margins on these devices are tighter due to the capital expenditure required to initially drive the manufacturing and distribution processes, the profits from hardware sales will flow to the bottom line as Google realizes economies of scale with larger production volume.\n\nThe introduction of new products will not only drive the price upwards for Q4 but also create a stronger ecosystem as well as network effect as mentioned earlier in the report. Thus far, Google has been focusing on providing an open platform for its users in hopes to enhance the user experience. The free-of-charge applications such as Gmail, Google Maps and YouTube allowed the company to exponentially increase its user base and collect as much user information as possible. Now with more than 1 billion monthly users across its open platform services, Google has enough data about its users such as their search patterns, popular destinations and contact lists within their Gmail or Google accounts. The company can deliver ever more efficient services as it integrates these collected data into Pixel and Google Home. For instance, as the smartphone keeps track of the user's location, it can send the information to Google Home beforehand so that it will know when to start boiling a cup of hot tea. Similarly, as more consumers utilize these products, the accuracy of applications such as Google Maps and Google Search will only get better, strengthening the network effect.\n\nAside from hardware business, Google Play and Google Cloud Platform offerings will also contribute to earnings as they gain material cloud share from AMZN's AWS.\n\n2) Monetization Efforts along With Continued User Base Growth\n\nThe key investment thesis in Alphabet is that the company has numerous monetization opportunities under its umbrella of businesses. First, it could be making more money off of YouTube by charging for service through a subscription-based model or loading it up with ads. Rather than trying to monetize its viewership to its fullest extent right now, Alphabet is allowing it to grow (currently monthly viwers exceed 1B users). Some say if its viewership was to be monetized, YouTube could be worth as much as $300/share and right now investors are paying almost nothing for it. Recently, Google rolled out a paid subscription service called YouTube Red, which allows consumers to pay for ad-free peace when watching YouTube videos. This is a step for Google towards monetizing YouTube, potentially having significant accretive impact on its earnings.\n\nGoogle's second monetization opportunity is its Google Maps. The company began to place relevant ads on Google Maps both within its search results list and on the map with a purple icon. It is aimed at increasing visibility of businesses at \"micro-moment\" with passive in-map suggestions of relevant stores, local inventory search, or in-store promotions. Just like YouTube, Google Maps also has a tremendous user base with high-precision accuracy of location search. The quality of service will not be compromised by advertisements because the application has already created a lasting network effect. Likewise, the relevancy of the ad will only improve as the user base grows. The app presents a solid foundation for a cash-generating machine in the near-term future.\n\nLastly, the firm's core search business is expanding its breadth of advertising platform. It is now applying Expanded Text Ads and Individual Bid Adjustments in its search advertising business in order to maximize profits from the service. Due to tremendous amount of paid-clicks on these advertisements, Google will be able to take a sizeable proceeds from these expanded ad efforts.\n\nThe monetization gap will get narrower as the gap between the total time spent on media and U.S. mobile's share of overall ad budgets continue to tighten. In 2015, U.S. consumers spent 24.0% of media time on mobile, according to eMarketer, compared to mobile's 12.6% share of total U.S. media ad budget spent, according to Magna Global. In 2016, consumers spent 25.7% of their total media time on mobile devices while mobile's share of allocated ad budgets was 18.2%. The trends in increasing time spent on mobile devices as well as higher allocation of media budget on mobile illustrate the market for media ad on mobile platform is getting bigger. For CY16, the online advertising market is on track to increase by $26bn. This creates even greater monetization prospects for Alphabet.\n\n3) Undervalued Market Price and Solid Financial Position\n\nAlphabet is trading at a bargain at current market price. It has a net cash balance of about $120 per share which is not reflected in its P/E multiple. It also has the venture-capital arm that has yielded losses in the past 12 months, driving down the reported net income by about $4/share. With a P/E multiple of 28x, you are paying a negative $100 for venture-capital division, which includes the moonshot ventures such as driverless cars and artificial intelligence.\n\nSo take $800 per share market price, deduct the value for YouTube and the cash balance, and then add the venture-cap losses back to the reported earnings. Adjusting for these three factors, you are paying a very cheap price for just the Google division.\n\nThe earnings estimates reflected in the market price are also relatively conservative. The current consensus EPS for the fourth quarter is $9.64/share and sales estimate of $20.5B (Net of TAC). The estimates are based on conservative assumptions, 11.5% QoQ growth rate for Google Websites ad revenue versus 14.1% growth last year in the same quarter. The consensus also assumes higher TAC to Google Network Members, 70.4% compared to 70.1% last quarter. Assuming higher SG&A expenses related to Pixel and Google Home marketing efforts as mentioned by management during Q3 earnings call, the gross margin is assumed to be 61.7% and operating margin of 25.6% for Q4. The estimated margins are lower than the previous quarters which have averaged about 63% and 26.5%, respectively.\n\nAlong with the underappreciated stock value, Alphabet has an extremely healthy balance sheet that is able to not only support growth in hardware sales through infrastructure spending but also drive shareholder-friendly capital allocation policies. With a cash balance of $83B and total debt of $4B, the company is able to put its cash to work through a series of acquisitions, a share repurchase or a special dividend, all of which would benefit shareholders in the long term.\n\nIn addition to the strong cash balance, GOOG is most likely to sell part of its moonshot ventures and receive proceeds in additional cash. GOOG announced on 1/13/17 that it is shutting down the drone project known as Project Titan as well as the Google Fiber project, which attempts to deliver high-speed internet via fiber-optic cables. It is also selling its satellite business to a startup called Planet Labs Inc. These sell-offs will limit the losses created by the divisions and free up some capital to pursue other more optimistic moonshot initiatives like Project Loon, Project Wing, AI, and self-driving technology. I believe such a move is an efficient allocation of capital into investments that have better prospects of coming through, just as GE did with its numerous subsidiaries. The disciplinary actions relating to capital allocation seem very appropriate for GOOG's balance sheet and will add value to the firm in the long term.\n\nValuation\n\nAs mentioned previously, GOOG has been trading at a relatively cheap valuation compared to its peers like Facebook (NASDAQ:FB).\n\nThe below table uses NTM valuations since the market is pricing GOOG based on its future earnings and what the investors are expecting in the coming months. Both NTM P/sales and NTM P/E for GOOG are on the lower end of the valuation spectrum relative to the universe of tech firms.\n\nHowever, GOOG is an unconventional company that is constantly introducing disruptive technologies. Thus, some would argue that it is inappropriate to compare its valuation to competitors but rather look at the company on its own.\n\nBelow is a breakdown on GOOG valuation based on three different scenarios over the next few years:\n\nBear Case\n\n2017E Net Income: $22.7B\n\nP/E: 23.3x\n\nMarket Cap: $528.9B\n\nShares Outstanding: 690M\n\nStock Price (Upside/Downside): $766.54 (-4.2%)\n\nThis scenario assumes GOOG's earnings will fall short relative to the consensus estimate ($23.0B). I assumed higher SG&A expenses than expected related to the Pixel and Google Home marketing costs and growing competition from Facebook over digital ads that may lead to slower growth in Google ad revenue. I also assumed P/E multiple much below the current LTM 29.3x.\n\nBase Case\n\n2017E Net Income: $23.9B\n\nP/E: 28.3x\n\nMarket Cap: $676.37B\n\nShares Outstanding: 690M\n\nStock Price (Upside/Downside): $980.25 (22.5%)\n\nThis assumes a conservative case where GOOG net income will exceed expectations while its P/E increasing to a higher multiple toward the median trading P/E of its peers at the current market level. As investors realize the growth potential through YouTube, monetization opportunities in Google Maps and hardware sales, the P/E will increase significantly.\n\nBull Case\n\n2017E Net income: $24.6B\n\nP/E: 33.7x\n\nMarket Cap: $829.0B\n\nShares Outstanding: 690M\n\nStock Price/Upside: $1,201.48 (50.2%)\n\nThis case assumes GOOG to continue building on its core search business while getting more efficient in TAC and SG&A expenses. Other growth prospects come from YouTube subscription based business and increasing investments into Cloud. Numerous investments allow ample room for opportunities to capture market share in different industries. P/E of 33.4x is appropriate considering the growth potential, huge piles of cash and the negative valuation put on its Other Bets division.\n\nBased on its 2017E net income, the return on invested capital (ROIC), the returns from the capital put into future working capital, PP&E, goodwill, and other intangible assets, would improve in comparison to its three-year historical average of 28.9%.\n\nRisks\n\nWhat could go wrong:\n\n1) As media time is spent more on mobile rather than desktops, revenue from ads may decelerate due to the nature of smaller displays.\n\n2) The monetization on next major revenue drivers - cloud, hardware, and Maps - may not materialize\n\n3) EU antitrust lawsuits posing greater regulatory risk around Android, Adsense and Shopping. This increases potential for more scrutiny over GOOG's operations in Europe.\n\nConclusion\n\nI believe that the market is offering investors a very attractive opportunity to allocate their capital in GOOG at a cheap multiple. As Warren Buffett once quoted, \"it's far better to buy a wonderful company at a fair price than a fair company at a wonderful price.\" GOOG is not only a wonderful company but also trades at an attractive price point. The company will be able to expand its loyal base of users and generate total shareholder returns of 11.5% over the short term. At 25-27x 2017E P/E multiple, GOOG's intrinsic price would be trading at around $833.16-897.47, about 10% above the current levels. Most of the risks surrounding the company have disappeared post shut downs on capex-heavy projects like Project Titan and the firm continues to increase its earnings despite growing competition.\n\nA few remarks on GOOG. Google is now at a turning point where it could turn into even larger cash generating machine as it starts to monetize on its array of businesses. I believe these initiatives are most likely driven by earnings-conscious CFO, Ruth Porat, who joined the firm in 2015. I see her role within the company as the next cash flow booster in the firm's growth stages. She is making efforts to cut costs and generate cash flows in wherever possible, thus transitioning the company from a somewhat experimental, premature organization into a cost-efficient, free cash flow generating holdings company. That is not to say that the firm is compromising any of its business qualities or innovations taking place within its umbrella. Sergey Brin, Larry Page and Eric Schmidt continue to have the majority of the voting rights and they will constantly push towards establishing disruptive technologies in order to put Alphabet at the forefront of innovation. Thus, addition of Ruth Porat as CEO and other impactful leaders to the management are positive factors of growth in the long term.\n\nI view investing in GOOG as a long-term commitment and it is also a bet on its management. There will inevitably be a few bumps along the way but a major part of my investment thesis is the management's capability to handle those tough situations. Historically, the leaders at GOOG have proved their core values through the \"Ten commandments.\" They decided not to expand their business in China, for instance, in order to stick to those principles. I view this characteristic of the management as a key factor in pushing the firm towards retaining its fundamental value proposition.\n\nDisclosure: I am/we are long GOOG.\n\nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "sentiment_subjectivity" : 0.4538447705366139, "date" : [ "Jan 21, 2017" ] }
{ "_id" : { "$oid" : "58c78e7b1d41c8139af69327" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.smarteranalyst.com/2017/01/19/baird-top-analyst-shares-two-cents-twitter-inc-twtr-following-alphabet-inc-googl-acquisition-fabric-developer-platform/&cid=52779351836526&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGS--rotjyApWCw8U2mMxt3LLeBZA" ], "sentiment_polarity" : 0.1181268731268731, "headline" : [ "Baird Top Analyst Shares Two Cents on Twitter, Inc. (TWTR) Following Alphabet ..." ], "article_text" : "Twitter Inc (NYSE:TWTR) revealed today that its app development platform known as Fabric is to be acquired by Alphabet Inc (NASDAQ:GOOGL). Though top analyst Colin Sebastian sees this as a sensible move on the social media giant’s part considering its recent transition towards core services and platforms, he remains sidelined on the bigger picture.\n\nAs such, the analyst reiterates a Neutral rating on shares of TWTR with a $17 price target, which aligns with current levels.\n\nSebastian notes, “Twitter is kicking off the new year with greater focus on the core application and supporting features, such as investing in ad products (including MoPub) and in the ramping of additional streaming partnerships in an effort to fuel new user growth and strengthen advertiser engagement. Given sluggish user and revenue trends, and what appears to be limited interest from potential acquirers at current enterprise value, we can understand management’s increased emphasis in these areas.”\n\nUltimately, “Fabric’s development tools, including the top-rated Crashlytics and Answers app stability kits, grew to reach nearly 2.5 billion active mobile devices in two years. Despite the early success of Fabric, we believe Twitter’s decision to divest makes sense as part of a broader strategic move toward the company’s core services,” Sebastian concludes.\n\nColin Sebastian has a very good TipRanks score with a 74% success rate and a high ranking of #18 out 4,350 analysts. Sebastian garners 17.0% in his yearly returns. When recommending TWTR, Sebastian earns 0.0% in average profits on the stock.\n\nTipRanks analytics exhibit TWTR as a Hold. Out of 21 analysts polled by TipRanks in the last 3 months, 3 are bullish on Twitter stock, 13 remain sidelined, and 5 are bearish on the stock. With a loss potential of 3%, the stock’s consensus target price stands at $16.57.", "sentiment_subjectivity" : 0.4617415917415917, "date" : [ "Jan 19, 2017" ] }
{ "_id" : { "$oid" : "58c78e7c1d41c8139af69328" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://news.cmlviz.com/2017/01/12/alphabet-inc-nasdaq-googl-looks-good-but-has-risk.html&cid=52779343266883&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNE3VBuhYYyH6AZrjvCIHu89lHDwjQ" ], "sentiment_polarity" : 0.1750325752191424, "headline" : [ "The Good and the Risk in Alphabet Inc (NASDAQ:GOOGL)" ], "article_text" : "\n\nThe Good and the Risk in Alphabet Inc (NASDAQ:GOOGL)\n\n\n\nAlphabet Inc (NASDAQ:GOOGL) Looks Good But Has Risk\n\n2017-01-12\n\n\" Honda Motor (HMC) said Wednesday that it is in formal discussions with Waymo, the self-driving stand-alone unit of Google parent Alphabet (GOOGL), to add its autonomous vehicle technology to Honda vehicles.\n\n\n\nSource: BARRON'S \" Source: Bloomberg\n\n\" Alphabet Inc. and Fiat Chrysler Automobiles NV are doubling down on their self-driving partnership, adding about 100 more Pacifica Hybrid minivans to an autonomous fleet first announced in May, according to people familiar with the decision.\n\n\n\nSource: Bloomberg \" Source: Bloomberg\n\n\" The retail deals announced at the consumer technology show CES in Las Vegas hint at Google's broader ambition to merge its mapping capabilities with its core business of facilitating commerce.\n\n\n\nSource: Bloomberg \" Source: Bloomberg\n\nAlphabet Inc (NASDAQ:GOOGL) is making good progress into a diversified business -- but it also faces one very large risk.First, the company revealed how serious it's getting about self-driving cars, moving it from moonshot status to full blown company status in our CML Pro dossier: It's Time to Focus on Google In that dossier we note that Alphabet Inc created a new company under its umbrella called Waymo. Alphabet Inc teamed up with Fiat Chrysler to put its self-driving technology in a 100 Chrysler minivans. This serves as both a test for the self-driving car technology, and the earliest part of a potential blockbuster deal. Then we got this:As we wrote in that dossier:\"It was lost in the wind of headlines, but Alphabet has already started talks with General Motors and Ford as well. Now, imagine for a moment that the self-driving revolution, which is coming much sooner than Wall Street understands, is driven by Alphabet's technology.Yeah, Tesla will have their cars, and likely Apple as well, but Chrysler, Honda and possibly other manufacturers partnering with Alphabet Inc could mean a leader has already been established.Let Tesla sell its 500,000 cars by 2018 if they can. Alphabet is looking to sell tens of millions within five years, with no cost of production, no assembly line, no radical new business - just the best technology in the world licensed to the largest auto makers in the world.\"That was actually review, here is the new information we learned:But that was the distraction. The real news is that Alphabet is finally going after Uber. Alphabet Inc (NASDAQ:GOOGL) is going to use the semi-autonomous Chrysler Pacifica fleet as a ride-hailing service. Waymo's next move is going to be to let people \"use our vehicles to do everyday things like run errands, commute to work, or get safely home after a night on the town.\"That new build out with Fiat Chrysler looks like it's actually going to happen. But we got even more news from Google last week: The company has rolled out a new retail partnership with BMW and the Gap to deploy its 3-D-scanning project called 'Tango'.The idea here is virtual shopping as a replacement or addition to 'real' shopping. The vision is pretty clear with automobiles and it's nice to see Google going further with standard retail. \"A new app allows shoppers to test clothes from the Gap brand using Tango.\"There are limited audiences for this technology right now, but looking to the future is always the right move for technology.This business, the self-driving car business, along with a possible new line with the Google Pixel smartphone, which we wrote about in our dossier Wall Street is Blind to Google's Upside Potential is finally giving us an eye to Alphabet's broader diversification strategy.But there is risk to Alphabet Inc -- one that's growing and one that is existential.(1) Google is losing a sizable piece of its business to Amazon in one particular area: e-commerce search, according to Eugene Kim of Business Insider.(2) Google better straighten out the 'fake news' phenomenon. As I stated ever so clearly on CBC with Peter Armstrong, if Google Search is no longer a trusted source of content, Google is dead. Of course, that's a radical take on it -- we just note that the company better make strides here, and we believe they will.Here is that interview for convenience (link on MSN Money) Alphabet remains aTop Pick and we remain bullish on the company long-term. We love the new progress and praise the company for finally turning new ideas into new businesses.We promised we would include more option content in our dossiers, so here is a nice piece on Alphabet Inc.Staying bullish here, we examined selling put spreads in GOOGL over a three-year period every month. During this time frame the stock has risen 42.7%. The put spreads, well, they did a lot better:And here is the option strategy highlighted in yellow versus the stock in gray:We discovered this ever so easily on the CML Trade Machine option back-tester with three clicks of the mouse. For those that want to learn more you can click here (it will open a new window, this story will stay here): CML Option back-tester", "sentiment_subjectivity" : 0.5233505093579719, "date" : [ "Jan 12, 2017" ] }
{ "_id" : { "$oid" : "58c78e7e1d41c8139af69329" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.inc.com/associated-press/alphabet-q4-2016-earnings.html&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFXLJH3g009H-Ss6jxsN-yZZpcF8A" ], "sentiment_polarity" : -0.1083333333333333, "headline" : [ "Alphabet, Google's Parent Company, Posts Disappointing Profit" ], "article_text" : "Alphabet Inc. (GOOGL) on Thursday reported fourth-quarter earnings of $5.33 billion.\n\nOn a per-share basis, the Mountain View, California-based company said it had profit of $7.56. Earnings, adjusted for stock option expense, were $9.36 per share.\n\nThe results missed Wall Street expectations. The average estimate of 16 analysts surveyed by Zacks Investment Research was for earnings of $9.63 per share.\n\nThe internet search leader posted revenue of $26.06 billion in the period. After subtracting Alphabet's advertising commissions, revenue was $21.22 billion, which topped Street forecasts. Thirteen analysts surveyed by Zacks expected $20.58 billion.\n\nAlphabet shares have increased 8 percent since the beginning of the year, while the Standard & Poor's 500 index has increased almost 3 percent. In the final minutes of trading on Thursday, shares hit $856.98, a rise of 17 percent in the last 12 months.\n\n--Associated Press", "sentiment_subjectivity" : 0.4111111111111111, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e811d41c8139af6932a" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.gurufocus.com/news/473153/dnb-asset-management-as-buys-alphabet-inc-apple-inc-oracle-corp-sells-western-digital-corp-mead-johnson-nutrition-co-vmware-inc&cid=52779350144679&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEiYMcs1ndUrtJHzb5aHrrh7mz21w" ], "sentiment_polarity" : -0.07609717868338557, "headline" : [ "DnB Asset Management AS Buys Alphabet Inc, Apple Inc, Oracle Corp, Sells ..." ], "article_text" : "Oslo, Q8, based Investment company DnB Asset Management AS buys Alphabet Inc, Apple Inc, Oracle Corp, Abbott Laboratories, Fitbit Inc, sells Western Digital Corp, Mead Johnson Nutrition Co, VMware Inc, Finisar Corp, Pfizer Inc during the 3-months ended 2016-12-31, according to the most recent filings of the investment company, DnB Asset Management AS. As of 2016-12-31, DnB Asset Management AS owns 517 stocks with a total value of $5.1 billion. These are the details of the buys and sells.\n\n\n\nNew Purchases: TAL, RE, CMA, TFX, PDCO, MFS, ALV, TSLA, CE, XEC,\n\nTAL, RE, CMA, TFX, PDCO, MFS, ALV, TSLA, CE, XEC, Added Positions: GOOGL, AAPL, ORCL, ABT, FIT, FB, CRM, GPRE, CMCSA, BG,\n\nGOOGL, AAPL, ORCL, ABT, FIT, FB, CRM, GPRE, CMCSA, BG, Reduced Positions: WDC, MJN, VMW, FNSR, PFE, HUN, QCOM, MOS, WFC, DAN,\n\nWDC, MJN, VMW, FNSR, PFE, HUN, QCOM, MOS, WFC, DAN, Sold Out: BRCD, CECE, CMCM, CHL, STJ, UA, TS, PTEN, NRG, MYRG,\n\nFor the details of DnB Asset Management AS's stock buys and sells, go to http://www.gurufocus.com/StockBuy.php?GuruName=DnB+Asset+Management+AS\n\nAlphabet Inc (GOOGL) - 344,010 shares, 5.36% of the total portfolio. Shares added by 39.25% Apple Inc (AAPL) - 2,067,194 shares, 4.71% of the total portfolio. Shares added by 33.54% Microsoft Corp (MSFT) - 3,277,989 shares, 4% of the total portfolio. Shares added by 8.66% Johnson & Johnson (JNJ) - 1,289,425 shares, 2.92% of the total portfolio. Shares added by 7.03% Oracle Corp (ORCL) - 3,275,148 shares, 2.48% of the total portfolio. Shares added by 49.75%\n\nDnB Asset Management AS initiated holdings in TAL Education Group. The purchase prices were between $66.76 and $82, with an estimated average price of $73.33. The stock is now traded at around $75.66. The impact to the portfolio due to this purchase was 0.21%. The holdings were 151,300 shares as of 2016-12-31.\n\nDnB Asset Management AS initiated holdings in Everest Re Group Ltd. The purchase prices were between $184.24 and $218.38, with an estimated average price of $206.07. The stock is now traded at around $219.25. The impact to the portfolio due to this purchase was 0.11%. The holdings were 25,557 shares as of 2016-12-31.\n\nDnB Asset Management AS initiated holdings in Comerica Inc. The purchase prices were between $47.37 and $70.03, with an estimated average price of $58.6. The stock is now traded at around $69.92. The impact to the portfolio due to this purchase was 0.1%. The holdings were 76,611 shares as of 2016-12-31.\n\nDnB Asset Management AS initiated holdings in Teleflex Inc. The purchase prices were between $139.41 and $169.09, with an estimated average price of $155.74. The stock is now traded at around $169.37. The impact to the portfolio due to this purchase was 0.09%. The holdings were 27,889 shares as of 2016-12-31.\n\nDnB Asset Management AS initiated holdings in Patterson Companies Inc. The purchase prices were between $38.74 and $48.36, with an estimated average price of $43.14. The stock is now traded at around $41.28. The impact to the portfolio due to this purchase was 0.08%. The holdings were 93,985 shares as of 2016-12-31.\n\nDnB Asset Management AS initiated holdings in Manitowoc Foodservice Inc. The purchase prices were between $15.01 and $19.33, with an estimated average price of $17.07. The stock is now traded at around $19.35. The impact to the portfolio due to this purchase was 0.08%. The holdings were 214,300 shares as of 2016-12-31.\n\nDnB Asset Management AS added to the holdings in Alphabet Inc by 39.25%. The purchase prices were between $753.22 and $835.74, with an estimated average price of $799.67. The stock is now traded at around $830.94. The impact to the portfolio due to this purchase was 1.51%. The holdings were 344,010 shares as of 2016-12-31.\n\nDnB Asset Management AS added to the holdings in Apple Inc by 33.54%. The purchase prices were between $105.71 and $118.25, with an estimated average price of $113.4. The stock is now traded at around $119.04. The impact to the portfolio due to this purchase was 1.18%. The holdings were 2,067,194 shares as of 2016-12-31.\n\nDnB Asset Management AS added to the holdings in Oracle Corp by 49.75%. The purchase prices were between $37.93 and $40.88, with an estimated average price of $39.11. The stock is now traded at around $39.26. The impact to the portfolio due to this purchase was 0.82%. The holdings were 3,275,148 shares as of 2016-12-31.\n\nDnB Asset Management AS added to the holdings in Abbott Laboratories by 210.68%. The purchase prices were between $37.6 and $43.5, with an estimated average price of $39.65. The stock is now traded at around $40.93. The impact to the portfolio due to this purchase was 0.66%. The holdings were 1,289,876 shares as of 2016-12-31.\n\nDnB Asset Management AS added to the holdings in Fitbit Inc by 377.29%. The purchase prices were between $7.29 and $14.78, with an estimated average price of $10.24. The stock is now traded at around $7.44. The impact to the portfolio due to this purchase was 0.65%. The holdings were 5,718,526 shares as of 2016-12-31.\n\nDnB Asset Management AS added to the holdings in Facebook Inc by 37.68%. The purchase prices were between $115.05 and $133.28, with an estimated average price of $122.81. The stock is now traded at around $128.34. The impact to the portfolio due to this purchase was 0.6%. The holdings were 975,217 shares as of 2016-12-31.\n\nDnB Asset Management AS sold out the holdings in Brocade Communications Systems Inc. The sale prices were between $8.67 and $12.51, with an estimated average price of $11.25.\n\nDnB Asset Management AS sold out the holdings in CECO Environmental Corp. The sale prices were between $9.55 and $14.77, with an estimated average price of $12.19.\n\nDnB Asset Management AS sold out the holdings in Cheetah Mobile Inc. The sale prices were between $8.97 and $13.43, with an estimated average price of $10.62.\n\nDnB Asset Management AS sold out the holdings in China Mobile Ltd. The sale prices were between $51.92 and $63.12, with an estimated average price of $56.18.\n\nDnB Asset Management AS sold out the holdings in St Jude Medical Inc. The sale prices were between $77.44 and $81.28, with an estimated average price of $79.37.\n\nDnB Asset Management AS sold out the holdings in Hydrogenics Corp. The sale prices were between $4 and $6.68, with an estimated average price of $5.21.\n\nDnB Asset Management AS reduced to the holdings in Western Digital Corp by 48.65%. The sale prices were between $53.07 and $70.35, with an estimated average price of $60.99. The stock is now traded at around $71.00. The impact to the portfolio due to this sale was -1.33%. DnB Asset Management AS still held 1,150,491 shares as of 2016-12-31.\n\nDnB Asset Management AS reduced to the holdings in Mead Johnson Nutrition Co by 65.2%. The sale prices were between $70.69 and $80.96, with an estimated average price of $74.53. The stock is now traded at around $70.39. The impact to the portfolio due to this sale was -0.91%. DnB Asset Management AS still held 298,427 shares as of 2016-12-31.\n\nDnB Asset Management AS reduced to the holdings in VMware Inc by 37.55%. The sale prices were between $72.45 and $82.58, with an estimated average price of $77.63. The stock is now traded at around $82.01. The impact to the portfolio due to this sale was -0.66%. DnB Asset Management AS still held 715,759 shares as of 2016-12-31.\n\nDnB Asset Management AS reduced to the holdings in Finisar Corp by 94.71%. The sale prices were between $27.35 and $34.13, with an estimated average price of $30.71. The stock is now traded at around $29.45. The impact to the portfolio due to this sale was -0.63%. DnB Asset Management AS still held 56,120 shares as of 2016-12-31.\n\nDnB Asset Management AS reduced to the holdings in Pfizer Inc by 26.4%. The sale prices were between $29.89 and $33.9, with an estimated average price of $32.18. The stock is now traded at around $32.52. The impact to the portfolio due to this sale was -0.52%. DnB Asset Management AS still held 2,063,592 shares as of 2016-12-31.\n\nDnB Asset Management AS reduced to the holdings in Huntsman Corp by 58.67%. The sale prices were between $15.66 and $20.33, with an estimated average price of $18.16. The stock is now traded at around $20.16. The impact to the portfolio due to this sale was -0.47%. DnB Asset Management AS still held 976,989 shares as of 2016-12-31.", "sentiment_subjectivity" : 0.3940438871473352, "date" : [ "Jan 17, 2017" ] }
{ "_id" : { "$oid" : "58c78e821d41c8139af6932b" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://seekingalpha.com/article/4039345-alphabet-buy-advertising-business-get-rest-free&cid=52779359885097&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGkJkWcVXH9Zae1S7GRerYmslOVbA" ], "sentiment_polarity" : 0.08878996312329648, "headline" : [ "Alphabet: Buy The Advertising Business And Get The Rest For Free" ], "article_text" : "Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL) is one of those companies that receives a lot of coverage with a wide range of price targets. While it is difficult to peg a price target on Alphabet with traditional valuation methods, I believe there is sufficient evidence that a large margin of safety exists at the current price level. I like to frame the opportunity something like this: Alphabet's Google division alone can easily justify the current stock price of a little more than $800 per share, with the venture capital arm and \"other bets\" essentially trading for free.\n\nGoogle division easily worth $800 per share\n\nWith revenue growth around 20% and a forward PE of near 20 after accounting for the net cash on the balance sheet, the valuation is very reasonable (and this includes the losses from Other Bets). The secular growth in online advertising revenue is showing no signs of slowing down. The Interactive Advertising Bureau (IAB) reported in their Internet Advertising Revenue Report that online advertising has increased at a 17% clip since 2005, and was up 20% YoY in 2015. Mobile ad growth is the primary reason for the recent acceleration.\n\nThe pace has kept up thus far in 2016. IAB reported in their Q3 2016 update that internet ad revenues climbed 20% YoY again in the quarter. Alphabet appears to be holding their market share, even with the surging Facebook, as they also announced similar revenue growth during the Q3 period.\n\nSurging internet ad revenue has come at the expense of the traditional media outlets, a trend expected to continue. Adding the broadcast and cable television lines together in the graph above you see that in 2015 internet ad revenue has caught up to television ad revenue. We will see internet ad revenue surpass broadcast and cable revenue for the first time in 2016.\n\nIn addition to being the most dominant player in search, Google has yet to seriously monetize their YouTube and Maps platforms, both of which have over one billion monthly users. Google is set up well to at least maintain their market share in fast growing interned advertising space, making a 20 P/E multiple look like a bargain.\n\nI love me some free options:\n\nWhile it is easier to illustrate why the downside at this price is limited for Alphabet, it is much harder to estimate a fair value. This is because the company has so many other bets spread around, each with option-like payoff profiles. What I mean by this is that the payoff on each investment is very similar to that of an out-of-the-money call option. The cost to acquire the option is small, but the most likely scenario is a loss of the capital invested. However, there is a small probability that payoff could be huge and uncapped. The more bets Alphabet makes into these potentially disruptive technologies and innovations, the more likely one of them turns into a home run. The payoffs of these bets are highly uncertain, but getting them for free is clearly a great value.\n\nAutonomous vehicles, artificial intelligence, drone delivery, robotics and new forms of high-speed internet services are just a few examples of some of these other bets that could potentially yield high payoffs. Additionally, the venture capital arm could strike it rich with a timely investment in the next disruptive technology.\n\nThere are also plenty of bets going on inside of the Google division, which too are not properly valued in the share price. Of these, cloud services probably has the biggest potential. Google recently introduced Google Cloud as a new business unit that includes their collaboration and productivity applications, machine learning and data analytics tools, and application program interfaces. Google's access to vast amounts of data and their advancements and investments in machine learning and artificial intelligence should prove a compelling value proposition for cloud customers.\n\nRevenues from Google's cloud services are not broken out from the rest of Google revenues in their SEC filings, but management has indicated that cloud is growing quickly and that they are investing heavily. In Q3, Google other revenue (the line cloud rolls up under) was $2.4 billion, up 39% YoY with the growth explained on the earnings call as \"driven by Play and Cloud\" and that the cloud platform had the largest YoY growth of any revenue line.\n\nAnother signal from the earnings call that shows how much the company is investing in cloud is headcount growth, which grew 5% in Q3 alone, to 69,953. CFO Ruth Porat clarified that the \"vast majority of new hires were engineers and product managers to support growth in priority areas such as cloud.\"\n\nIf even a modest market share were eventually carved out in this fast growing and highly profitable space, the effect on the stock price could be quite large. In their semi-annual Public Cloud Customer Research report, TBR forecasts that the public cloud market will reach $167B by 2020. In the report TBR also estimates that Google cloud revenues were $2.8B in 2015, or roughly 3.4% of the market. Based on the clues from the earnings calls I think we can assume cloud revenues are currently growing at an over 50% annual rate for Google. While perhaps not the base case, it is not unfathomable that Google could carve out a 10% market share by 2020. Using the TBR market estimates, this would be $16.7 billion in revenue. Applying a price-to-sales multiple of 6 we could be looking at a $100 billion cloud business by 2020. This free option is hard to pass up.\n\n(SOURCE: TBR Public Cloud Customer Research report)\n\nKey Risks:\n\nWhile Alphabet has a lot of opportunities for growth in new markets outside of advertising, the advertising business is still the engine that allows the company the luxury of making so many investments in early stage technologies. While I believe the fundamentals for owning Alphabet as these levels is strong, a prudent investor should keep a careful eye on revenue growth and margins to make sure the core advertising cash flow engine stays healthy.\n\nRevenue : I'd like to see advertising revenue continue to increase at a 15%-20% rate (before currency translation). The key metrics to monitor for advertising revenue are the aggregate change in paid clicks and the cost per click. Paid clicks has continued to trend up, rising 30% YoY in the first nine months of 2016. During the same period cost per click trended down 9%, likely due to increased competition from social media, a phenomenon seen across the industry. A slowdown in net advertising revenue growth below 15% in the next year would cause me to re-evaluate my thesis. Social media's share of internet ad spend also shouldn't be ignored, and warrants monitoring.\n\nI'd like to see advertising revenue continue to increase at a 15%-20% rate (before currency translation). The key metrics to monitor for advertising revenue are the aggregate change in paid clicks and the cost per click. Paid clicks has continued to trend up, rising 30% YoY in the first nine months of 2016. During the same period cost per click trended down 9%, likely due to increased competition from social media, a phenomenon seen across the industry. A slowdown in net advertising revenue growth below 15% in the next year would cause me to re-evaluate my thesis. Social media's share of internet ad spend also shouldn't be ignored, and warrants monitoring. Margins: The key metric I recommend watching here are traffic acquisition costs. These costs have been trending up, due mainly to the growing mix of mobile traffic. Higher traffic acquisition costs for mobile is primarily due to paying Apple (NASDAQ:AAPL) to make Google the default search engine on the iPhone.\n\nConclusion:\n\nBuy Alphabet's core Google business right now at a fair price, which has it's own upside potential from the continued secular growth of online advertising and the under-monetization of the Maps and YouTube businesses. Get for free all of the other bets and their inherent option-like payoffs profiles. Use your own judgment on the likelihood one or more of these bets succeed, along with the size of the prize, to gauge just how undervalued Alphabet is.\n\nDisclosure: I am/we are long GOOGL.\n\nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "sentiment_subjectivity" : 0.5141996419218642, "date" : [ "Jan 25, 2017" ] }
{ "_id" : { "$oid" : "58c78e841d41c8139af6932c" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://marketexclusive.com/apple-amazon-alphabet-smart-home-hardware/68658/&cid=52779344635249&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEYvWAHiFXz65VzXPrYUVXM6Llotg" ], "sentiment_polarity" : 0.06471072330447329, "headline" : [ "Apple Inc. (NASDAQ:AAPL) Amazon.com, Inc. (NASDAQ:AMZN) Alphabet Inc (NASDAQ ..." ], "article_text" : "Revenues from smart home hardware and services are poised to climb to highs of $83 billion this year, according to market research firm Juniper. The number could more than double to highs of $195 billion by 2021 according to the research firm given the rate at which various segments are gaining traction. Apple Inc. (NASDAQ:AAPL), Amazon.com, Inc. (NASDAQ:AMZN), Alphabet Inc (NASDAQ:GOOGL) and Samsung are poised to be the biggest beneficiaries of the expected growth given their investments in the fast-growing space.\n\nMarket Leaders\n\nHome automation and smart appliances continue to experience exponential growth driven by tech giants investing in them as the race for new opportunities for growth heats up. Google has already made an entry into the space with smart speakers and Google Home. Amazon’s Echo speaker is another smart home device that continues to dominate.\n\nSmart home hardware and services cover a gamut of categories including entertainment, healthcare automation and connected devices. It is for this reason that the fast emerging industry continues to attract investments from big tech companies that are looking for new opportunities for growth away from their core operations.\n\nGrowth Slowdown\n\nJuniper, however, expects the likes of Amazon, Apple, Samsung and Google to solidify their positions in smart home hardware given their already leading roles. The e-commerce giant for instance already boasts a robust cloud service that should give it an edge compared to other companies going forward\n\n“The company has managed to maximize its value proposition for Alexa by partnering with a large range of complementary players in the market, whilst utilizing its own cloud platform to set Echo and Alexa apart from its competitors in terms of functionality,“ Juniper said in a statement\n\nThe research firm has however warned that revenue growth in the most mature segment, which is smart entertainment, could slow from current levels as other segments gain traction. Smart appliance and home automation devices are slowly gaining traction. Entry of the likes of LittleBits, Notion and iVee into the 2 segments according to the research firm will fuel growth going forward.\n\nApple was unchanged in Tuesday trading session having rallied by 0.10% to close the day at $119.11 a share. Google on the other hand was down by $1.17 a share ending the day at lows of $826.01 a share.\n\nPlease enable JavaScript to view the comments powered by Disqus.", "sentiment_subjectivity" : 0.4810752615440116, "date" : [ "Jan 11, 2017" ] }
{ "_id" : { "$oid" : "58c78e861d41c8139af6932d" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.investing.com/analysis/alphabet-inc.-earnings-rise-9-in-q4-so-what-about-valuation-now-200173847&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGLQWNogEXe7OAKQpVnxS05RLjSNA" ], "sentiment_polarity" : 0.04767316017316018, "headline" : [ "Alphabet Inc. Earnings Rise 9% In Q4, So What About Valuation Now?" ], "article_text" : "Alphabet Inc(NASDAQ: ) reported earnings yesterday for the 4th quarter 2016.The results were as follows :\n\n-Earnings (Q4): $6.59 Bln. vs. $6.04 Bln. last year.\n\n-Earnings Growth (Y-o-Y): 9.1%\n\n-EPS (Q4): $9.36 vs. $8.67 last year. -EPS Growth (Y-o-Y): 8.0%\n\n-Analysts Estimate: $9.64 -Revenue (Q4): $26.06 Bln vs. $21.33 Bln last year.\n\n-Revenue Change (Y-o-Y): 22.2%\n\n(Source : Nasdaq.com)\n\nBut what is also interested is a report we read on Yahoo Finance with following key points :\n\nUS digital ad revenue is expected to reach nearly $100 billion by 2021, according to BI Intelligence estimates. This represents compound annual growth of 8% from the $68.9 billion expected in 2016.\n\nThis represents compound annual growth of 8% from the $68.9 billion expected in 2016. Mobile is positioned to become the top destination for digital ad spending as advertisers continue to attempt to close the \"mobile opportunity gap.\"\n\nDigital video advertising will grow faster than any other segment over the next five years, as consumers shift time spent online to phones and tablets . Revenue in this category is forecast to rise from $8.5 billion in 2016 to $23 billion in 2021.\n\nRevenue in this category is forecast to rise from $8.5 billion in 2016 to $23 billion in 2021. Social advertising in all formats is gaining traction and will be among the key drivers of digital ad growth in the next five years. Social ad revenue is poised to climb to $30.8 billion by 2021, up from $15.5 billion this year.\n\nSocial ad revenue is poised to climb to $30.8 billion by 2021, up from $15.5 billion this year. Artificial intelligence, augmented and virtual reality, and sponsored content will help propel further digital ad growth in the next decade.\n\nIt is positive that Alphabet Inc.(NASDAQ:GOOGL) posted both a revenue and an EPS growth, as revenues drive EPS growth in most times.And we can see that mobile advertising and marketing are the dominant factors of profitability for Alphabet Inc.\n\n\n\nIf we analyze relative valuation based on key financial ratios such as P/E,P/CF,P/BV,P/S comparing Alphabet Inc.(NASDAQ:GOOGL) and industry,sector average and we get a mixed picture.But if we focus on profitability and operating margin,net profit margin, then Alphabet Inc. has better ratios compared to industry,sector and ratios.(Source cnbc.com)\n\n\n\nProfitability and earnings growth are very crucial drivers for stock prices.While we cannot suggest if at current levels Alphabet Inc. (NASDAQ:GOOGL) is undervalued,overvalued or fairly valued, it seems that the company has a competitive edge at least for profitability, combined with reasonable EPS growth.", "sentiment_subjectivity" : 0.3588203463203463, "date" : [ "Jan 29, 2017" ] }
{ "_id" : { "$oid" : "58c78e861d41c8139af6932e" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/68963-alphabet-inc-googl-earnings-preview/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHPGTiTbf4i6fuPuRL3-2KqFWtiYw" ], "sentiment_polarity" : 0.1753864428254672, "headline" : [ "Alphabet Inc. (NASDAQ:GOOGL): Earnings Preview" ], "article_text" : "Alphabet Inc. (NASDAQ:GOOGL) stock benefits from business diversification, continued innovation, increasing opex control, and a favorable valuation. However, Canaccord Genuity believes the single most important short-term metric is Websites revenue growth. In 2015, this metric accelerated from 13% to 20% and has remained above that point throughout 2016. Mobile search and YouTube are the two primary drivers of this, and Canaccord believes this dynamic has not run its course just yet.\n\nAdditionally, other parts of the non-core business (including Play, Cloud, and programmatic), should provide growth tailwinds beyond 2017. Canaccord continues to believe revenue growth can stay high, margins can expand modestly, and valuation has room to grow owing to multiple expansion. In the possible event that revenue growth slows to the low-double-digit range, Canaccord believes the earnings multiple can expand based on examining the long history of MSFT stock during a similar, multi-year transition.\n\nCanaccord believes the most important positive over the past 18 months has been the re-acceleration of Websites revenue growth, which progressed from 13% in Q2/15 to 16% in Q3 and 20% in Q4. It has stayed well above 20% so far this year and is an important psychological level for the stock. Despite lapping the addition of a third mobile search ad unit last quarter, Canaccord believes further innovations will extend growth, including tests of a fourth mobile ad unit and more robust adoption of PLAs.\n\nQualitatively, Canaccord observed that ad load expanded dramatically in 2015-2016. Canaccord also started noticing that skippable ads were being replaced by non-skippable more often. Quantitatively, Canaccord counts over 15 innovations and announcements for the YouTube service over the last two years. Canaccord believes this non-core unit is getting considerable attention in order to capture even more spend from TV. Original and licensed content is also increasing on the platform, which should help viewing time expand.\n\nIn addition to becoming more equity shareholder friendly, the management team is also beginning to rein in costs from “moonshot” projects. Google Fiber has had mixed results in some cities and higher-than-expected costs in others. It is reportedly cutting 9% of its workforce and pausing or ending operations in 10 cities where not fully deployed. Nest experienced a CEO change recently and the autonomous car unit was spun out of Google X into its own unit, Waymo.", "sentiment_subjectivity" : 0.4823107380424452, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e881d41c8139af6932f" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.libraryforsmartinvestors.com/2017/01/alphabet-inc-nasdaqgoogl-acquires-limes-audio-improve-hangouts-video-conferencing-capabilities/41369978.htm&cid=52779334574741&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNF6h8rcBCuIx4CDAu1rnO6pSMh7IA" ], "sentiment_polarity" : 0.2364725056689343, "headline" : [ "Alphabet Inc (NASDAQ:GOOGL) Acquires Limes Audio To Improve Hangouts Video ..." ], "article_text" : "Alphabet Inc (NASDAQ:GOOGL) has moved to improve sound quality on its video conferencing app, Hangouts, with the acquisition of Swedish company, Limes Audio. The startup boasts of a technology that has proved to be reliable in removing noise, distortion and echoes, which the tech giant plans to use to improve its conferencing products.\n\nLimes Audio-Hangouts Integration\n\nTerms of the deal remain under wraps, Limes Audio having raised $2.4 million last year in a financing round. In a blog post, the tech giant has confirmed that Limes Audio technology will mostly be integrated into Hangouts and Chromebox for Meetings. With the integration, Limes Audio looks destined to shut down completely even on the app’s founders suggesting that they will continue collaborating with the community going forward.\n\nThe acquisition comes at a time when Google has been aggressive in improving video chat in some of its apps. Hangouts and Chromebox are some of the apps that the company is paying more attention to as it looks to make a name for itself with video conferencing. It has also launched a rival to Microsoft’s Skype and Apple FaceTime dubbed, Duo, which boasts of one-to-one video calling capabilities.\n\nHangouts Sound Quality\n\nUpgrading hangouts sound quality should go a long way in affirming Google credentials on video conferencing an area it has played a secondary role to Microsoft’s Skype.\n\n“As more and more businesses adopt our video conferencing solutions, powered by Chromebox for Meetings and Google Hangouts, it’s critical that we provide a great audio experience. With G Suite customers now relying on video communications for their day-to-day meetings, it’s more important than ever to ensure low-cost, high-quality audio,” said Google Cloud Director of Product Management Serge Lachapelle\n\nLimes Audio acquisition has once again reaffirmed Sweden’s pool of talent that has seen a number of startups acquired in the recent past by tech giants. The startup follows another acquisition a communication company, Marratech that Google acquired for $15 million in 2007 later on followed by data visualization startup Trendalyzer.\n\nPlease Subscriber to the Smart Investors Newsletter Join our mailing list to receive the latest news on what the billionaire investors are doing with their portfolios. SUBSCRIBE! You have Successfully Subscribed!\n\nAdvanced Real-Time Chart: If not automatically loaded with the correct symbol related to this article, you can manually enter it (ex. AAPL) to update the chart.", "sentiment_subjectivity" : 0.5392290249433107, "date" : [ "Jan 6, 2017" ] }
{ "_id" : { "$oid" : "58c78e891d41c8139af69330" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://etfdailynews.com/2017/01/04/indian-government-taps-google-to-help-with-cybersecurity/&cid=52779331538484&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNE1TwzCzxxdSE1WX2gYueUMQxksFQ" ], "sentiment_polarity" : 0.1600970017636685, "headline" : [ "Indian Government Taps Google To Help With Cybersecurity" ], "article_text" : "From StockNews.com : India’s government has realized it’s ill-equipped to handle the onslaught of hackers in the 21st century, and has tapped Alphabet Inc ( NASDAQ:GOOGL ) child company Google to help out.\n\nThe move comes amid high-profile hacks of Yahoo, Target, and other massive American firms in recent years. From Mashable:\n\nIndia’s outspoken IT, Law and Justice Minister Ravi Shankar Prasad today requested Sundar Pichai to make Google more involved with India’s cyber security efforts. “In a larger push, I want Google to be involved in a more meaningful way. The more digital we go, the more challenges there will be in terms of cybersecurity,” Shankar said onstage at an event where Pichai announced Digital Unlocked initiative for India’s small and medium sized businesses.\n\n“Google is as much an Indian company as American. The sheer number of people in India who have accepted you means you have an obligation for India as much as you have for the United States,” Prasad continued.\n\nThe feeling is reciprocal. Google recently unveiled plans to bring free internet access to over a billion users worldwide, with hundreds of millions of those residing in India. It’s already partnered with Indian rail companies to provide access via certain train stations, with many more on the way.\n\nAlphabet Inc shares were unchanged in premarket trading Wednesday. Over the past year, GOOGL has gained 3.86%, versus a 13.12% rise in the benchmark S&P 500 index during the same period.\n\nGOOGL currently has an StockNews.com POWR Rating of A (Strong Buy), and is ranked #1 of 44 stocks in the Internet category.\n\nThis article is brought to you courtesy of StockNews.com.", "sentiment_subjectivity" : 0.3816578483245149, "date" : [ "Jan 4, 2017" ] }
{ "_id" : { "$oid" : "58c78e891d41c8139af69331" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://seekingalpha.com/article/4040173-fight-killer-robots&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGRy_FiOtO6aFs3Bhdzmlnkmz_aGg" ], "sentiment_polarity" : 0.1173534798534799, "headline" : [ "How To Fight Killer Robots" ], "article_text" : "Welcome to the Terminator issue of M&A Daily\n\nGoogle\n\nGoogle (GOOG/GOOGL), Facebook (NASDAQ:FB), Amazon (NASDAQ:AMZN), IBM (NYSE:IBM), Microsoft (NASDAQ:MSFT), and now Apple (NASDAQ:AAPL) are teaming up against any potential Skynet. Their Partnership on Artificial Intelligence confronts the issues in the field of AI and machine learning.\n\nIs this kind of thing a real threat? Tesla's (NASDAQ:TSLA) Elon Musk and Stephen Hawking have both warned that it has the potential to end our species, so it is worth paying attention to. Humans could soon create machines that can surpass humans at learning. Hawkins cautioned that,\n\nIt would take off on its own, and re-design itself at an ever increasing rate. Humans, who are limited by slow biological evolution, couldn't compete, and would be superseded.\n\nFor a rebuttal, I asked Apple's Siri if AI is a threat. In a somewhat menacing monotone, she said only that it is an,\n\nInteresting question…\n\nLattice\n\nThe definitive proxy was filed for the Canyon Bridge acquisition of Lattice (NASDAQ:LSCC). Lattice shareholders vote February 28. The $1.10 arb spread offers a 59% IRR if the deal closes by May.\n\nLevel 3\n\nA revised proxy statement was filed for the CenturyLink (NYSE:CTL) acquisition of Level 3 (NASDAQ:LVLT).\n\nEndurance\n\nEndurance (NYSE:ENH) shareholders approved their acquisition by Sompo (OTCPK:SMPNY).\n\nBrocade\n\nBrocade (NASDAQ:BRCD) shareholders approved their acquisition by Broadcom (NASDAQ:AVGO).\n\nLifeLock\n\nLifeLock (NYSE:LOCK) shareholders approved the acquisition by Symantec (NASDAQ:SYMC).\n\nStillwater\n\nToday is the HSR, CFIUS and preliminary proxy filing deadline in for the Sibanye (NYSE:SBGL) acquisition of Stillwater (NYSE:SWC). The $0.91 arb spread offers a 16% IRR if the deal closes by June.\n\nWGL\n\nThe definitive merger agreement was filed for the AltaGas (OTCPK:ATGFF) acquisition of WGL (NYSE:WGL).\n\nMoneygram\n\nThe definitive merger agreement was filed for the Ant Financial acquisition of Moneygram (NYSE:MGI).\n\nFairPoint\n\nThe preliminary S-4 was filed for the Consolidated Communications (NASDAQ:CNSL) acquisition of FairPoint (NASDAQ:FRP).\n\nCascade\n\nThe preliminary S-4 was filed for the First Interstate (NASDAQ:FIBK) acquisition of Cascade (NASDAQ:CACB).\n\nRite Aid\n\nToday is the walk date for the Walgreens (NASDAQ:WBA) acquisition of Rite Aid (NYSE:RAD). More to come in future editions of M&A Daily…\n\nElsewhere on Seeking Alpha\n\nBeyond Seeking Alpha\n\nSifting the World\n\nPlease join us, especially if you like:\n\nMerger arbitrage plays\n\nLong ideas with a looming event that will unlock the underlying value in the stock\n\nMutual holding conversions, odd lots, and quirky credit card and other opportunities that could pay off your subscription in and of themselves\n\nA vibrant and real-time chat room with some of the best investors I know\n\nDiscovering structural mispricings in the market to take advantage of\n\nYou can also check what members say about the service.\n\nDisclosure: I am/we are long LSCC, RAD, SWC.\n\nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nAdditional disclosure: Chris DeMuth Jr and Andrew Walker are portfolio managers at Rangeley Capital. We invest with a margin of safety by buying securities at discounts to their intrinsic value and unlocking that value through corporate events. To maximize returns for our investors, we reserve the right to make investment decisions regarding any security without notification except where notification is required by law. This post may contain affiliate links, consistent with the disclosure in such links. We manage diversified portfolios with a multi-year time horizon. Positions disclosed in articles may vary in sizing, hedges, and place within the capital structure. Disclosed ideas are related to a specific price, value, and time. If any of these attributes change, then the position might change (and probably will).\n\nEditor's Note: This article discusses one or more securities that do not trade on a major U.S. exchange. Please be aware of the risks associated with these stocks.", "sentiment_subjectivity" : 0.4793650793650794, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e8a1d41c8139af69332" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/56741-alphabet-inc-googl-google-launches-instant-tethering-feature/&cid=52779357167468&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGfzhb81EmjafBwlPDGUmYTS8EWbg" ], "sentiment_polarity" : 0.1250790875790875, "headline" : [ "Alphabet Inc (NASDAQ:GOOGL): Google Launches \"Instant Tethering\" Feature" ], "article_text" : "In an attempt to make it easier for users to remain connected to the Internet even when the connection is lost, Alphabet Inc (NASDAQ:GOOGL) Google recently announced that it is rolling out a new feature, dubbed as Instant Tethering, for its Android devices. Many experts believe that the main aim of the search engine giant behind this move is to create traction among the users to buy its Nexus and Pixel devices.\n\nSubsequently, the new feature has been implemented as part of Google Play services 10.2. Hence, it is worth mentioning that those who are still using the previous version Android OS on their Nexus and Pixel devices need to update this feature to benefit from it. Also, the move indicates that the search engine giant is trying to position itself as a dominant force in the tech ecosystem by offering improved and new features to its users.\n\nMany reports indicate that with the new feature users of Pixel and Nexus devices can automatically set-up a new tethering connection without making any particular settings. Also, the feature helps users to connect its devices that are associated with Google account, making it easier for the users to stay online even when the connection drops. To be more specific, when the Internet connection drops, the phone will ask it users whether they want to tether to another device that is associated with their Google account or not.\n\nIt is pertinent to mention that this feature is not available to all the Android devices as users are required to update their Google Play Services to the latest version. Also, the feature is currently limited to Google devices only. However, many tech gurus believe that this feature will soon see the light for other Android devices as well. In any case, it is yet to see whether users will appreciate this feature as Google is expecting.", "sentiment_subjectivity" : 0.4813686313686313, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e8b1d41c8139af69333" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://theusacommerce.com/2017/01/30/how-does-the-chart-look-for-alphabet-inc-googl/&cid=52779368488450&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFNOCTsOgN6M1GBv55K1fq75BJqVA" ], "sentiment_polarity" : 0.02419609079445146, "headline" : [ "How Does the Chart Look for Alphabet Inc. (GOOGL) ?" ], "article_text" : "We have gathered the technical data on Alphabet Inc. (GOOGL), and see some interesting trends in the stock’s behavior of late. In the end, it’s all about what a stock does that matters. In the case of this particular stock, the chart tells quite a story at present.\n\nGOOGL has been trading in a bearish trend, based on the relative levels of its 50-day and 200-day simple moving averages. This suggests that the broad sum of capital flow in the stock has been generally negative over the recent period. In terms of the relative level of interest afforded this stock among active participants in the market, relative volume measures have been weak, indicating apathy for the name by traders, investors, and money managers during the past month of action. This suggests something of the significance of other current technical measures as well.\n\nFor market timers, it’s also important to take measure of the relative level of recent lift or pressure in the stock is it overbought or oversold? For that, we turn to RSI and stochastic measures. The 14-day RSI stands at 62.31%. That shows that the stock, according to a traditional interpretation and usage of the RSI indicator, is not particularly predisposed to a reactive price movement based on this measure If we look at the stochastic measure, the raw data over the stock’s last month of action shows a score of 88.49%. Based on a raw data interpretation, the stock is relatively overbought from this perspective.\n\nIt should be noted that the overall volatility in the stock is worth gauging as well. In recent action, GOOGL has made a move of +40.46 over the past month. Over the trailing year, the stock is underperforming the S&P 500 by -0.66%, and it’s gotten there by action that has been more volatile on a day-to-day basis than most other stocks on the exchange. The stock’s recent movement has come on a historical volatility score of 13.81%, which represents the standard deviation of returns of a theoretical long position from a mean price during that period. On a daily basis over the past month, the average true range of the stock, as expressed in percentage terms, is 1.4%. That should give you a pretty good sense of the level of risk implied in a short-term trading approach in the stock with a stop-loss in place.\n\nAs it stands at present, the stock might find important action at key Fibonacci levels. Fibonacci levels are used by major Wall Street firm technical desks. The math is drawn from the Fibonacci series that defines growth systems by an interval increase characterized by steps divisible by the “golden ratio” of 61.8%. In this case, the critical 38.2% level drawn off the 52-weeklow of $672.66 sits at $744.61. GOOGL also has additional support below at the stock’s 200-day simple moving average, which sits at $777.51.", "sentiment_subjectivity" : 0.3343556716507536, "date" : [ "Jan 30, 2017" ] }
{ "_id" : { "$oid" : "58c78e8c1d41c8139af69334" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://stockmarketdaily.co/2017/01/26/alphabet-inc-nasdaqgoogl-ford-motor-company-nysef-microsoft-corporation-nasdaqmsft-to-reveal-their-quarterly-results-today/&cid=52779360522568&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGM_XgOGBdNSJP11nIXihJ2Ym2BLQ" ], "sentiment_polarity" : 0.02692307692307692, "headline" : [ "Alphabet Inc (NASDAQ:GOOGL) Ford Motor Company (NYSE:F) Microsoft Corporation ..." ], "article_text" : "Alphabet Inc (NASDAQ:GOOGL) Ford Motor Company (NYSE:F) Microsoft Corporation (NASDAQ:MSFT) To Reveal Their Quarterly Results Today\n\nAfter a record close on Wednesday, the stock markets will look to extend the gains. There are some big ticket earnings that could provide some direction to the market. For instance, Caterpillar Inc (NYSE:CAT), JetBlue Airways Corp (NASDAQ:JBLU) and Ford Motor Company (NYSE:F) are announcing results before the bell.\n\nThe following companies will release their December quarter results on Thursday]:\n\nAlliance Data Systems Corporation (NYSE:ADS) will reveal its results before the bell. Street is looking for an EPS of $4.66 a share.\n\nAlphabet Inc (NASDAQ:GOOGL) will report its December quarter results after the bell. Analysts are looking earnings of $9.64 a share.\n\nBiogen Inc (NASDAQ:BIIB) will release its financial numbers before the market opens. Analysts see the company delivering an EPS of $4.96.\n\nCaterpillar Inc (NYSE:CAT) to announce its financial results before the market opens. Analysts expect the company to earn $0.66 a share for the December quarter.\n\nComcast Corporation (NASDAQ:CMCSA) will release its financial results before the market opens. Analysts see the company reporting an EPS of 87 cents a share.\n\nFord Motor Company (NYSE:F) will report before the bell. Market expects earnings of 33 cents a share for the fourth quarter.\n\nIntel Corporation (NASDAQ:INTC) is scheduled to disclose its three-month performance after the market closes. Analysts expect the chip maker to reveal EPS of 75 cents.\n\nJetBlue Airways Corp (NASDAQ:JBLU) will disclose its financial numbers before the bell. Analysts expect the company to earn 49 cents a share.\n\nMicrosoft Corporation (NASDAQ:MSFT) to release its three-month results after the market closes. Analysts are looking for earnings of $0.78 a share\n\nPulteGroup Inc (NYSE:PHM) is scheduled to announce its results after the market closes. Analysts’ are looking for an EPS of 59 cents.\n\nRaytheon Companh (NYSE:RTN) will announce its three-month performance before the bell. Analysts expect the company to report earnings of $1.87 a share.\n\nUnisys Corp (NYSE:UIS) will disclose its financial results after the normal market closes. Analysts expect the company to earn three cents a share.\n\nVMware Inc (NASDAQ:VMW) would release its quarterly numbers after the bell. Market expects the company to deliver an EPS of $1.4.\n\nWhirlpool Corp (NYSE:WHR) will report before the regular market opens. Analysts see the company delivering $4.39 earnings per share for the December quarter.\n\nWynn Resorts Ltd. (NASDAQ:WYNN) will release its results after the market close. Analysts are looking for an EPS of 86 cents.\n\nThe following economic data will be disclosed after the regular marketing is cover.", "sentiment_subjectivity" : 0.1002958579881657, "date" : [ "Jan 26, 2017" ] }
{ "_id" : { "$oid" : "58c78e8e1d41c8139af69335" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://theusacommerce.com/2017/01/03/alphabet-inc-nasdaqgoog-and-fiat-chrysler-automobiles-nysefcau-are-combining-to-create-android-based-infotainment-system/&cid=52779328336977&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFQGk3NF9E1nIiixvb6hH0UhHR1jA" ], "sentiment_polarity" : 0.1874401913875598, "headline" : [ "Alphabet Inc. (NASDAQ:GOOG) and Fiat Chrysler Automobiles (NYSE:FCAU) are ..." ], "article_text" : "Internet giant Alphabet Inc. (NASDAQ:GOOG) and car-maker Fiat Chrysler Automobiles NV (NYSE:FCAU) announced that they combine to build a new infotainment system on Androids platform.\n\nAccording to reports the project syndicates FCA’s Connect infotainment system with Android 7.0 Nougat. It retains the carmaker’s user interface while mixing a number of apps like Google Assistant and Maps, as well as extra Android apps like Pandora, Spotify, and others.\n\nMeanwhile it’s an extension of a partnership between the two firms that saw Chrysler working with Google to build 100 Pacifica minivans combined with Google’s self-directed driving hardware and software.\n\nThe search engine giant firm recently revealed its desire to have Android used in every user-facing system in the car, integrated into anything from climate control and audio controls to the speedometer. That system is open-source and offered for customization to the car maker’s tastes, even comprising support for Android Auto and CarPlay. Many car-makers believe their infotainment user interface is an extension of the car make itself, which makes customizability enormously vital.\n\n“With Android, we are able to maintain our unique and intuitive Uconnect user interface, all while integrating our easy-to-use systems with Android’s features and ecosystem of applications,” said Chris Barman, FCA’s head of electrical engineering, in a statement.\n\nFurthermore if car-maker firms can save time and cash developing infotainment systems on top of Android, particularly with a pre-existing Android app ecosystem, the platform could takeoff. However it faces rivalry both from advanced platforms divisions within carmakers like Audi’s virtual cockpit as well as other podiums like BlackBerry’s QNX.\n\nAs most cars infotainment systems are quite hard to use, just about anything that can make them better is a must-have. Both Fiat Chrysler Automobiles (FCAU) and Alphabet (GOOG) didn’t announced the exact date when exactly this planned platform will hit the shelves.", "sentiment_subjectivity" : 0.5041866028708133, "date" : [ "Jan 3, 2017" ] }
{ "_id" : { "$oid" : "58c78e901d41c8139af69336" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.investopedia.com/news/four-industries-where-alphabet-hit-brakes-goog/&cid=52779342577879&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHAFJNZnOHstCgkkaFDDnw-3h6z7Q" ], "sentiment_polarity" : 0.009811348781937018, "headline" : [ "Four Industries Where Alphabet Hit Brakes (GOOG)" ], "article_text" : "According to a report in tech publication Business Insider, Alphabet Inc. subsidiary Google (GOOG) has killed its solar drone project, also known as Project Titan. This marks the second project that the Mountain View, Calif.-based company has exited in less than a week.\n\nAnd that's not the end of it. The company's robot division, Boston Dynamics, is on the block for a sale, while it has also instituted cuts to Google X, the company's division for wild ideas.\n\nGoogle's moves are a sobering about-turn for a company famous for its moonshots. The decision to rein them in is part of the company's renewed focus on paring down costs after the arrival of former Morgan Stanley CFO Ruth Porat. They are also proof that the company's zeal to reinvent entire industries may have hit a reality roadblock. (See also: How Alphabet Inc. Reworked Its Letters This Year.)\n\nThe following is a list of industries that Google has pulled out of or applied the brakes on in the past couple of years.\n\nAugmented Reality (Google Glass)\n\nThe augmented reality glasses made a splash when they were first launched back in 2013. The device essentially consisted of a pair of glasses connected to the Internet and fitted with a camera that enabled wearers to browse the net and take photographs at the same time. However, even extravagant photo spreads in fashion magazines could not dim privacy concerns related to the device. They never caught on in mainstream society, and in 2015, Google closed the Explorer program associated with the device.\n\nBroadband (Google Fiber)\n\nKansas City made headlines in 2011 when it was selected to become the first city to receive Google Fiber. Subsequently, 12 more cities were added to the list of cities with Google's high-speed Internet broadband service. In October last year, the company announced a halting of expansion to new cities and cut down staff for the unit.\n\nBased on reports, the unit was responsible for a majority of the $280 million capital expenditures related in Alphabet's \"Other Bets\" division. But the company’s CFO Ruth Porat reminded investors in a quarterly call that the company still has a broadband presence in 18 cities (in addition to the Webpass acquisition). She said the company was pausing expansion for \"exploratory discussions\" and to \"integrate technology work.\" (See also: Google Halts Expansion Of Fiber Project.)\n\nSatellite Imaging (Terra Bella)\n\nWhen Google bought Skybox Imaging (the division's earlier name) for $500 million in 2014, it wanted to use the startup's technology for Google Maps and to spread Internet access in remote regions of the world. Two years later, however, the company seems to have rethought that mission and is reported to be in talks to sell the division off to a competitor in exchange for an equity stake. (See also: Alphabet in Talks to Sell Satellite Imaging Startup.)\n\nRobotics (Boston Dynamics)\n\nGoogle acquired Boston Dynamics in 2013 for an undisclosed sum and established a robotics division called Replicant in 2014. It released viral videos about life with robots earlier this year. However, the robotics unit is said to be up for sale after senior executives concluded that the unit will not be making money, at least for the next couple of years. The move also represents a possible end to Google's foray into robotics. According to a Bloomberg report last year, there is no longer a separate robotics division within Google. (See also: Why Alphabet Is Looking to Sell Its Robotics Unit.)", "sentiment_subjectivity" : 0.2977644087938205, "date" : [ "Jan 12, 2017" ] }
{ "_id" : { "$oid" : "58c78e911d41c8139af69337" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.nasdaq.com/article/wendell-david-associates-inc-buys-cdk-global-inc-dentsply-sirona-inc-alphabet-inc-sells-cm737153&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGlqySLmxrUYWJKGg938Wop_mhRGQ" ], "sentiment_polarity" : -0.08383838383838382, "headline" : [ "Wendell David Associates Inc Buys CDK Global Inc, Dentsply Sirona Inc ..." ], "article_text" : "New Purchases: CDK , XRAY , PRAA , HPQ,\n\nAdded Positions:GOOGL, SBUX, SYK, EL, DHR, MKC, AMT, INTU, DIS, BR,\n\nReduced Positions:GILD, SRCL, ADP, ABBV, IDXX, CVS, TSCO, PFF, MCD, JNJ,\n\nSold Out:KYN, VSM, QCP,\n\nFor the details of WENDELL DAVID ASSOCIATES INC's stock buys and sells, go to http://www.gurufocus.com/StockBuy.php?GuruName=WENDELL+DAVID+ASSOCIATES+INC\n\nAutomatic Data Processing Inc ( ADP ) - 250,033 shares, 5.08% of the total portfolio. Shares reduced by 2.62% Mastercard Inc ( MA ) - 185,602 shares, 3.78% of the total portfolio. Shares reduced by 0.68% TJX Companies Inc ( TJX ) - 232,578 shares, 3.45% of the total portfolio. Shares reduced by 0.42% Ecolab Inc ( ECL ) - 144,993 shares, 3.36% of the total portfolio. Shares reduced by 0.33% Stryker Corp ( SYK ) - 134,719 shares, 3.19% of the total portfolio. Shares added by 2.64%\n\nWendell David Associates Inc initiated holdings in CDK Global Inc. The purchase prices were between $53.71 and $60.99, with an estimated average price of $57.2. The stock is now traded at around $60.33. The impact to the portfolio due to this purchase was 0.49%. The holdings were 41,689 shares as of 2016-12-31.\n\nWendell David Associates Inc initiated holdings in Dentsply Sirona Inc. The purchase prices were between $55.83 and $61.19, with an estimated average price of $59.08. The stock is now traded at around $55.48. The impact to the portfolio due to this purchase was 0.32%. The holdings were 28,317 shares as of 2016-12-31.\n\nWendell David Associates Inc initiated holdings in PRA Group Inc. The purchase prices were between $27 and $39.1, with an estimated average price of $34.09. The stock is now traded at around $37.53. The impact to the portfolio due to this purchase was 0.15%. The holdings were 19,740 shares as of 2016-12-31.\n\nWendell David Associates Inc initiated holdings in HP Inc. The purchase prices were between $13.8 and $16.16, with an estimated average price of $15.14. The stock is now traded at around $14.52. The impact to the portfolio due to this purchase was 0.08%. The holdings were 27,700 shares as of 2016-12-31.\n\nWendell David Associates Inc added to the holdings in Alphabet Inc by 92.07%. The purchase prices were between $753.22 and $835.74, with an estimated average price of $799.67. The stock is now traded at around $833.85. The impact to the portfolio due to this purchase was 0.27%. The holdings were 3,586 shares as of 2016-12-31.\n\nWendell David Associates Inc added to the holdings in The Estee Lauder Companies Inc by 33.53%. The purchase prices were between $75.84 and $88.31, with an estimated average price of $81.29. The stock is now traded at around $79.37. The impact to the portfolio due to this purchase was 0.07%. The holdings were 17,823 shares as of 2016-12-31.\n\nWendell David Associates Inc sold out the holdings in Versum Materials Inc. The sale prices were between $22.46 and $28.72, with an estimated average price of $24.89.\n\nWendell David Associates Inc sold out the holdings in Kayne Anderson MLP Investment Company. The sale prices were between $18.21 and $20.35, with an estimated average price of $19.38.\n\nWendell David Associates Inc sold out the holdings in Quality Care Properties Inc. The sale prices were between $12.48 and $19, with an estimated average price of $15.23.\n\nWendell David Associates Inc reduced to the holdings in Gilead Sciences Inc by 22.58%. The sale prices were between $71.61 and $78.47, with an estimated average price of $74.33. The stock is now traded at around $70.50. The impact to the portfolio due to this sale was -0.21%. Wendell David Associates Inc still held 45,343 shares as of 2016-12-31.\n\nWendell David Associates Inc reduced to the holdings in State Street Corp by 23.61%. The sale prices were between $68.63 and $81.44, with an estimated average price of $75.27. The stock is now traded at around $78.39. The impact to the portfolio due to this sale was -0.02%. Wendell David Associates Inc still held 3,899 shares as of 2016-12-31.\n\nThis article first appeared on GuruFocus .", "sentiment_subjectivity" : 0.4421436588103256, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e911d41c8139af69338" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.forbes.com/sites/adamsarhan/2017/01/23/earnings-preview-what-to-expect-from-alphabet-google-on-thursday/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGNnXjO3p6XExnCEta2emfUlPqQcw" ], "sentiment_polarity" : 0.01, "headline" : [ "Earnings Preview: What To Expect From Alphabet -Google- On Thursday" ], "article_text" : "Alphabet Inc ($GOOGL) is scheduled to release earnings after Thursday's close. Alphabet is one of the so-called F.A.N.G. stocks (read here), is a leading stock, and is widely by investors of all size. To help you prepare, here is what the Street is expecting:\n\nEarnings Preview:\n\nAlphabet is expected to report earnings of $9.65/share on $20.51 billion in revenue. Meanwhile, the so-called Whisper number is $10.00. The Whisper number is the Street's unofficial view on earnings.\n\nCompany Profile:\n\nAlphabet Inc., incorporated on July 23, 2015, is a holding company. The Company holds interests in Google Inc. (Google). The Company's segments include Google and Other Bets. Google segment includes Internet products, such as Search, Ads, Commerce, Maps, YouTube, Apps, Cloud, Android, Chrome, Google Play, and hardware products, including Chromecast, Chromebooks and Nexus, which are sold by the Company. Its technical infrastructure and Virtual Reality are also included in Google segment. Google segment is engaged in advertising, sales of digital content, applications and cloud services, as well as sale of Google branded hardware. The Other Bets segment consists of various operating segments and includes businesses, such as Access/Google Fiber, Calico, Nest, Verily, GV, Google Capital, X and other initiatives. Other Bets segment is engaged in the sale of Nest hardware products, Internet and television services through Google Fiber, and licensing and research and development (R&D) services through Verily. Google offers products, including Gmail, which is an e-mail service; Chrome, which is a browser, and Google Play, which allows access to movies, books, music and application on various devices. Google offers platforms, including Chrome OS and Android mobile operating system.\n\nThe Company offers advertising solutions for businesses with a range of products across screens and devices. It delivers performance advertising and brand advertising. Its performance advertising lets its advertisers connect with users. It offers AdWords, which is an auction-based advertising program that helps to create text-based advertisements that appear on Google Websites and the Websites of Google Network Members using its advertising programs to deliver relevant advertisements together with their search results and content. Its performance advertising also includes AdSense program to deliver relevant advertisements. Google Websites consist of AdWords; YouTube, including YouTube TrueView and Google Preferred, and properties, including Gmail, Finance, Maps and Google Play. Google Network Members' Websites consist of AdSense (such as AdSense for Search and AdSense for Content), AdExchange, AdMob, DoubleClick Bid Manager, and other network products, including AdSense for Domains. The Company helps brand advertisers to deliver digital videos and other types of advertisements to specific audiences for marketing campaigns. It distributes advertisements, such as the TrueView advertisements displayed on its YouTube videos. It has an advertisement technology platform for brand advertisers, agencies and publishers to help in digital marketing businesses.", "sentiment_subjectivity" : 0.3230000000000001, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e931d41c8139af69339" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://finance.yahoo.com/news/alphabet-googl-beat-earnings-estimates-135501213.html&cid=52779357508997&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFAiE_woP1y02359N5CJiekZDEW5w" ], "sentiment_polarity" : 0.07122208931419456, "headline" : [ "Alphabet (GOOGL): Will it Beat Earnings Estimates in Q4?" ], "article_text" : "Alphabet Inc. GOOGL will report fourth-quarter 2016 earnings on Jan 26 after the bell.\n\nThe surprise history has been decent in Alphabet’s case. The company missed estimates just once in the last four quarters, that too by a small margin.\n\nComing to the price performance, over the past one year, shares of Alphabet have been steadily treading higher. The stock has returned 12.89% compared with the Zacks categorized Internet Services industry’s gain of 12.78%.\n\nView photos\n\nWhat Happened in the Last Reported Quarter?\n\nAlphabet’s third-quarter earnings surpassed the Zacks Consensus Estimate for revenues which also grew year over year. The increase was primarily driven by the boom in Mobile Search, with the ongoing strength in YouTube. Also, strength in programmatic advertising and Play aided revenue growth. Other Bets revenues remained lumpy.\n\nFactors at Play in Q4\n\nThe main drivers of the Google business haven’t changed. Pricing remains under pressure, both on account of the ongoing FX concerns as well as continued strength in mobile and TrueView. Volumes are however encouraging as total paid click growth was a reassuring 33% last quarter.\n\nGoogle has gained strength in the mobile platform. Management is focused on driving mobile experiences and the company is well positioned to pick up strong intent-to-buy signals as a result of studying mobile searches from its huge database. As a result, revenue from mobile platform is expected to increase in the upcoming results.\n\nYouTube remains a strong contributor benefiting from the increase in online video consumption. More than a thousand creators are currently engaged with the platform, bringing in a thousand subscribers every day.\n\nAlso, Google has turned more aggressive toward the commercialization of its self-driving cars. It aims to expand its revenues from this segment in the upcoming release. However, the current regulatory environment doesn’t support fully automated cars, so there could be some problems on their part.\n\nGoogle’s cloud business trails Amazon’s AWS, Microsoft’s Azure and IBM. The company’s cloud business is expected to well in the to-be reported quarter. And finally, Google platforms like Android, Chrome and Daydream continue to help it draw more users and sell more ads.\n\nOn a cautionary note, Google’s troubles in the EU are mounting and despite its attempts to appease authorities by investing in the region, the region may prove much more expensive for it. Google is not providing for this outflow, which could mean that it still has a reasonable chance to come out victorious. But the developments are worth keeping an eye on as these are the main reasons for the overhang on the company’s shares.\n\nEarnings Whispers\n\nOur proven model does not show that Alphabet will beat on earnings this third quarter. That is because a stock needs to have both a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) for this to happen. That is not the case here as you will see below.\n\nThe company’s Zacks Rank #2 and Earnings ESP of -0.26% make surprise prediction difficult. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nWe don’t recommend Sell-rated stocks (Zacks Rank #4 or 5) going into the earnings announcement.\n\nAlphabet Inc. Price and EPS Surprise", "sentiment_subjectivity" : 0.5168759968102073, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e941d41c8139af6933a" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://stockmarketdaily.co/2017/01/23/week-ahead-alphabet-inc-nasdaqgoogl-microsoft-corporation-nasdaqmsft-and-verizon-communications-inc-nysevz-to-report-their-quarterly-results/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNG0I3aWQRFZmtPvLlrQiSiQ9FaHfQ" ], "sentiment_polarity" : 0.06666666666666667, "headline" : [ "Week Ahead: Alphabet Inc (NASDAQ:GOOGL), Microsoft Corporation (NASDAQ:MSFT ..." ], "article_text" : "The stock markets snapped five-days of losing streak on Friday. The markets will look to consolidate the gains recorded on Friday. The upcoming earnings and economic data could be a pointer to the sentiments.\n\nThe following are some of the key companies that will report their results this week:", "sentiment_subjectivity" : 0.4333333333333333, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78e951d41c8139af6933b" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/93735-shaky-quarter-blocks-solid-core-profit-growth-for-alphabet-inc-googl-bank-of-america-crop-merrill-lynch/&cid=52779361869045&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNH7Tmp-sCj1mMhfxoTAW8lSbmgnzQ" ], "sentiment_polarity" : 0.05949471675278126, "headline" : [ "Shaky Quarter Blocks Solid Core Profit Growth for Alphabet Inc. (GOOGL): Bank ..." ], "article_text" : "Alphabet Inc. (NASDAQ:GOOGL) reported net revenue of $21.2bn (up 23% y/y), better than Bank of America Merrill Lynch's $20.7bn and the Street at $20.6bn. Website revenue tracked largely in-line with BAML's model (+22% y/y exFX), with upside coming primarily from Network (programmatic) and Other (cloud, hardware, Google Play). Non-GAAP EPS of $9.36 was below BAML's $9.77 and the Street at $9.63, but was due to a ~$0.36 impact from 1x equipment charges and $0.44 est. from higher taxes. Overall, in-line Website revs., higher COGS & taxes, lack of disclosure, and lack of buybacks are muddying a solid quarter for core margins and profit growth.\n\nWebsite ex-FX y/y revenue growth decelerated 310bps vs 3Q to 22%, in-line with BAML's estimate and still strong, but disappointing given positive recent channel checks. That said, 2H16 deceleration of 5.5% is not bad vs the 6.3% acceleration in 2H15, and on a 2year combined growth basis, 4Q growth was down < 1% vs 3Q. Bank of America Merrill Lynch sees opportunity for stable to re-accelerating growth in 2H17 as comps ease and GDP potentially accelerates. Any ad format changes announced in 2Q/3Q will be closely watched.\n\nBAML raised its 2017E net revenue/EPS to $88.53bn/$41.80 from $86.01bn/$41.22 and 2018 to $103.41bn/$48.21 from $99.72bn/$46.99. The firm's upward revisions are primarily driven by higher growth assumptions for Cloud, Hardware, and Play, partially offset by lower margins. Excluding Other Bets losses, BAML's 2017E core Google EPS goes to $45.38 (previously $45.21) and 2018 to $52.67 (previously $51.05). BAML raised its 2017 GAAP EPS to $32.59 from $32.19 and 2018 to $37.26 from $36.68.\n\nWhile the lack of Website upside was disappointing, overall growth trends remain solid and core margin contraction was better than feared. BAML is encouraged with the strong showing for emerging drivers in Cloud and Hardware and is optimistic on continued YouTube strength. BAML reiterated its Buy and PO of $1,025 based on 17x core Google non-GAAP EPS (ex-Other Bets) plus cash, or 21x core Google GAAP EPS plus cash.\n\n\n\nThe companies mentioned in this article are subjects of research reports issued recently by investment firms. Their opinions in no way represent those of SmartStockNews.com", "sentiment_subjectivity" : 0.3920832751477912, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e971d41c8139af6933c" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.libraryforsmartinvestors.com/2017/01/amazon-com-inc-nasdaqamzns-innovative-strategy-beating-alphabet-inc-nasdaqgoogl-apple-inc-nasdaqaapl/41369946.htm&cid=52779365311673&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEI0anSrf9Iv8Ww1vNbrbzedQNB-A" ], "sentiment_polarity" : 0.1911686343959071, "headline" : [ "How Amazon.com, Inc.'s (NASDAQ:AMZN) Innovative Strategy is Beating Alphabet ..." ], "article_text" : "It’s all about innovation and pushing beyond limits when it comes to growth and vision in the tech world. Amazon.com, Inc. (NASDAQ:AMZN) clearly beats Apple Inc. (NASDAQ:AAPL) and Alphabet Inc (NASDAQ:GOOGL) with its long term vision and product strategy.\n\nAmazon’s Pioneer Products in IoT\n\nAmazon launched its smart home assistant speaker, Amazon Echo back in 2014 when Google and Apple were just in the rudimentary stages of realizing the fact that smartphones and apps are approaching their saturation points and the future belongs to AI and Internet of Things. In 2016 holiday season, Amazon Echo and Echo Dot were the most popular devices bought by people. Echo Dot is the latest mode of Amazon Echo. It is powered by Alexa, the smart assistant which takes user voice commands and execute them. Amazon.com, Inc. (NASDAQ:AMZN) is clearly a trend setter in IoT, a market where estimated annual revenues are excepted to surpass $470 billion by 2020. Alphabet Inc’s (NASDAQ:GOOGL) Google has recently launched Android Things, a special operating system for making IoT-based mobile apps and software. Google also launched Google Home, a smart home suite, in November 2016. Alphabet has another interesting product called “Nest” which acts as a smart device to control temperature, detect fire and control devices. Apple Inc. (NASDAQ:AAPL) also has its own IoT platform, HomeKit. However, it didn’t get the expected popularity.\n\nAmazon’s Powerful Footprint in eBooks Industry\n\nAmazon.com, Inc. (NASDAQ:AMZN) receives a huge chunk of its revenue from its Kindle product line. The company started selling Kindle reading devices based on the popularity of eBooks. Today, Amazon has over 70% of eBook market share. Alphabet Inc (NASDAQ:GOOGL) and Apple Inc. (NASDAQ:AAPL) do not have a footprint in this area.\n\nAmazon Dwarfing Google, Apple in Cloud\n\nAmazon remains the leader in Cloud services, thanks to its sterling Cloud platform, Amazon Web Services (AWS). Amazon’s AWS revenue in 2016 is expected to come in at $12 billion, compared to $7.9 billion last year. Over the past four quarters, AWS accounted for two-thirds of Amazon’s operating profits. Amazon.com’s, Inc. (NASDAQ:AMZN) only competitors in this area are Alphabet Inc (NASDAQ:GOOGL) and Microsoft. Apple has no Cloud platform for advanced Enterprise. Its iCloud service is only for iOS and Mac users. Apple’s adherence to its ecosystem-centric approach may cost the company dearly in the future.\n\nAmazon’s Revolutionary Technology in Retail\n\nAmazon recently revealed Amazon Go, a disruptive new way to do shopping in stores. Amazon Go promises to change the way we shop forever. Amazon Go promises no checkout lines and quick shopping in an unprecedented way. Check out this video to see what Amazon Go is all about and how it works.\n\nProblem with Apple and Google\n\nApple Inc. (NASDAQ:AAPL) is focusing entirely on trying to reinvigorate growth in its iPhone product line, which has clearly lost steam, and future is not looking very promising, as well. Apple slashed its iPhone 7 production orders by 10% for the first quarter of 2017, a clear sign that the company will have to tap into other areas like IoT, robots, content and AI. Alphabet Inc’s (NASDAQ:GOOGL) Google deserves appreciation on its ambitious “moonshot” projects. From robots to energy and self-driving cars, Alphabet Inc (NASDAQ:GOOGL) has invested in to multiple product lines. But the company seems to have an execution problem. It has invested millions in moonshot projects so far has faced problems after failing to properly use its robotics startups.\n\nAmazon’s Future is Bright\n\nAmazon.com, Inc. (NASDAQ:AMZN) is also working on new product delivery methods, self-driving trucks, streaming content and drones. The company has a flexible working structure and no standardization, thanks to Jeff Bezos’ vision.\n\nSign up to receive a complimentary subscription to the Smart Investors Newsletter, plus insights, analysis, and special offers sent straight to your inbox. Sign Up Now! You have Successfully Subscribed!\n\nAdvanced Real-Time Chart: If not automatically loaded with the correct symbol related to this article, you can manually enter it (ex. AAPL) to update the chart.", "sentiment_subjectivity" : 0.4890830381739472, "date" : [ "Jan 2, 2017" ] }
{ "_id" : { "$oid" : "58c78e981d41c8139af6933d" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://marketexclusive.com/new-android-wear-alphabet-inc-nasdaqgoogl-launches-february-9/69076/&cid=52779351257231&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGYKHyeBrnMI51sORzw75QlVyN93Q" ], "sentiment_polarity" : 0.1711471861471862, "headline" : [ "New Android Wear From Alphabet Inc (NASDAQ:GOOGL) Launches On February 9" ], "article_text" : "Alphabet Inc (NASDAQ:GOOGL) is ready to launch its two Android Wear 2.0 Smartwatches according to the famous American blogger and phone leaker, Evan Blass. The new products, Watch Sport and Watch Style will be introduced on Feb 9 alongside other anticipated updates. Rumor has it that the Smartwatches will be powered by the latest version of Android Wear, which is also slated to become available next month. Further claims indicate that Google has been working with LG, efforts that have resulted in the launch of the first ever Smartwatches.\n\nApparently, there has been mixed excitement about Smartwatches and a majority are of the opinion that the 2.0 might just be the savior. Notable features of the LG Smartwatches according to VentureBeat include Google Assistant integration.\n\nMore in terms of features\n\nEach of the models has unique features the likes of a circular 1.2-inch 360×360 pixel display, 512MB of RAM and 240mAh battery for the Watch Style and 1.38-inch 480×480 screen, 768MB of RAM and a 430mAh battery for the Watch Sport.\n\nIn addition, they will both sport built-in Bluetooth and Wi-Fi, features that will facilitate navigation in a similar way to Apple’s iWatch. They will be able to accommodate 4GB of storage.\n\nLaunch of Wear 2.0 delayed by redesigning of OS\n\nThe Android Wear market has been stagnant for a couple of months now. A majority of vendors have been shying away from new products due to the dominance of the older smart watches as well as a lukewarm market. However, the launch of 2.0 would not have come any earlier because on response to the developer’s comments, the need to redesign its OS arose.\n\nNonetheless, a caption on the Wear 2.0 web page states, “Get ready for the next version of Android Wear! Support stand-alone Wear devices and apps. Create enhanced user interaction and glanceable experiences. Test your apps on Wear devices.”\n\nMeanwhile, Alphabets stock closed at $829.02 witnessing an increase $1.56 or 0.19%.\n\nPlease enable JavaScript to view the comments powered by Disqus.", "sentiment_subjectivity" : 0.4397445887445887, "date" : [ "Jan 19, 2017" ] }
{ "_id" : { "$oid" : "58c78e991d41c8139af6933e" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://stockmarketdaily.co/2017/01/27/stocks-to-watch-alphabet-inc-nasdaqgoogl-microsoft-corporation-nasdaqmsft-intel-corporation-nasdaqintc-starbucks-corporation-nasdaqsbux-and-few-more/&cid=52779361368997&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGZ_kFladrozKgcBYQi53wDddc0cQ" ], "sentiment_polarity" : 0.05446428571428571, "headline" : [ "Stocks To Watch: Alphabet Inc (NASDAQ:GOOGL), Microsoft Corporation (NASDAQ ..." ], "article_text" : "As the stock market is looking for some cues, there are at least five to seven stocks that are worth watching on Friday. These included Alphabet Inc (NASDAQ:GOOGL), Microsoft Corporation (NASDAQ:MSFT), Intel Corporation (NASDAQ:INTC) and Starbucks Corporation (NASDAQ:SBUX). Aside from these, Chevron Corporation (NYSE:CVX) and Honeywell International Inc (NYSE:HON) are scheduled to disclose their earnings number before the bell.\n\nAlphabet Inc (NASDAQ:GOOGL) reported adjusted earnings of $9.36 a share for the fourth quarter that missed analysts’ estimate of $9.64 a share. The company’s top line, which grew 22.18 percent to $26.06 billion, however topped the analysts’ expectations of $25.23 billion. The earnings miss could mean that the company is facing pricing pressure on advertisements placed on its platform.\n\nMicrosoft Corporation (NASDAQ:MSFT): The company announced adjusted earnings of 83 cents a share for the December quarter, which topped analysts’ estimate by four cents. Its revenue of $24.09 billion came in below the analysts’ expectations of $25.28 billion.\n\nIntel Corporation (NASDAQ:INTC): The chip maker reported adjusted profit per share of 79 cents for the fourth quarter on revenue of $16.37 billion, which witnessed 9.79 percent growth. Both topped the Street analysts’ estimates of 75 cents a share on revenue of $15.75 billion.\n\nStarbucks Corporation (NASDAQ:SBUX): The company revealed operating earnings of 52 cents a share for the December quarter, which is in line with the Street estimates. Its top line, which advanced 6.69 percent to $5.73 billion, fell short of analysts’ predictions of $5.85 billion. The company reiterated its full year adjusted EPS of $2.12 – $2.14 while Street analysts are looking for an EPS of $2.14.\n\nJuniper Networks, Inc. (NYSE:JNPR) reported earnings of 66 cents a share on total revenue of $1.39 billion for the fourth quarter. Street analysts estimate the company to report 63 cents a share on revenue of $1.36 billion. Its guidance for the second quarter fell short of estimates. The company guided EPS 38 – 44 cents a share for the first quarter while analysts expected 45 cents.\n\nWynn Resorts, Limited (NASDAQ:WYNN): The company reported earnings of 50 cents a share for the fourth quarter. This is short of analysts’ expectations of 86 cents a share. However, revenue, which was $1.30 billion, came in above the expected level of $1.26 billion.\n\nAmerican Airlines Group Inc (NASDAQ:AAL) to reveal its financial results before the bell. Market sees an EPS of $0.91.\n\nChevron Corporation (NYSE:CVX) to announce its December quarter results. Street expects the company to report EPS of $0.66.\n\nColgate-Palmolive Co (NYSE:CL) is slated to reveal its financial results before the market opens. Analysts are looking for an EPS of 75 cents.\n\nHoneywell International Inc (NYSE:HON) to release its quarterly numbers. Analysts are looking for an EPS of $1.74.", "sentiment_subjectivity" : 0.244757326007326, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e9c1d41c8139af6933f" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.bloomberg.com/news/articles/2017-01-27/microsoft-intel-alphabet-results-buoyed-by-cloud-boom&cid=52779360217224&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGUaIC-oyjpoyScCHze9r4RsrhTTw" ], "sentiment_polarity" : 0.1401038688774538, "headline" : [ "Microsoft, Intel, Alphabet Results Buoyed by Cloud Boom" ], "article_text" : "Alphabet Inc., Microsoft Corp. and Intel Corp., which all posted quarterly results Thursday, reinforced what’s become a truism in technology: the biggest growth is in businesses that deliver computing over the internet.\n\nMicrosoft topped projections on the strength of rising customer sign-ups for its cloud offerings like Azure, which saw revenue almost double. Intel sales rose more than expected, helped by orders for processors that power data-center servers -- the machines at the heart of cloud computing.\n\nWhile profit at Google parent Alphabet disappointed, the numbers also signaled that heavy spending to catch cloud leaders Amazon.com Inc. and Microsoft is paying off. Google’s Other Revenue line, which includes cloud computing, jumped 62 percent to $3.4 billion in the fourth quarter.\n\n\"Our cloud business is on a terrific upswing,\" Google Chief Executive Officer Sundar Pichai said Thursday during a conference call with analysts. \"I definitely think we’re going to have a great year.\"\n\nWhat started a decade ago as an easy way for startups to run websites has turned into an increasingly popular way for companies of all sizes to access the software needed to run their operations. Many big technology companies are in a strong position to provide this because they already have huge data centers to support their own web services.\n\n‘Disruptive Forces’\n\nMore than $1 trillion in IT spending will be directly or indirectly affected by the shift to cloud during the next five years, Gartner estimated in July. \"This will make cloud computing one of the most disruptive forces of IT spending since the early days of the digital age,\" the research firm said at the time.\n\nStock prices reflect this optimism. Microsoft and Alphabet shares hit a record this week. Microsoft gained 2.2 percent, Google was down about 1 percent and Intel rose 1.5 percent at 1:57 p.m. Friday in New York.\n\nMicrosoft Chief Executive Officer Satya Nadella has been working to reposition the company around such internet services. In addition to robust demand for Azure, consumers and corporations continue to purchase Office 365, a cloud-based version of the company’s productivity software that includes Word and Excel. Almost 25 million consumers are now subscribed to Office 365, Microsoft said, and sales increased 47 percent in the fiscal second quarter.\n\n\"As long as cloud is growing, people are happy,” said Mark Moerdler, an analyst at Sanford C. Bernstein & Co., who rates Microsoft shares outperform. “If margins are growing, people are even happier.\"\n\nMicrosoft’s Effort\n\nExclusive insights on technology around the world. Get Fully Charged, from Bloomberg Technology.\n\nRedmond, Washington-based Microsoft has been spending on data centers and adding products to win new cloud customers. Chief Financial Officer Amy Hood said in July that gross margins, a measure of profitability, for the commercial cloud business would \"materially improve\" in the current year. That’s because previous years of investment are starting to pay off as those data centers support more customers.\n\nMicrosoft has pledged to reach annualized revenue of $20 billion in its corporate cloud business by the fiscal year that ends in June 2018. That metric stood at more than $14 billion at the end of the second quarter.\n\nIntel’s fourth-quarter sales of server chips to cloud service providers jumped 30 percent from a year earlier. Offsetting that, companies and government agencies spent 7 percent less than they had in the same quarter in 2016 on equipping their in-house computer rooms, the company said.\n\n“It’s moving to the public cloud, it’s moving to those areas at a faster rate than I think we expected,” Intel Chief Executive Officer Brian Krzanich said on a conference call.\n\nAmazon reports earnings next week and analysts at RBC Capital Markets expect the company’s AWS cloud business to generate $3.6 billion in fourth-quarter revenue, up 50 percent from a year earlier.\n\n\"Microsoft is the plumbing in the cloud,\" Moerdler said. \"Amazon is much bigger, but still Amazon and Microsoft are pulling away from the pack.”", "sentiment_subjectivity" : 0.3993329521631408, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78e9d1d41c8139af69340" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://simplywall.st/news/2017/01/29/will-alphabet-incs-goog-earnings-grow-in-next-12-months/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNE7iRfMh3iFcoLllmxzXTPSWNhB7Q" ], "sentiment_polarity" : 0.07471631205673759, "headline" : [ "Will Alphabet Inc's (GOOG) Earnings Grow In Next 12 Months?" ], "article_text" : "Based on the latest analyst predictions Alphabet Inc (NASDAQ:GOOG) is estimated to grow its earnings 18% over the next year. What should potential investors be aware of? I’m going to investigate the latest data and look into some metrics you shouldn’t overlook. View our latest analysis for Alphabet\n\nCan we expect GOOG to keep growing?\n\nInvestors in Alphabet have been patiently waiting for the uptick in earnings and if you believe the 37 analysts covering the stock then the next 3 years will be very interesting. We are expecting to see the earnings grow around 62.9% and earnings per share estimates range from $37.57 to $63.51.\n\n\n\n\n\n\n\nIn the same period we will see the revenue increase from $90.27 Billion to $153.93 Billion in 2020 and net income is predicted to grow from $19,478 M to $45,802 M in 2020, roughly growing 2.4x. Margins are predicted to be extremely healthy during this time as well.\n\nIs the growth built on solid basis?\n\nAlphabet has underperformed the average growth in earnings of the Software industry over the past year.\n\nWhilst GOOG’s Return on Equity of 15% isn’t horrific, it means that the company has underperformed the Software industry average of 22.72%. This is expected to slightly improve with analysts expecting ROE in 3 years to be 17.9%.\n\n\n\n\n\nReturn on equity (ROE) is a measure of how much profit (net income) a company makes as a percentage of the shareholders equity. Equity is made up of funds from the original issuing of shares and any retained earnings from previous financial years. It varies considerably across sectors, for this reason it is important to asses a stocks ROE relative to its industry. Whilst it is true that the higher the ROE the better the company is performing, ROE does have a weakness. A stock with a disproportionate amount of debt can lead to a small equity base. Thus, a small amount of net income (the numerator) could still produce a high ROE off a modest equity base (the denominator). For this reason investors should always consider the debt situation in conjunction with ROE.\n\nConclusion\n\nAlphabet is a fast growing company, but as Warren Buffett’s right-hand man Charlie Munger said, “No matter how wonderful a business is, it’s not worth an infinite price“. Is GOOG overpriced? Or could it be considered an undervalued opportunity? I recommend you see our latest FREE analysis to find out!\n\nIf you are not interested in GOOG anymore, you can use our free platform to see my list of over 150 other stocks with a high growth potential.", "sentiment_subjectivity" : 0.4981560283687944, "date" : [ "Jan 29, 2017" ] }
{ "_id" : { "$oid" : "58c78e9f1d41c8139af69341" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.ibtimes.com/google-ar-shopping-tech-alphabet-inc-partners-bmw-gap-2470003&cid=52779333572399&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFYL9vRK59WGqELUXxu3ve9z3aUfA" ], "sentiment_polarity" : 0.1374289772727273, "headline" : [ "Google AR Shopping Tech: Alphabet Inc. Partners With BMW, Gap" ], "article_text" : "Google is working to create new shopping experiences for consumers. The company announced retail partnerships with BMW and Gap Inc. to use its augmented reality (AR) platform Project Tango and work towards creating a shopping experience in which shoppers do not need to be physically present at the retail outlet, but they can choose products as if they were.\n\n“We see a lot of use of this technology in retail, for measuring your garage or buying big-ticket items like kitchens for example,” Eric Johnsen, business development executive, augmented reality at Google, spoke at CES in Las Vegas on Wednesday, where the deals were announced.\n\nTango uses computer vision comprising of technologies such as 3D mapping, motion-tracking and AR instead of GPS to help devices sense their environments.\n\nGoogle’s technology venture will use cameras and sensors in smartphone to create digital images in physical spaces, the best example of which is the AR game Pokémon Go.\n\nWhile Google’s deal with Gap Inc. will help consumer shop in Gap stores just like they would usually do — checking out and trying out merchandize, its deal with BMW is a little different.\n\nWith BMW, Google is trying out an AR app which will display its i3 and i8 cars on smartphone screens.\n\nCar buyers will be able to check out superimposed vehicles and will not just be able to choose from different colors, trims and wheels but will also be able to place a high-resolution image of the vehicle inside their garage or driveway. BMW says that the app will be available at dealerships globally.", "sentiment_subjectivity" : 0.3764001623376624, "date" : [ "Jan 5, 2017" ] }
{ "_id" : { "$oid" : "58c78ea01d41c8139af69342" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/49659-fx-a-headwind-for-alphabet-inc-facebook-inc-amazoncom-inc-and-paypal-holdings-inc/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGQMW63mXS4TisrwePAkyX7g7gf2Q" ], "sentiment_polarity" : 0.1455729166666667, "headline" : [ "F/X a headwind for Alphabet Inc., Facebook Inc, Amazon.com Inc. and Paypal ..." ], "article_text" : "With the USD appreciating versus major currencies since the U.S. presidential elections, Cantor Fitzgerald believes F/X will negatively impact 4Q results relative to expectations set in Oct./early-Nov. These F/X headwinds will be particularly apparent in results for companies with material international exposure, namely Alphabet Inc. (NASDAQ:GOOGL), Facebook Inc. (NASADQ:FB), Amazon.com Inc. (NASDAQ:AMZN) and Paypal Holdings Inc (NASDSQ:PYPL).\n\nAssuming the strong USD trade prevails, Cantor would expect 2017 outlook and estimates (from companies that guide) to be relatively cautious on international growth (all else equal/ex. hedging), even as strong consumer sentiment domestically drives healthy demand.\n\nAmazon (int'l revs ~32%): A 2.4% gain in the USD vs. a basket of currencies from what Cantor believes is assumed in managements 4Q16 guidance should result in revenue headwind of ~$334M and ~$0.02 negative impact on EPS (FactSet consensus is $44.68B/$1.39 for rev./EPS vs. Cantor’s $44.26B/$1.26 estimates). On a Y/Y basis, F/X should result in a 90bps hit to top line growth vs. management’s assumption for a 60bps tailwind. For 2017, Cantor’s forecast (using prevailing rates) yields a headwind of $2.08B to revenues and ($0.14) impact on EPS (2017 consensus is $168.2B/ $8.74).\n\nFacebook (int'l revs ~54%): For 4Q, a 250bp decline in a basket of currencies vs. the USD should result in revenue headwind of $116M and a ($0.02) impact on EPS (FactSet consensus is $8.70B/$1.13 for rev./EPS). For 2017, Cantor expects F/X to result in a 270bp hit to top line growth, resulting in a headwind of $732M/($0.14) to revenues/EPS (consensus at $36.71B/$5.21).\n\nGoogle (int'l revs. ~54%): For 4Q, a 200bp increase in a basket of currencies vs. the USD should result in revenue headwind of $102M, and ($0.06) impact on EPS (FactSet consensus is $20.54B/$9.64 for rev./EPS). For 2017, Cantor expects a 130bp hit to top line growth, resulting in a headwind of $931M/($0.58) to revenues/EPS (consensus at $85.30B/$41.23). That said, Cantor thinks GOOGL's hedging program could offset much of this impact.\n\nPayPal (int'l revs ~50%): For 4Q16, Cantor expects F/X to result in a ~$15M headwind to revenue and no meaningful impact on EPS vs. its estimates for $2,981M/$0.42 (FactSet consensus is at $2,977M/$0.42). For 2017, Cantor expects an incremental headwind of $223M on revenue and ($0.02) impact on EPS from F/X vs. consensus at $12.63B/$1.73.", "sentiment_subjectivity" : 0.3635416666666667, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78ea01d41c8139af69343" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://www.thecerbatgem.com/2017/01/26/goldman-sachs-group-inc-the-analysts-give-alphabet-inc-goog-a-970-00-price-target.html&cid=52779361294549&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEPQ2NqL_cq-vVZeebLiXKsBesuQA" ], "sentiment_polarity" : 0.04726759116589625, "headline" : [ "Goldman Sachs Group, Inc. (The) Analysts Give Alphabet Inc. (GOOG) a $970.00 ..." ], "article_text" : "Goldman Sachs Group, Inc. (The) set a $970.00 target price on Alphabet Inc. (NASDAQ:GOOG) in a research note issued to investors on Monday morning. The brokerage currently has a buy rating on the stock.\n\nGOOG has been the topic of several other research reports. Mizuho reissued a buy rating and set a $1,025.00 price objective (up previously from $1,020.00) on shares of Alphabet in a research note on Friday, October 28th. Needham & Company LLC reaffirmed a buy rating and issued a $925.00 target price (up from $900.00) on shares of Alphabet in a report on Friday, October 28th. Canaccord Genuity reaffirmed a buy rating and issued a $900.00 target price on shares of Alphabet in a report on Monday, October 24th. RBC Capital Markets set a $880.00 target price on shares of Alphabet and gave the stock a buy rating in a report on Tuesday, December 20th. Finally, Cantor Fitzgerald reaffirmed a buy rating and issued a $1,040.00 target price (up from $1,000.00) on shares of Alphabet in a report on Friday, October 28th. One research analyst has rated the stock with a sell rating, four have issued a hold rating and forty-four have issued a buy rating to the company. The stock presently has an average rating of Buy and an average price target of $946.69.\n\nAlphabet (NASDAQ:GOOG) opened at 836.69 on Monday. The company has a market capitalization of $576.68 billion, a P/E ratio of 30.62 and a beta of 0.93. The stock’s 50 day moving average is $797.24 and its 200-day moving average is $776.06. Alphabet has a 52-week low of $663.06 and a 52-week high of $838.00.\n\nCOPYRIGHT VIOLATION WARNING: “Goldman Sachs Group, Inc. (The) Analysts Give Alphabet Inc. (GOOG) a $970.00 Price Target” was first reported by The Cerbat Gem and is owned by of The Cerbat Gem. If you are reading this news story on another site, it was stolen and republished in violation of international copyright and trademark laws. The original version of this news story can be accessed at https://www.thecerbatgem.com/2017/01/26/goldman-sachs-group-inc-the-analysts-give-alphabet-inc-goog-a-970-00-price-target.html.\n\nIn related news, CEO Lawrence Page sold 16,670 shares of the stock in a transaction that occurred on Friday, October 28th. The shares were sold at an average price of $827.79, for a total value of $13,799,259.30. Following the completion of the transaction, the chief executive officer now directly owns 105,670 shares of the company’s stock, valued at approximately $87,472,569.30. The sale was disclosed in a legal filing with the Securities & Exchange Commission, which is accessible through the SEC website. Also, insider Diane B. Greene sold 4,042 shares of the stock in a transaction that occurred on Tuesday, November 1st. The shares were sold at an average price of $797.97, for a total transaction of $3,225,394.74. Following the completion of the transaction, the insider now directly owns 89,569 shares of the company’s stock, valued at $71,473,374.93. The disclosure for this sale can be found here. Insiders sold a total of 766,258 shares of company stock valued at $603,293,578 over the last ninety days. 13.92% of the stock is currently owned by insiders.\n\nA number of institutional investors have recently bought and sold shares of GOOG. Bank of Montreal Can acquired a new position in Alphabet during the second quarter worth about $927,982,000. Magellan Asset Management Ltd raised its position in Alphabet by 186.5% in the second quarter. Magellan Asset Management Ltd now owns 1,435,391 shares of the company’s stock worth $993,434,000 after buying an additional 934,412 shares in the last quarter. Russell Investments Group Ltd. acquired a new position in Alphabet during the fourth quarter worth about $612,676,000. Winslow Capital Management LLC acquired a new position in Alphabet during the second quarter worth about $498,110,000. Finally, The Manufacturers Life Insurance Company acquired a new position in Alphabet during the third quarter worth about $474,985,000. 34.66% of the stock is owned by institutional investors.\n\nAbout Alphabet\n\nAlphabet Inc is a holding company. The Company holds interests in Google Inc (Google). The Company’s segments include Google and Other Bets. Google segment includes Internet products, such as Search, Ads, Commerce, Maps, YouTube, Apps, Cloud, Android, Chrome, Google Play, and hardware products, including Chromecast, Chromebooks and Nexus, which are sold by the Company.\n\nReceive News & Stock Ratings for Alphabet Inc. Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet Inc. and related stocks with our FREE daily email newsletter.", "sentiment_subjectivity" : 0.3299409347714432, "date" : [ "Jan 26, 2017" ] }
{ "_id" : { "$oid" : "58c78ea11d41c8139af69344" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/62992-alphabet-inc-google-finally-releases-its-first-android-712-public-beta-for-pixel-phones/&cid=52779365575570&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNEb3CoxwgHhrTyDGe0pUO6ycmp3yQ" ], "sentiment_polarity" : 0.2204076479076479, "headline" : [ "Alphabet Inc.: Google Finally Releases Its First Android 7.1.2 Public Beta For ..." ], "article_text" : "The search engine giant, Alphabet Inc (NASDAQ:GOOGL) Google, came under the spotlight again as it released the first beta build of Android 7.1.2 on Monday. The new version of Android is currently available for Pixel, Pixel C, Pixel XL, Nexus 5X and Nexus Player and reports indicate that the update will soon be available for Nexus 6P.\n\nThe search engine giant claims to have many new innovative features and improved performance in its recent Android update. Many analysts believe that this move seems to be a part of Google’s bigger plan to create traction among the users to buy its Pixel devices. Also, the tech giant mentioned in its blog post that the new version of Android is “an incremental maintenance release focused on refinements.\"\n\nMoreover, as the competition in the smartphone industry continues to surge at a fast pace, it seems that Google is making efforts to muster significant amount of market share by offering new and improved features to its users. Also, Google confirmed that its Android 7.1.2 is set for a public release in the coming few months, and the company mainly focused on fixing bugs to boost the performance. However, those using Pixel can update their device to the newly released beta program.\n\nIt is worth mentioning that Google’s main rival, Apple, experienced a drop in the sales of iPhone for the first time during the last fiscal year. Hence, many analysts believe that this is the right time for Google to release its new update for Android as it will help in enticing users to switch to its platform. In any case, it is yet to be seen whether the Android update will help the tech titan in enticing users to buy its Pixel devices.", "sentiment_subjectivity" : 0.5118217893217893, "date" : [ "Jan 31, 2017" ] }
{ "_id" : { "$oid" : "58c78ea11d41c8139af69345" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/83782-alphabet-inc-googl-htc-vive-design-team-head-joins-google-to-work-on-daydream/&cid=52779358950801&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHmmeiQOweMBa2IItidceEtgtvgJQ" ], "sentiment_polarity" : 0.09524410774410774, "headline" : [ "Alphabet Inc.: HTC Vive Design Team Head Joins Google to Work on Daydream" ], "article_text" : "Over the past year, VR has grown immensely as an industry. 360-degree videos and virtual reality content have also taken off, and VR is now available on desktop PCs, smartphones and even consoles with the PSVR. A new contender, the HTC Vive, helped popularize the market while Samsung with the Gear VR made the technology accessible to millions of users. Today, one of the key members of the HTC Vive team, design team head Claude Zellweger left the company and joined Google to work on its VR solution, the Google Daydream.\n\nThe ex-HTC employee announced via a tweet that he was moving over to Google's Daydream team. Claude was a veteran at HTC with eight years under his belt. He worked on the design of various HTC handset including the HTC U devices, but mainly on the Vive. In a statement obtained by The Verge, HTC confirmed that the employee was departing.\n\n\"HTC can confirm that Claude Zellweger has left the Company. We appreciate his considerable contribution to HTC, and wish him well in his future endeavors. HTC continues to invest in talent and recruitment as part of our broader strategy to ensure the continued strength and integrity of the Company’s organizational structure.\"\n\nZellweger has not revealed what exactly he will be working on for Daydream, but judging by his experience, it's possible that he will be working on creating new VR headsets for the Android platform. Only time will tell what strides Google will make in the VR space now that the competition is heating up.", "sentiment_subjectivity" : 0.4773569023569023, "date" : [ "Jan 26, 2017" ] }
{ "_id" : { "$oid" : "58c78ea31d41c8139af69346" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://marketexclusive.com/fake-news-publishers-banned-alphabet-inc-nasdaqgoogl-ad-network/70397/&cid=52779359581548&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFa6mrSu_nydKEidj1_Alh3Tuiv2w" ], "sentiment_polarity" : 0.009640522875816985, "headline" : [ "Fake News Publishers Banned From Alphabet Inc (NASDAQ:GOOGL) Google Ad Network" ], "article_text" : "A total of 200 publishers were removed from Alphabet Inc (NASDAQ:GOOGL) ad networks following an increase in so-called fake news. The publishers were banned in the fourth quarter of 2016 in line with an update to an existing policy that sought to deter websites from offering misleading content. Who determines what content is misleading and how is the ultimate question.\n\nOn Google’s ad network it is common for advertisers to be ejected if they are found to have provided misleading or false claims. Following the proliferation of so-called fake news in 2016, offending sites were added to the blacklist.\n\nPopular vote controversy\n\nGoogle is on record for having been on the receiving end after it featured a news item from a supposed false news site. The news item alleged that Donald Trump had beaten Hillary Clinton in the popular vote count when in fact she had garnered close to three million votes more than him. Not all the publishers who were banned were purveyors of this kind of news, though.\n\nAs per the ‘bad ads’ report which Google releases at the start of every year, some of the publishers who were banned in the months of December and November last year included websites that impersonated established news media organizations. Some of the impersonators took advantage of truncated top-level domains such as ‘.co’ instead of ‘.com’. Google did not, however, list the offending sites.\n\nGoogle’s annual ‘bad ads’ report also revealed statistics on the number of ads that had been nixed. A total of 1.7 billion ads were taken down by Google for various violations. This was more than double the 780 million ads that had been removed in 2015.\n\nBetter detectors\n\nThe Mountain View, California-based tech titan has attributed the jump in ads removed to the technological improvements with regards to tools used to identify offending advertisements and advertiser behavior. In mid-2016 Google had enacted a policy that prohibited payday loan ads as it claimed they were predatory. This resulted in about five million ads of such nature disabled in the second half of 2016.\n\n“In the past year, what’s really changed is that we’ve expanded our policies so we can better protect consumers against issues like misleading ads and predatory offers,” Google’s director of product management, Scott Spencer, told Wired.\n\nIn Wednesday’s trading, Alphabet Inc rose by 1.05% to close the day at $858.45.\n\nPlease enable JavaScript to view the comments powered by Disqus.", "sentiment_subjectivity" : 0.4781045751633987, "date" : [ "Jan 26, 2017" ] }
{ "_id" : { "$oid" : "58c78ea61d41c8139af69347" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.thestockobserver.com/stocks/alphabet-inc-nasdaqgoogl-daily-sentiment-score-at-0-103/28712/&cid=0&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHcVlJFK8yJ09VmLYajOSZqjoWLcA" ], "sentiment_polarity" : 0.0005102040816326542, "headline" : [ "Alphabet Inc (NASDAQ:GOOGL) Daily Sentiment Score At 0.103" ], "article_text" : "Alphabet Inc (NASDAQ:GOOGL) has daily sentiment score of 0.103 for web articles printed on 2017-01-29. This is brought on a -1-1 scale after learning the news impact as per the system. The analysis is hooked on the reliable news sources.\n\nAlpha One places daily impact score on a scale of 1-100. This hint at whether equity has potential to jump or nosedive minimum 1% in a session. Alphabet Inc was given a 6 for today’s session. In knowing the research expert sentiment, company assessing the equity, have price target of $965.4 for 1 year. This target is as per 30 analysts that expressed their opinion in Zacks poll. These outlooks are taken on a common scale to get a single viewpoint. Bullish target is at $1080 while conservative price target is $700 on respective equity. Zacks lists all the shared calls into a single score for retail shareholders to understand sentiment on stock. It is more like an Average Broker Rating on 1-5 scale.\n\nAlphabet Inc has an ABR of 1.3. The stock rating was 1.3 in preceding quarter. Its fiscal report can be released on 2017-04-20. This results release date is shared as per the info given to market. Consensus estimated EPS is $8.95 for this quarter.\n\nWhatever ratings Zacks releases can to some extent show variance from calls given by First Call. Both the companies don’t poll same set of analysts which results in this deviance. Buy-side establishments will be referring to all the EPS guidance prior to financials release. Alphabet Inc (NASDAQ:GOOGL) posted EPS of $7.56 for period closed on 2016-12-31. The reported number was $-0.09 off from the consensus, or a variance of -1.18%. Investors tend to invest in those stocks that have given lucrative returns to their investors for considerably long time.", "sentiment_subjectivity" : 0.2776360544217687, "date" : [ "Jan 23, 2017" ] }
{ "_id" : { "$oid" : "58c78ea61d41c8139af69348" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=https://sportsperspectives.com/2017/01/04/alphabet-inc-goog-downgraded-by-vetr-inc-to-hold.html&cid=52779328232165&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNFJeRp5PXE2MJLoXF5Lk3Wxi8f76A" ], "sentiment_polarity" : 0.01200626959247649, "headline" : [ "Alphabet Inc. (GOOG) Downgraded by Vetr Inc. to “Hold”" ], "article_text" : "Vetr lowered shares of Alphabet Inc. (NASDAQ:GOOG) from a buy rating to a hold rating in a research report released on Tuesday. They currently have $810.65 price target on the stock.\n\nGOOG has been the topic of a number of other reports. reaffirmed a buy rating on shares of Alphabet in a research report on Friday, September 23rd. Deutsche Bank AG reaffirmed a buy rating and set a $1,050.00 target price on shares of Alphabet in a research report on Wednesday, October 12th. Macquarie reiterated an outperform rating and set a $975.00 price objective on shares of Alphabet in a research note on Wednesday, October 5th. RBC Capital Markets reiterated an outperform rating and set a $1,025.00 price objective (up from $1,000.00) on shares of Alphabet in a research note on Friday, September 30th. Finally, Jefferies Group reiterated a buy rating on shares of Alphabet in a research note on Friday, September 9th. One investment analyst has rated the stock with a sell rating, four have assigned a hold rating and forty-four have given a buy rating to the stock. The stock has a consensus rating of Buy and an average price target of $939.51.\n\nAlphabet (NASDAQ:GOOG) opened at 786.14 on Tuesday. The stock has a market capitalization of $541.84 billion, a price-to-earnings ratio of 28.77 and a beta of 0.93. Alphabet has a one year low of $663.06 and a one year high of $816.68. The company has a 50-day moving average of $776.48 and a 200-day moving average of $763.95.\n\nAlphabet (NASDAQ:GOOG) last issued its earnings results on Thursday, October 27th. The company reported $9.06 EPS for the quarter, topping the Zacks’ consensus estimate of $8.62 by $0.44. The business had revenue of $22.45 billion for the quarter, compared to analyst estimates of $13.17 billion. Alphabet had a net margin of 22.29% and a return on equity of 15.08%. The company’s quarterly revenue was up 20.2% compared to the same quarter last year. During the same period last year, the company posted $7.35 earnings per share. On average, equities analysts forecast that Alphabet will post $34.44 EPS for the current fiscal year.\n\nTRADEMARK VIOLATION WARNING: “Alphabet Inc. (GOOG) Downgraded by Vetr Inc. to “Hold”” was published by Sports Perspectives and is owned by of Sports Perspectives. If you are viewing this piece on another site, it was copied illegally and reposted in violation of United States and international copyright law. The correct version of this piece can be read at https://sportsperspectives.com/2017/01/04/alphabet-inc-goog-downgraded-by-vetr-inc-to-hold.html.\n\nIn other news, Director Ann Mather sold 43 shares of the company’s stock in a transaction on Tuesday, November 1st. The shares were sold at an average price of $788.10, for a total value of $33,888.30. Following the completion of the transaction, the director now owns 1,656 shares in the company, valued at approximately $1,305,093.60. The sale was disclosed in a document filed with the SEC, which is available at this link. Also, VP James Grier Campbell sold 194 shares of the company’s stock in a transaction on Friday, December 2nd. The shares were sold at an average price of $744.59, for a total transaction of $144,450.46. The disclosure for this sale can be found here. 13.92% of the stock is currently owned by insiders.\n\nSeveral hedge funds and other institutional investors have recently modified their holdings of the stock. ELCO Management Co. LLC bought a new position in shares of Alphabet during the third quarter valued at about $1,398,000. Fort Point Capital Partners LLC boosted its position in shares of Alphabet by 11.0% in the third quarter. Fort Point Capital Partners LLC now owns 2,340 shares of the company’s stock valued at $1,819,000 after buying an additional 232 shares during the last quarter. First Heartland Consultants Inc. boosted its position in shares of Alphabet by 69.3% in the third quarter. First Heartland Consultants Inc. now owns 1,547 shares of the company’s stock valued at $1,202,000 after buying an additional 633 shares during the last quarter. Accident Compensation Corp boosted its position in shares of Alphabet by 49.9% in the third quarter. Accident Compensation Corp now owns 3,306 shares of the company’s stock valued at $2,570,000 after buying an additional 1,100 shares during the last quarter. Finally, HighPoint Advisor Group LLC boosted its stake in shares of Alphabet by 3.0% in the third quarter. HighPoint Advisor Group LLC now owns 1,767 shares of the company’s stock worth $1,363,000 after buying an additional 51 shares in the last quarter. Institutional investors and hedge funds own 34.19% of the company’s stock.\n\nAlphabet Company Profile\n\nAlphabet Inc is a holding company. The Company holds interests in Google Inc (Google). The Company’s segments include Google and Other Bets. Google segment includes Internet products, such as Search, Ads, Commerce, Maps, YouTube, Apps, Cloud, Android, Chrome, Google Play, and hardware products, including Chromecast, Chromebooks and Nexus, which are sold by the Company.\n\nReceive News & Ratings for Alphabet Inc. Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Alphabet Inc. and related companies with MarketBeat.com's FREE daily email newsletter.", "sentiment_subjectivity" : 0.3142737722048067, "date" : [ "Jan 4, 2017" ] }
{ "_id" : { "$oid" : "58c78ea71d41c8139af69349" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://www.thecountrycaller.com/38151-alphabet-inc-youtube-launches-super-chat&cid=52779343756644&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNGY1UR0Yy_GJbGJZ7UtF1LLUW_0ug" ], "sentiment_polarity" : 0.3226247436773753, "headline" : [ "Alphabet Inc YouTube Launches Super Chat" ], "article_text" : "Published By: Patrick Arruda on January 13, 2017 10:18 am EST\n\nAlphabet Inc. (NASDAQ:GOOGL) YouTube has launched a new feature called \"Super Chat\" which has given creators another way to make money and even fans to interact with YouTubers easily. The feature’s timing is perfect as the company announced its plan to stop monetization of videos known as “Fan Funding.” Thus, now creators have been given another way to earn money from their content.\n\nSuper Chat will allow viewers to pin a comment on live broadcasts; a dollar bill symbol will also be seen in the chat window. Users will be able to choose through a slider to select how many dollars would they like to send to the particular YouTuber they enjoy.\n\nThe more the user will pay, the more comments will get pinned. Once the payment is made, the comment will be highlighted in another color so that live streamers can flag the paid comment. In case that particular comment is pushed off the stream, creators will still be able to click through paid comments thanks to the colorful pins which will appear at the top of the window screen.\n\nSuper Chat is simply a replacement for Fan Funding which will keep creators interested in the platform. The product manager of the company, Barbara Macdonald, said that this is one way fans will be able to reach their favorite creators on the platform and vice versa. Fan Funding was launched back in 2014, through which viewers were able to make payments by choice to creators they enjoyed. Now FF will accept sign ups but will keep on working for channels that have it till the February 28, which is when it will be discontinued.\n\nThe new tool will be available in 20 countries to creators, while viewers in 40 countries will be allowed to buy Super Chat messages. Fan Funding is being discontinued because it was not used on a large scale in the first place. Hopefully Super Chat might not give the same result. The tool is for users above 18 years, who own credit cards, but kids might be able to use it if they use their parents’ credit cards. YouTube can be given feedback for two and a half weeks of the launch of Super Chat.", "sentiment_subjectivity" : 0.5196001367053998, "date" : [ "Jan 13, 2017" ] }
{ "_id" : { "$oid" : "58c78ea71d41c8139af6934a" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/81930-alphabet-inc-googllg-g6-to-be-first-non-pixel-phone-with-google-assistant/&cid=52779359885196&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNHIldjpZ9xaumlfgd2j-scHGICVUA" ], "sentiment_polarity" : 0.1572192513368984, "headline" : [ "Alphabet Inc (GOOGL): LG G6 to Be First Non-Pixel Phone with Google Assistant" ], "article_text" : "The rumors regarding LG's upcoming flagship have been circulating, and it looks like it isn't focusing much on secrecy with this new device. First, we got a look at how the device would look like, thanks to some leaks. Now, more of details have surfaced about the feature set it will offer. Today, CNET reported that the LG G6 would come with Google Assistant built-in.\n\nThis notion would make the G6 the first phone, apart from the Pixel phones to offer the digital assistant. Users will get access to the chatbot, along with the complete voice command functionality. It seems that this year the focus on personal assistants will be great. These assistants are now considered a big selling point for the devices. Even Samsung is rumored to enter this competition with Bixby - its virtual assistant. The company recently acquired the AI startup Viv Labs to ensure a stellar product.\n\nAccording to CNET, LG was first opting to use Amazon Alexa with the LG G6; however, it decided against it since it felt that the assistant wasn't up to the task. Along with these new features, we already know a few details about the upcoming device. It is reported that the phone would feature a 5.7-inch display with an 18:9 aspect ratio, sports premium metal construction and will be waterproof. The modularity - a hit-and-miss on the G5 - has been dropped in this model. We'll know all the details about the handset when it launches on February 26.", "sentiment_subjectivity" : 0.2917112299465239, "date" : [ "Jan 27, 2017" ] }
{ "_id" : { "$oid" : "58c78ea81d41c8139af6934b" }, "url" : [ "http://news.google.com/news/url?sa=T&ct2=us&fd=S&url=http://smartstocknews.com/54197-alphabet-inc-googl-google-confirms-that-hardware-is-to-blame-for-audio-distortion-on-pixel-devices/&cid=52779348823833&ei=K47HWNHuCoHj2AaT0JS4Dg&usg=AFQjCNG0gi4XTfX5TC6SDjE1pLksw0MweA" ], "sentiment_polarity" : 0.1299603174603175, "headline" : [ "Alphabet Inc (GOOGL): Google Confirms That Hardware Is To Blame For Audio ..." ], "article_text" : "Over the past few weeks, a certain audio distortion issue plaguing many Pixel phones has been gaining a lot of traction. The issue was originally brought into the limelight by Mark Buckman, who managed to get a refund on his Pixel device after posting about the issue on Google's Product Forums.\n\nWhile that was a one-off event, Google has now officially acknowledged the existence of the issue and is offering replacement handsets for people with affected devices. Since Google is offering replacements rather than rolling out a software update to fix the issue, it’s clear that the problem is hardware related.\n\nPhoneArena also revealed that Google has stopped issuing refunds on the units like the one given to Mark Buckman. Instead, the company is asking users to opt for warranty replacements. Google has been very proactive regarding the audio distortion issues on its product forums. There have been numerous posts on the forum and the Google Pixel community manager Orrin even notified that the tech giant has been looking into the matter.\n\nOne aspect of this matter is irking a lot of users; Google isn't notifying users of the builds which have been affected by this issue. If Google would do this, users would be able to check if their current phone is faulty and would be able to check before purchasing a faulty build.\n\nEven though the Google Pixel has managed to garner amazing reviews from across the board, the phone has come under fire a few times since its launch. Just last month, numerous users reported premature shutdowns on the device, while complaints about lens flare were also rampant in the same month.", "sentiment_subjectivity" : 0.4498015873015873, "date" : [ "Jan 17, 2017" ] }
